{"Data":[{"Title":"BOURBON CHICKEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_575,h_323/v1/img/recipes/45/80/9/MwuCd6HpQ5mDvn4OLRkA_0S9A9886.jpg","Description":"I searched and finally found this recipe on the internet. It is a copycat of the Bourbon Chicken sold in Chinese carry-outs in my hometown. This recipe is so... More","Ingredients":["2, lbs boneless chicken breasts, cut into bite-size pieces","1 -2, tablespoon olive oil","1, garlic clove, crushed","1/4, teaspoon ginger","3/4, teaspoon crushed red pepper flakes","1/4, cup apple juice","1/3, cup light brown sugar","2, tablespoons ketchup","1, tablespoon cider vinegar","1/2, cup water","1/3, cup soy sauce"],"Directions":["Editor's Note: Named Bourbon Chicken because it was supposedly created by a Chinese cook who worked in a restaurant on Bourbon Street.","Heat oil in a large skillet.","Add chicken pieces and cook until lightly browned.","Remove chicken.","Add remaining ingredients, heating over medium Heat until well mixed and dissolved.","Add chicken and bring to a hard boil.","Reduce heat and simmer for 20 minutes.","Serve over hot rice and ENJOY."],"Facts":["READY IN: 35mins, SERVES: 4","UNITS: US"]},{"Title":"TO DIE FOR CROCK POT ROAST","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_573,h_322/v1/img/mpx/0279061_16x9.jpg","Description":"Amazing flavor, and so simple! No salt needed here. In fact, you may wish to use half the ranch dressing mix to cut back on the saltiness. Found this Crock-Pot pot roast ... More","Ingredients":["1, (4 -5 lb) beef roast, any kind","1, (1 1/4 ounce) package brown gravy mix, dry","1, (1 1/4 ounce) package dried Italian salad dressing mix","1, (1 1/4 ounce) package ranch dressing mix, dry","1/2, cup water"],"Directions":["Place beef roast in crock pot.","Mix the dried mixes together in a bowl and sprinkle over the roast.","Pour the water around the roast.","Cook on low for 7-9 hours.","Optional tweaks:","1. Use onion soup mix instead of ranch.","2. Add one cup of red wine along with the water.","3. Add potatoes, carrots, mushrooms, celery and onion 2-3 hours before end."],"Facts":["READY IN: 9hrs 5mins, SERVES: 8","UNITS: US"]},{"Title":"CREAMY CAJUN CHICKEN PASTA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_574,h_323/v1/img/mpx/0279070_16x9.jpg","Description":"N'awlin's style of chicken with an updated Alfredo sauce.","Ingredients":["2, boneless skinless chicken breast halves, cut into thin strips","4, ounces linguine, cooked al dente","2, teaspoons cajun seasoning (your recipe, Cajun Seasoning Mix or store-bought)","2, tablespoons butter","1, thinly sliced green onion","1/2, cup heavy whipping cream","2, tablespoons chopped sun-dried tomatoes","1/4, teaspoon salt","1/4, teaspoon dried basil","1/8, teaspoon ground black pepper","1/8, teaspoon garlic powder","GARNISH","1/4, cup grated parmesan cheese"],"Directions":["Place chicken and Cajun seasoning in a bowl and toss to coat.","In a large skillet over medium heat, saute chicken in butter or margarine until chicken is tender, about 5 to 7 minutes.","Reduce heat add green onion, heavy cream, tomatoes, basil, salt, garlic powder, black pepper and heat through.","Pour over hot linguine and toss with Parmesan cheese."],"Facts":["READY IN: 25mins, SERVES: 2","UNITS: US"]},{"Title":"OATMEAL RAISIN COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_320/v1/img/mpx/0279066_16x9.jpg","Description":"You've made oatmeal-raisin cookies before, so why try these? Because they're moist, chewy and loaded with raisins - and they're better than any you've tried before!... More","Ingredients":["WHISK TOGETHER AND SET ASIDE","2, cups all-purpose flour","1, teaspoon baking soda","1, teaspoon baking powder","1, teaspoon kosher salt","CREAM WET INGREDIENTS","1, cup unsalted butter, softened","1, cup sugar","1, cup dark brown sugar, firmly packed","2, large eggs","2, teaspoons vanilla","THEN STIR IN","3, cups oats (not instant)","1 1/2, cups raisins"],"Directions":["Preheat oven to 350 degrees .","Whisk dry ingredients; set aside.","Combine wet ingredients with a hand mixer on low.","To cream, increase speed to high and beat until fluffy and the color lightens.","Stir the flour mixture into the creamed mixture until no flour is visible.","(Over mixing develops the gluten, making a tough cookie.) Now add the oats and raisins; stir to incorporate.","Fill a #40 cookie scoop and press against side of bowl, pulling up to level dough (to measure 2 tablespoons of dough).","Drop 2-inches apart onto baking sheet sprayed with nonstick spray.","Bake 11-13 minutes (on center rack), until golden, but still moist beneath cracks on top.","Remove from oven; let cookies sit on baking sheet for 2 minutes before transferring to a wire rack to cool."],"Facts":["READY IN: 26mins, SERVES: 36","YIELD: 36 cookies, UNITS: US"]},{"Title":"BEST EVER BANANA CAKE WITH CREAM CHEESE FROSTING","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_574,h_323/v1/img/mpx/0279062_16x9.jpg","Description":"This is one of (if not) the BEST banana cake I have ever tasted! I thought the oven temp of 275 degrees  sounded a little low, but this cake baked up (and rose) beautif... More","Ingredients":["1 1/2, cups bananas, mashed, ripe","2, teaspoons lemon juice","3, cups flour","1 1/2, teaspoons baking soda","1/4, teaspoon salt","3/4, cup butter, softened","2 1/8, cups sugar","3, large eggs","2, teaspoons vanilla","1 1/2, cups buttermilk","FROSTING","1/2, cup butter, softened","1, (8 ounce) package cream cheese, softened","1, teaspoon vanilla","3 1/2, cups icing sugar","GARNISH","chopped walnuts"],"Directions":["Preheat oven to 275 degrees F (135C).","Grease and flour a 9 x 13 pan.","In a small bowl, mix mashed banana with the lemon juice; set aside.","In a medium bowl, mix flour, baking soda and salt; set aside.","In a large bowl, cream 3/4 cup butter and 2 1/8 cups sugar until light and fluffy.","Beat in eggs, one at a time, then stir in 2 tsp vanilla.","Beat in the flour mixture alternately with the buttermilk.","Stir in banana mixture.","Pour batter into prepared pan and bake in preheated oven for one hour or until toothpick inserted in center comes out clean.","Remove from oven and place directly into the freezer for 45 minutes. This will make the cake very moist.","For the frosting, cream the butter and cream cheese until smooth.","Beat in 1 teaspoon vanilla.","Add icing sugar and beat on low speed until combined, then on high speed until frosting is smooth.","Spread on cooled cake.","Sprinkle chopped walnuts over top of the frosting, if desired."],"Facts":["READY IN: 1hr 15mins, SERVES: 16","YIELD: 1 9x13 pan, UNITS: US"]},{"Title":"JO MAMA'S WORLD FAMOUS SPAGHETTI","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_574,h_323/v1/img/recipes/22/78/2/bMWnCGreSgeji8rnPIAp_JMWFS 4 - final_1 - horizontal.png","Description":"My kids will give up a steak dinner for this spaghetti. It is a recipe I have been perfecting for years and it is so good (if I may humbly say) that my kids a... More","Ingredients":["2, lbs Italian sausage, casings removed (mild or hot)","1, small onion, chopped (optional)","3 -4, garlic cloves, minced","1, (28 ounce) can diced tomatoes","2, (6 ounce) cans tomato paste","2, (15 ounce) cans tomato sauce","2, cups water (for a long period of simmering for flavors to meld. If you don't want to simmer it as long, add less)","3, teaspoons basil","2, teaspoons dried parsley flakes","1 1/2, teaspoons brown sugar","1, teaspoon salt","1/4 - 1/2, teaspoon crushed red pepper flakes","1/4, teaspoon fresh coarse ground black pepper","1/4, cup red wine (a good Cabernet!)","1, lb thin spaghetti","parmesan cheese"],"Directions":["In large, heavy stockpot, brown Italian sausage, breaking up as you stir.","Add onions and continue to cook, stirring occasionally until onions are softened.","Add garlic, tomatoes, tomato paste, tomato sauce and water.","Add basil, parsley, brown sugar, salt, crushed red pepper, and black pepper.","Stir well and barely bring to a boil.","Stir in red wine.","Simmer on low, stirring frequently for at least an hour. A longer simmer makes for a better sauce, just be careful not to let it burn!","Cook spaghetti according to package directions.","Spoon sauce over drained spaghetti noodles and sprinkle with parmesan cheese."],"Facts":["READY IN: 1hr 20mins, SERVES: 10-14","YIELD: 4 quarts, UNITS: US"]},{"Title":"YES, VIRGINIA THERE IS A GREAT MEATLOAF","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_578,h_325/v1/img/mpx/0279069_16x9.jpg","Description":"Absolutely delicious meatloaf and sauce! Those who claim they don't believe there can be such a thing as a great meatloaf will love this. Based on a meatloaf giv... More","Ingredients":["1 1/2, lbs ground beef (ground shoulder roast is good)","1, slice bread (broken or chopped finely)","1, egg","1, small vidalia onions or 1 small type sweet onion, finely chopped","1, teaspoon table salt","1/4, teaspoon black pepper","4, tablespoons ketchup","1/2 - 2/3, cup whole milk or 1/2-2/3 cup half-and-half","SAUCE","4, tablespoons apple cider vinegar","2 -4, tablespoons dark brown sugar, packed firm (to taste)","1/2, cup ketchup"],"Directions":["Meatloaf: Combine meat loaf ingredients and place into a loaf baking dish.","Smooth out top.","Sauce: Combine sauce ingredients and pour on top and sides of meatloaf.","Bake at 350 degrees F about 1 hour to 1 hour 15 minutes or until done.","ENJOY!","*The addition of 1 or 2 teaspoons of Kitchen Bouquet® makes this recipe very good.","**Recipe should be\"plump\" from the addition of the milk or Half & Half.","It should NOT be runny.","***A second batch of sauce served hot is good to serve with the meatloaf.","Nita's Note: I note that some of you are using game meat such as deer -- Deer is a very DRY meat. It is wise to HAVE some fat added to the deer -- especially to ground deer. Maybe 25 % fat, ( I recommend 1 lb of ground venison, and 1/2 lb of deer sausage for fat content), otherwise your results will be poor. I don't know about some of the other game meat some are using. Please consult an expert. The recipe is delicious as it stands! Enjoy! Nita Holleman."],"Facts":["READY IN: 1hr 20mins, SERVES: 4-5","YIELD: 1 meatloaf, UNITS: US"]},{"Title":"BEER BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_585,h_329/v1/img/recipes/73/44/0/A5wJAHiTGmrCubWmruoJ_0S9A2475.jpg","Description":"Per Google.com, the #1 recipe for Beer Bread in the world! There are a few recipes for beer bread out there, but none as simple (and tasty!) as this one. You can... More","Ingredients":["3, cups flour (sifted)","3, teaspoons baking powder (omit if using Self-Rising Flour)","1, teaspoon salt (omit if using Self-Rising Flour)","1/4, cup sugar","1, (12 ounce) can beer","1/2, cup melted butter (1/4 cup will do just fine)"],"Directions":["Preheat oven to 375 degrees.","Mix dry ingredients and beer.","Pour into a greased loaf pan.","Pour melted butter over mixture.","Bake 1 hour, remove from pan and cool for at least 15 minutes.","UPDATED NOTES: This recipe makes a very hearty bread with a crunchy, buttery crust. If you prefer a softer crust (like a traditional bread) mix the butter into the batter instead of pouring it over the top.","Sifting flour for bread recipes is a must-do. Most people just scoop the 1 cup measure in the flour canister and level it off. That compacts the flour and will turn your bread into a \"hard biscuit\" as some have described. That's because they aren't sifting their flour! If you do not have a sifter, use a spoon to spoon the flour into the 1 cup measure. Try it once the \"correct\" way and you will see an amazing difference in the end product.","I have had many email from you kind folks about using non-alcoholic beverages instead of beer. That is fine to do but I highly recommend adding a packet of Dry Active Yeast or 2 teaspoons of Bread (Machine) Yeast so that you get a proper rise.","The final result should be a thick, hearty and very tasteful bread, NOT A BRICK! ;).","Thank you all for the incredibly nice comments and those of you who left a bad review - learn to sift sift SIFT! You will be amazed at the results you get."],"Facts":["READY IN: 1hr 3mins, SERVES: 6-8","UNITS: US"]},{"Title":"KITTENCAL'S ITALIAN MELT-IN-YOUR-MOUTH MEATBALLS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/mpx/0279064_16x9.jpg","Description":"Cooking the meatballs in simmering pasta sauce will not only add so much extra flavor to the sauce the meatballs will be melt-in-your-mouth tender, you may of course oven-b... More","Ingredients":["1 1/2, lbs ground beef (a mixture of 1 pound ground beef and 1/2 pound ground pork will work well also)","1, large egg, slightly beaten","1/2, cup grated parmesan cheese","1/3, cup breadcrumbs (or use enough to hold the meat together (no dry breadcrumbs? just soak 3 slices of bread in the 1/3 )","1 -2, tablespoon fresh minced garlic (or use 1 teaspoon garlic powder or to taste)","1 -2, teaspoon salt (or to taste, I use 2 teaspoons seasoned salt)","1, teaspoon fresh ground black pepper","1/3, cup milk (can use up to 1/2 cup milk)","1/2, teaspoon dried oregano (optional, or to taste)","1/4, cup chopped fresh parsley (or 2 tablespoons dried parsley)"],"Directions":["Mix all ingredients together in a large bowl.","Shape into small meatballs (at this point you can place on a jelly-roll/baking sheet and freeze to use later, or cover with plastic wrap refrigerate up to 24 hours before using).","Drop the meatballs into simmering pasta sauce, do not stir for at least 20 minutes or you will risk breaking the meatballs.","Continue cooking in the simmering sauce for another 20 minutes (depending on how fast your sauce is simmering 40 minutes total should fully cook the meatballs).","After the 40 minutes cooking time continue cooking your sauce with the meatballs in for as long as desired.","**note** you may also bake the meatballs at 350 degrees F for 25 minutes or until cooked through."],"Facts":["READY IN: 50mins","YIELD: 1 1/2 pounds, UNITS: US"]},{"Title":"SCALLOPED POTATOES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/mpx/5458742_16x9.jpg","Description":"Here's a great scalloped potato recipe that's so easy and absolutely delicious. The leftovers are just as good, maybe even better, the next day. This is on... More","Ingredients":["4, cups thinly sliced potatoes","3, tablespoons butter","3, tablespoons flour","1 1/2, cups milk","1, teaspoon salt","1, dash cayenne pepper","1, cup grated sharp cheddar cheese","1/2, cup grated cheese, to sprinkle on top","paprika"],"Directions":["In a small sauce pan, melt butter and blend in flour.","Let sit for a minute.","Add all of cold milk, stirring with a whisk.","Season with salt and cayenne.","Cook sauce on low until smooth and boiling, stirring occasionally with a whisk.","Reduce heat and stir in cheese.","Place a half of the sliced potatoes in a lightly greased one quart casserole dish.","Pour half of cheese sauce over potatoes.","Repeat with second layer of potatoes and cheese sauce.","Sprinkle the remaining cheese on top.","Top with some paprika for color.","Bake uncovered for about 1 hour at 350 degrees F."],"Facts":["READY IN: 1hr 15mins, SERVES: 6","UNITS: US"]},{"Title":"OLIVE GARDEN COPYCAT ZUPPA TOSCANA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_574,h_323/v1/img/mpx/5458760_16x9.jpg","Description":"This is a clone of the Olive Garden Zuppa Toscana. Tried and true, approved by former Olive Garden chefs.”","Ingredients":["1, lb Italian sausage (I like mild sausage)","2, large russet baking potatoes, wash, sliced in half, and then in 1/4 inch slices","1, large vidalia onion, chopped","4, slices cooked bacon, chopped","1, teaspoon Accent seasoning (optional)","1/2, teaspoon salt","1/4, teaspoon black pepper","1/2, teaspoon red pepper flakes","2, garlic cloves, minced or 1 tablespoon of minced garlic from jar","2, cups packed in measuring cup kale or 2 cups swiss chard, chopped","2, (8 ounce) cans chicken broth, add i envelope of chicken bouillon for extra flavor","1, quart water","2, teaspoons flour or 2 teaspoons cornstarch, mixed with enough water to make a paste","1, cup heavy whipping cream (tempered)"],"Directions":["Chop or slice uncooked sausage into small pieces and cook until browned and meat is ground in bottom of your soup pan over med-high heat.","Add onions, garlic, salt, pepper, and red pepper flakes to Sausage and cook until onions are clear and aromatics of the seasonings blend together.","Reduce heat back to medium and place, potatoes, in the pot. and slowly add the Chicken Stock and water and stir. (use Chicken Bouillon envelope for extra flavor is Chicken Stock is weak).","Cook on medium heat until potatoes are done and stir occasionally. Once Potatoes are done, Add flour or cornstarch and simmer for another 15 minutes.","Reduce heat to lowest setting and sprinkle in your kale and cooked bacon and slowly pour cream while stirring.","Check for taste and then serve."],"Facts":["READY IN: 1hr, SERVES: 4-6","UNITS: US"]},{"Title":"PANCAKES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/mpx/0279067_16x9.jpg","Description":"This is really a great recipe! It is fast, simple and you usually have the ingredients on hand. I never use a mix! I got this from my sister years ago, and I have shared it ... More","Ingredients":["1, egg","3/4, cup milk","2, tablespoons butter or 2 tablespoons margarine, melted","1, cup flour","1, tablespoon sugar (or 1/2 teaspoon honey or molasses)","1, teaspoon baking powder","1/2, teaspoon salt"],"Directions":["Beat egg until fluffy.","Add milk and melted margarine.","Add dry ingredients and mix well.","Heat a heavy griddle or fry pan which is greased with a little butter on a paper towel.","The pan is hot enough when a drop of water breaks into several smaller balls which 'dance' around the pan.","Pour a small amount of batter (approx 1/4 cup) into pan and tip to spread out or spread with spoon.","When bubbles appear on surface and begin to break, turn over and cook the other side."],"Facts":["READY IN: 10mins","YIELD: 9 small pancakes, UNITS: US"]},{"Title":"THE BEST EASY BEEF AND BROCCOLI STIR-FRY","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_605,h_340/v1/img/mpx/5458753_16x9.jpg","Description":"I clipped this recipe from Taste of Home magazine several years ago and have found it to be the best-tasting easy beef and broccoli stir-fry. It is credited to Ruth Stahl. I often use c... More","Ingredients":["3, tablespoons cornstarch, divided","1/2, cup water, plus","2, tablespoons water, divided","1/2, teaspoon garlic powder","1, lb boneless round steak or 1 lb charcoal chuck steak, cut into thin 3-inch strips","2, tablespoons vegetable oil, divided","4, cups broccoli florets","1, small onion, cut into wedges","1/3, cup reduced sodium soy sauce","2, tablespoons brown sugar","1, teaspoon ground ginger","hot cooked rice, for serving","toasted sesame seeds, for serving (optional)"],"Directions":["In a bowl, combine 2 tablespoons cornstarch, 2 tablespoons water and garlic powder until smooth.","Add beef and toss.","In a large skillet or wok over medium-high heat, stir-fry beef in 1 tablespoon oil until beef reaches desired doneness; remove and keep warm.","Stir-fry onion in remaining oil for 4-5 minutes until softened. Add the broccoli and cook for 3 minutes until the broccoli is tender but still crisp. Return beef to pan.","Combine soy sauce, brown sugar, ginger and remaining 1 tablespoon cornstarch and 1/2 cup water until smooth; add to the pan.","Cook and stir for 2 minutes.","Serve over rice and garnish with toasted sesame seeds (optional)."],"Facts":["READY IN: 25mins, SERVES: 4","UNITS: US"]},{"Title":"BETH'S MELT IN YOUR MOUTH BARBECUE RIBS (OVEN)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/mpx/5458743_16x9.jpg","Description":"I almost didn't want to share this ribs recipe because this is one of the dishes that I make that keep my sons coming back home! These can be done with baby b... More","Ingredients":["4, lbs pork ribs, membrane removed","3/4, cup light brown sugar","1, teaspoon hickory smoke salt, if you cannot find, you can substitute 1 1/2 to 2 teaspoons Hickory liquid smoke","1, tablespoon paprika","1, tablespoon garlic powder","1/2, teaspoon ground red pepper (optional)","2, cups of your favorite barbecue sauce (mine is Sweet Baby Ray)"],"Directions":["Preheat oven to 300 degrees F. Line a baking sheet with two layers of foil, shiny side out.","Peel off tough membrane that covers the bony side of the ribs.","Season the ribs on both sides with salt and pepper. If using, divide the Hickory liquid smoke evenly over the ribs.","In a medium bowl, combine the light brown sugar, paprika, garlic powder and ground red pepper. Apply the rub to all sides of the ribs.","Lay ribs on the prepared baking sheet, meaty side down.","Lay two layers of foil on top of ribs and roll and crimp edges tightly, edges facing up to seal.","Transfer to the oven and = bake for 2-2 1/2 hours or until meat is starting to shrink away from the ends of the bone.","Remove from oven.","Heat broiler.","Cut ribs into serving sized portions of 2 or 3 ribs.","Arrange on broiler pan, bony side up.","Brush on sauce.","Broil for 1 or 2 minutes until sauce is cooked on and bubbly.","Turn ribs over.","Repeat on other side.","Alternately, you can grill the ribs on your grill to cook on the sauce."],"Facts":["READY IN: 3hrs 15mins, SERVES: 6","UNITS: US"]},{"Title":"SIMPLY SOUR CREAM CHICKEN ENCHILADAS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_573,h_323/v1/img/recipes/12/99/26/fqaHKUZ5Qxe1JYEmj5sO_DSC02592.jpg","Description":"Easy to assemble, deliciously creamy and a great choice for once-a-month cooking. And there is NO canned cream soup in my enchiladas -- Hope you give them a try!... More","Ingredients":["1, lb chicken breast, diced","1, medium onion, minced","1, tablespoon vegetable oil","8, (8 inch) flour tortillas, softened","1 1/2, cups grated monterey jack cheese or 1 1/2 cups Mexican blend cheese, divided","1/4, cup butter","1/4, cup flour","1, (15 ounce) can chicken broth","1, cup sour cream","1, (4 ounce) can chopped green chilies or 2 fresh chili peppers, minced"],"Directions":["In a frying pan, cook chicken and onion together in oil over medium-high heat until chicken is just done.","Divide cooked chicken evenly between 8 tortillas; add 1 1/2 tablespoons cheese to each tortilla.","Roll enchiladas and place seam-side down in a 9x13\" baking dish that has been lightly sprayed with no-stick cooking spray.","Melt butter in a medium saucepan; stir in flour to make a roux, stir and cook until bubbly, and gradually whisk in chicken broth then bring to boiling, stirring frequently.","Remove from heat; stir in sour cream and green chilies.","Pour sauce evenly over enchiladas.","Top with remaining 3/4 cup cheese (a baking dish may be double-wrapped and frozen at this point) and bake at 400 degrees  F for 20 minutes until cheese is melted and sauce near edges of baking dish is bubbly."],"Facts":["READY IN: 45mins, SERVES: 8","UNITS: US"]},{"Title":"CROCK-POT CHICKEN WITH BLACK BEANS & CREAM CHEESE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_573,h_322/v1/img/recipes/89/20/4/uxMwt1VGQ5m2ePyzwHWy_salsa-chicken-black-beans-2312.jpg","Description":"I love this Crock-Pot chicken recipe for two reasons: one, my family loves it and two, it is so easy to make! I got this recipe from my sister. She has two children of he... More","Ingredients":["4 -5, boneless chicken breasts, frozen","1, (15 1/2 ounce) can black beans","1, (15 ounce) can corn","1, (15 ounce) jar salsa, any kind","1, (8 ounce) package cream cheese"],"Directions":["Take 4-5 frozen, yes, frozen, boneless chicken breasts put into crock pot.","Add 1 can of black beans, drained, 1 jar of salsa, 1 can of corn drained.","Keep in crock pot on high for about 4-5 hours or until chicken is cooked.","Add 1 package of cream cheese (just throw it on top!) and let sit for about 1/2 hour.","All done and enjoy!"],"Facts":["READY IN: 4hrs 3mins, SERVES: 4","UNITS: US"]},{"Title":"PANERA'S CREAM CHEESE POTATO SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/15/08/63/zbOVaZ4MSAO81CYiVyZK_panera-baked-potato-cream-cheese-soup-3763.jpg","Description":"This is my favorite recipe for potato soup. It's a copycat of the one they use to serve at the St. Louis Bread Company (Panera). The recipe originally called f... More","Ingredients":["4, cups chicken broth","4, cups peeled and cubed potatoes","1/2, teaspoon seasoning salt","1/4, teaspoon white pepper","1/4, teaspoon ground red pepper","1, (8 ounce) package cream cheese, cut into chunks"],"Directions":["Combine broth, potatoes, and spices.","Boil on medium heat until potatoes are tender.","Smash a few of the potatoes to release their starch for thickening.","Reduce to low heat.","Add cream cheese.","Heat, stirring frequently, until cheese melts."],"Facts":["READY IN: 1hr, SERVES: 4-6","UNITS: US"]},{"Title":"DELICIOUS CHICKEN POT PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_589,h_331/v1/img/recipes/10/74/4/AyB790BXQZSOoGfb5I8o_0S9A2765.jpg","Description":"This chicken pot pie recipe takes a little time, but it is WELL WORTH IT!! This is an all-time favorite in our family. Great on a cold winter day.”","Ingredients":["1, cup potato, diced","1, cup onion, diced","1, cup celery, diced","1, cup carrot, diced","1/3, cup melted margarine","1/2, cup all-purpose flour","2, cups chicken broth","1, cup half-and-half","1, teaspoon salt","1/4, teaspoon pepper","4, cups chicken, cooked and chopped","2, pie crusts (either store bought or your own recipe)"],"Directions":["Preheat oven to 400 degrees F.","Saute onion, celery, carrots and potatoes in margarine for 10 minutes.","Add flour to sauteed mixture, stirring well, cook one minute stirring constantly.","Combine broth and half and half.","Gradually stir into vegetable mixture.","Cook over medium heat stirring constantly until thickened and bubbly.","Stir in salt and pepper; add chicken and stir well.","Pour into shallow 2 quart casserole dish and top with pie shells.","Cut slits to allow steam to escape.","Bake for 40-50 minutes or until pastry is golden brown and filling is bubbly and cooked through."],"Facts":["READY IN: 1hr 45mins, SERVES: 6-8","UNITS: US"]},{"Title":"\"WHATEVER FLOATS YOUR BOAT\" BROWNIES!","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_572,h_322/v1/img/mpx/0279065_16x9.jpg","Description":"These are absolutely the chewiest, moistest, fudgiest brownies ever! I have tried adding so many different things to the batter, and they ALWAYS comes out gre... More","Ingredients":["1/2, cup butter, melted","1/2, cup unsweetened cocoa","1, cup sugar","2, eggs","2, teaspoons vanilla","1/2, cup flour","1/4, teaspoon salt","WHATEVER FLOATS YOUR BOAT ADDITIONS","1 -2, cup chocolate chips (semisweet, white, butterscotch, peanut butter)","1 -2, cup raisins","1 -2, cup chopped maraschino cherry","1 -2, cup chopped nuts","1 -2, cup M&M'","1 -2, cup Reese's pieces","1 -2, cup miniature marshmallow"],"Directions":["Preheat oven to 350 degrees F.","Grease an 8 inch square pan or line with foil.","In a medium bowl combine melted butter and cocoa and stir until cocoa is dissolved.","Add sugar and mix well.","Add eggs one at a time and stir until well combined.","Stir in vanilla, flour and salt until you no longer see any flour (do not overmix).","Fold in \"WHATEVER FLOATS YOUR BOAT\"!","Spread in pan and bake for approximately 25 minutes.","DO NOT OVER-BAKE -- your brownies will come out dry. Adjust time/temp accordingly for your oven. If you do the knife/toothpick test, it should come out with moist crumbs, not clean.","Cool completely before cutting into squares.","For vegetarian omit the marshmallows.","For double recipe, bake in 9x12 pan and add 5 minutes to baking time."],"Facts":["READY IN: 35mins, SERVES: 16","UNITS: US"]},{"Title":"SOFT SNICKERDOODLE COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/mpx/5458764_16x9.jpg","Description":"These snickerdoodle cookies are so delicious, and they have the best texture. They are so fast to put together too! I actually got it from an old recipe that ... More","Ingredients":["1, cup butter, softened","1 1/2, cups sugar","2, large eggs","2 3/4, cups flour","2, teaspoons cream of tartar","1, teaspoon baking soda","1/4, teaspoon salt","3, tablespoons sugar","3, teaspoons cinnamon","1, teaspoon vanilla extract"],"Directions":["Preheat oven to 350 degrees F.","Mix softened butter, 1 1/2 cups sugar, 1tps of vanilla extract and eggs thoroughly in a large bowl.","Combine flour, cream of tartar, baking soda and salt in a separate bowl.","Blend dry ingredients into butter mixture.","Chill dough, and chill an ungreased cookie sheet for about 10-15 minutes in the fridge.","Meanwhile, mix 3 tablespoons sugar, and 3 teaspoons cinnamon in a small bowl.","Scoop 1 inch globs of dough into the sugar/ cinnamon mixture.","Coat by gently rolling balls of dough in the sugar mixture.","Place on chilled ungreased cookie sheet, and bake 10 minutes.","Remove from pan immediately."],"Facts":["READY IN: 25mins, SERVES: 24","UNITS: US"]},{"Title":"SOUTHERN BUTTERMILK BISCUITS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_565,h_318/v1/img/recipes/26/11/0/DmfK6TnxRUqzDwn2P4tb_batch23-7025.jpg","Description":"These buttermilk biscuits are authentic. This recipe came from my great-great-grandmother, and was handed down to all the women in my family, and we are all Sout... More","Ingredients":["2, cups unbleached all-purpose flour, plus more for dusting the board (if you can get White Lily flour, your biscuits will be even better)","1/4, teaspoon baking soda","1, tablespoon baking powder (use one without aluminum)","1, teaspoon kosher salt or 1 teaspoon salt","6, tablespoons unsalted butter, very cold","1, cup buttermilk (approx)"],"Directions":["Preheat your oven to 450 degrees F.","Combine the dry ingredients in a bowl, or in the bowl of a food processor.","Cut the butter into chunks and cut into the flour until it resembles course meal.","If using a food processor, just pulse a few times until this consistency is achieved.","Add the buttermilk and mix JUST until combined.","If it appears on the dry side, add a bit more buttermilk. It should be very wet.","Turn the dough out onto a floured board.","Gently, gently PAT (do NOT roll with a rolling pin) the dough out until it's about 1/2\" thick. Fold the dough about 5 times, gently press the dough down to a 1 inch thick.","Use a round cutter to cut into rounds.","You can gently knead the scraps together and make a few more, but they will not be anywhere near as good as the first ones.","Place the biscuits on a cookie sheet- if you like soft sides, put them touching each other.","If you like\"crusty\" sides, put them about 1 inch apart- these will not rise as high as the biscuits put close together.","Bake for about 10-12 minutes- the biscuits will be a beautiful light golden brown on top and bottom.","Do not overbake.","Note: The key to real biscuits is not in the ingredients, but in the handling of the dough.","The dough must be handled as little as possible or you will have tough biscuits.","I have found that a food processor produces superior biscuits, because the ingredients stay colder and there's less chance of overmixing.","You also must pat the dough out with your hands, lightly.","Rolling with a rolling pin is a guaranteed way to overstimulate the gluten, resulting in a tougher biscuit.","Note 2: You can make these biscuits, cut them, put them on cookie sheets and freeze them for up to a month.","When you want fresh biscuits, simply place them frozen on the cookie sheet and bake at 450 degrees F for about 20 minutes."],"Facts":["READY IN: 22mins","YIELD: 10 biscuits, UNITS: US"]},{"Title":"FANNIE FARMER'S CLASSIC BAKED MACARONI & CHEESE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/13/53/50/kMWg48mzQPqqHG00V5xT_1maccheese3.jpg","Description":"To me Fannie Farmer's recipe is the only \"real\" Macaroni & Cheese. It's from my 1946 edition of \"Fannie Farmer's Boston Cooking School Cookbook&q... More","Ingredients":["1, (8 ounce) package macaroni","4, tablespoons butter","4, tablespoons flour","1, cup milk","1, cup cream","1/2, teaspoon salt","fresh ground black pepper, to taste","2, cups cheddar cheese, shredded good quality","1/2, cup breadcrumbs, buttered"],"Directions":["Preheat oven to 400 degrees F.","Cook and drain macaroni according to package directions; set aside.","In a large saucepan melt butter.","Add flour mixed with salt and pepper, using a whisk to stir until well blended.","Pour milk and cream in gradually; stirring constantly.","Bring to boiling point and boil 2 minutes (stirring constantly).","Reduce heat and cook (stirring constantly) 10 minutes.","Add shredded cheddar little by little and simmer an additional 5 minutes, or until cheese melts.","Turn off flame.","Add macaroni to the saucepan and toss to coat with the cheese sauce.","Transfer macaroni to a buttered baking dish.","Sprinkle with breadcrumbs.","Bake 20 minutes until the top is golden brown.","(You can also freeze this recipe in zip-lock bags for later use - once you have mixed the macaroni along with the cheese sauce allow to cool to room temperature before adding to your freezer - I generally pull it out the night before and allow macaroni and cheese to reach room temperature; I then add the macaroni and cheese to a buttered baking dish, sprinkle with bread crumbs and then bake for 20 to 30 minutes, until golden brown on top and bubbling."],"Facts":["READY IN: 40mins, SERVES: 4","UNITS: US"]},{"Title":"CROCK POT CREAM CHEESE CHICKEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/12/45/8/VVn84YRTQmeNB0cBrcr4_0S9A3316.jpg","Description":"I got this recipe from a nurse at work. We're always sharing easy and family-pleasing recipes. The sauce tastes like a creamy Alfredo sauce. This is great with n... More","Ingredients":["3, lbs chicken pieces","1, (2/3 ounce) package Italian salad dressing mix","4, tablespoons melted butter (divided)","1, small onion, chopped","1, garlic clove, chopped","1, (10 1/2 ounce) can cream of chicken soup","8, ounces cream cheese","1/2, cup chicken broth"],"Directions":["Place chicken pieces in crock pot and sprinkle Italian seasoning over chicken. Sprinkle with 2 tablespoons melted butter.","Cook on low for 4-6 hours.","Melt 2 tablespoons butter in a sauce pan and saute onion and garlic. Add Cream of Chicken Soup, cream cheese, and chicken broth. Stir until smooth.","Add this mixture to crock pot and cook on low for an additional hour."],"Facts":["READY IN: 7hrs 20mins, SERVES: 6","UNITS: US"]},{"Title":null,"Image":null,"Description":null,"Ingredients":null,"Directions":null,"Facts":null},{"Title":"CREAMY BURRITO CASSEROLE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_582,h_328/v1/img/mpx/0279068_16x9.jpg","Description":"Satisfy your craving for something different tonight. It's good and fairly easy. This is stuff I usually have on hand too.”","Ingredients":["1, lb ground beef or 1 lb ground turkey","1/2, medium yellow onion, chopped","1, (1 1/4 ounce) package taco seasoning","6, large flour tortillas","1, (16 ounce) can refried beans","2 -3, cups shredded taco cheese or 2 -3 cups cheddar cheese","1, (10 3/4 ounce) can cream of mushroom soup","4, ounces sour cream","jarred hot sauce, if desired to spice it up"],"Directions":["Brown ground meat/turkey & onion; drain.","Add taco seasoning and stir in refried beans.","Mix soup and sour cream in a separate bowl.","Spread 1/2 sour cream mixture in the bottom of a casserole dish.","Tear up 3 tortillas and spread over sour cream mixture.","Put 1/2 the meat bean mixture over that.","Add a layer of cheese.","You could put some hot sauce on this now.","Repeat the layers.","Sprinkle cheese over the top and bake, uncovered, at 350 degrees F for 20-30 minutes."],"Facts":["READY IN: 50mins, SERVES: 8-10","UNITS: US"]},{"Title":"SOUR CREAM BANANA BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_644,h_362/v1/img/recipes/93/51/uAo0F9diTyqexMQJctEk_batch23-6608.jpg","Description":"”","Ingredients":["1/2, cup margarine or 1/2 cup butter","1, cup sugar","2, eggs","1, teaspoon vanilla","1 1/2, cups flour","1, teaspoon baking soda","1/2, teaspoon salt","1, cup mashed banana","1/2, cup chopped nuts (omit if you don't like nuts)","1/2, cup sour cream"],"Directions":["Grease 1 large loaf pan.","Cream margarine, sugar, eggs and vanilla.","Add dry ingredients, then bananas, nuts and sour cream.","Mix well.","Bake at 350 F for 1 hour."],"Facts":["READY IN: 1hr 15mins, SERVES: 12","YIELD: 1 loaf, UNITS: US"]},{"Title":"CROCK POT WHOLE CHICKEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/33/67/1/PpaBfRQmQDG7MToNnJu1_crockpot-whole-chicken-2256.jpg","Description":"Tender, fall-off-the-bone chicken! Skip the overnight refrigeration if you are in a hurry. For variety, eliminate the onion and substitute a quartered lemon or t... More","Ingredients":["4, teaspoons salt (per recipe reviews, 2 tsp is better)","2, teaspoons paprika","1, teaspoon cayenne pepper","1, teaspoon onion powder","1, teaspoon thyme","1, teaspoon white pepper","1/2, teaspoon garlic powder","1/2, teaspoon black pepper","1, large roasting chicken (with pop-up timer if possible)","1, cup chopped onion (optional)"],"Directions":["In a small bowl, combine the spices.","Remove any giblets from chicken and clean chicken.","Rub spice mixture onto the chicken.","Place in resealable plastic bag and refrigerate overnight. (I usually skip this step because I'm always in a hurry).","When ready to cook, put chopped onion in bottom of crock pot.","Add chicken. No liquid is needed, the chicken will make its own juices.","Cook on low 4-8 hours.","Note: I highly recommend a pop-up timer in the chicken because some crock pots cook faster/slower than others (my crock pot cooks this recipe in 4-5 hours)."],"Facts":["READY IN: 23hrs, SERVES: 4","UNITS: US"]},{"Title":"PANERA BROCCOLI CHEESE SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/mpx/5458759_16x9.jpg","Description":"A very good broccoli cheese soup. Served with crusty bread.”","Ingredients":["1, tablespoon melted butter","1/2, medium chopped onion","1/4, cup melted butter","1/4, cup flour","2, cups half-and-half cream","2, cups chicken stock","1/2, lb fresh broccoli (chopped into bite size pieces)","1, cup carrot, julienned, grated","1/4, teaspoon nutmeg","8, ounces grated sharp cheddar cheese","salt and pepper","crusty bread or bread bowl","2, cups whole milk"],"Directions":["Sauté onion in butter. Set aside.","Cook melted butter and flour using a whisk over medium heat for 3-5 minutes or until you see a noticeable golden brown color in your pan.","Slowly add in the chicken stock and whisk again to combine. Simmer contents covered (stirring occasionally) for 20 minutes on medium heat.","Add the broccoli, carrots and the sauteed onions, into the pot. Stir, add the milk and half & half. Cook covered over low heat 20-25 minutes but do not bring to a boil. This may cause the milk to curdle.","Add salt, pepper & nutmeg. Note: you can purée half of your soup in a blender or with a handheld immersion blender if you choose however it isn't a requirement. Continue to cook the soup on low heat and slowly add the grated cheese a handful at a time and stir to avoid clumps. Once all the cheese has been added is melted, remove from heat, and serve immediately. Suggestion: serve with crusty bread or in a breadbowl.","Refrigerate leftovers after they have cooled and store in a airtight container up to 5 days in the refrigerator."],"Facts":["READY IN: 1hr 10mins, SERVES: 4","UNITS: US"]},{"Title":"THE MOST WONDERFUL GINGERBREAD COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_580,h_326/v1/img/mpx/0278333_16x9.jpg","Description":"This is my very favorite gingerbread cookie recipe. The dough is so firm and nice to work with and is so wonderful smelling that it is almost like a stress relie... More","Ingredients":["3, cups all-purpose flour","1 1/2, teaspoons baking powder","3/4, teaspoon baking soda","1/4, teaspoon salt","1, tablespoon ground ginger","1 3/4, teaspoons ground cinnamon","1/4, teaspoon ground cloves","6, tablespoons unsalted butter","3/4, cup dark brown sugar","1, large egg","1/2, cup molasses","2, teaspoons vanilla","1, teaspoon finely grated lemon zest (optional)"],"Directions":["In a small bowl, whisk together flour, baking powder, baking soda, salt, ginger, cinnamon, and cloves until well blended.","In a large bowl (KitchenAid's great for this) beat butter, brown sugar, and egg on medium speed until well blended.","Add molasses, vanilla, and lemon zest and continue to mix until well blended.","Gradually stir in dry ingredients until blended and smooth.","Divide dough in half and wrap each half in plastic and let stand at room temperature for at least 2 hours or up to 8 hours.","Preheat oven to 375 deg. Prepare baking sheets by lining with parchment paper.","(Dough can be stored in the refrigerator for up to 4 days, but in this case it should be refrigerated. Return to room temp before using.) Preheat oven to 375 degrees .","Grease or line cookie sheets with parchment paper.","Place 1 portion of the dough on a lightly floured surface.","Sprinkle flour over dough and rolling pin.","Roll dough to a scant 1/4-inch thick.","Use additional flour to avoid sticking.","Cut out cookies with desired cutter-- the ginger bread man is our favorite of course.","Space cookies 1 1/2-inches apart.","Bake 1 sheet at a time for 7-10 minutes (the lower time will give you softer cookies-- very good!).","Remove cookie sheet from oven and allow the cookies to stand until the cookies are firm enough to move to a wire rack.","After cookies are cool you may decorate them any way you like.","I usually brush them with a powdered sugar glaze when I am in a hurry, but they look wonderful decorated with Royal icing."],"Facts":["READY IN: 2hrs 23mins","YIELD: 24 5inch tall cookies, UNITS: US"]},{"Title":"BANANA BANANA BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_596,h_335/v1/img/recipes/25/88/5/CRAukFk1Tf2xpDPtcOUB_0S9A1642.jpg","Description":"Why compromise the banana flavor? My banana bread is moist and delicious with loads of banana flavor! Ultimate comfort food, and it's WONDERFUL TOASTED!! (Make sure... More","Ingredients":["2, cups all-purpose flour","1, teaspoon baking soda","1/4, teaspoon salt","1/2, cup butter","3/4, cup brown sugar","2, large eggs, beaten","2 1/3, cups mashed very overripe bananas"],"Directions":["Preheat oven to 350 degrees .","Lightly grease 9 x 5 loaf pan.","In large bowl, combine flour, soda and salt.","In separate bowl, cream together butter and brown sugar.","Stir in eggs and mashed bananas until well blended.","Stir banana mixture into flour mixture; stir just to moisten.","Pour batter into prepared loaf pan.","Bake in preheated oven for 60-65 minutes until a toothpick inserted into center of loaf comes out clean.","Let bread cool in pan for 10 minutes, then turn out onto a wire rack."],"Facts":["READY IN: 1hr 15mins, SERVES: 12","YIELD: 1 9x5 loaf, UNITS: US"]},{"Title":"BETTER THAN OLIVE GARDEN ALFREDO SAUCE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/mpx/5458747_16x9.jpg","Description":"This is the best Alfredo sauce ever. This is several recipes combined into one. You can also add your choice of meat (chicken, shrimp or even crab). The clos... More","Ingredients":["3, tablespoons sweet butter","2, tablespoons olive oil","2, garlic cloves, minced","2, cups heavy cream","1/4, teaspoon white pepper","1/2, cup grated parmesan cheese, plus more for garnish","3/4, cup grated mozzarella cheese","1, (12 ounce) box angel hair pasta (or fettuccini)","2, tablespoons chopped parsley, for garnish (optional)","freshly cracked black pepper, for garnish (optional)"],"Directions":["Melt butter in medium saucepan with olive oil over medium/low heat.","Add the garlic, cream, white pepper and bring mixture to a simmer.","Stir often.","Add the Parmesan cheese and simmer sauce for 8-10 minutes or until sauce has thickened and is smooth.","When sauce has thickened add the Mozzarella cheese and stir until smooth. STIR FREQUENTLY.","While the sauce cooks, boil noodles for 3-5 minutes.","Place pasta on serving plates and spoon sauce over pasta.","Garnish with parsley, freshly cracked black pepper and more grated parmesan (optional)."],"Facts":["READY IN: 25mins, SERVES: 4-6","UNITS: US"]},{"Title":"AWARD WINNING CHILI","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/mpx/5458741_16x9.jpg","Description":"My husband and I created this recipe together. He won a chili cook-off with this recipe at work. We always use venison, but you can use ground beef or turkey.”","Ingredients":["1, 1 lb ground beef or 1 lb ground turkey","2, onions, diced","1, green pepper, diced","1, tablespoon jalapeno, finely chopped","1, (14 ounce) can Mexican-style tomatoes (like Rotel)","2, (8 ounce) cans tomato sauce","2, tablespoons cumin","2, tablespoons chili powder","1, teaspoon salt","1/2, teaspoon cayenne pepper","1/2, teaspoon paprika (smoked if you can find it)","1, (14 ounce) can kidney beans, drained and rinsed","1, (14 ounce) can black beans, drained and rinsed","1, cup water","TOPPINGS","sour cream","cheddar cheese","green onion"],"Directions":["In a medium Dutch oven over medium-high heat add the olive oil. Add the ground meat and cook, breaking up into pieces, until browned. Add the onions, bell pepper and jalapeno and cook until softened. Drain excess grease.","Add the tomatoes, tomato sauce, cumin, chili powder, salt, cayenne, paprika and 1 cup water. Mix to combine.","Add the kidney beans and black beans, mix and bring to a simmer. Cover and cook for 1-2 hours.","Serve with desired toppings."],"Facts":["READY IN: 2hrs 15mins, SERVES: 6","UNITS: US"]},{"Title":"JAPANESE MUM'S CHICKEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/mpx/0279063_16x9.jpg","Description":"We have a Japanese girl, Tomoko, living with us, and tonight she and I cooked a Japanese dinner for us and her friends. She phoned her mum,Toshiko, in Japan for ... More","Ingredients":["8, chicken drumsticks, skin on (the skin is important for flavour, and is so tasty to eat!)","1, cup water","1/2, cup balsamic vinegar","1/3, cup soy sauce","2 1/2, tablespoons sugar","1, garlic clove, peeled and bruised","1, small hot chili pepper, slit open, seeds removed"],"Directions":["Place all the ingredients in a saucepan over a high heat.","Bring to the boil, then reduce to a simmer for about 20 minutes.","Remove any scum that rises to the surface.","Increase the heat, turning the drumsticks frequently in the liquid, and cook until the liquid has reduced to a sticky glaze.","Arrange the chicken on a serving platter, remove the garlic clove and chili from the liquid, and spoon the glaze over.","NOTE It's a glaze rather than a sauce, so there's not a whole lot of it."],"Facts":["READY IN: 45mins, SERVES: 4","UNITS: US"]},{"Title":"PULLED PORK (CROCK POT)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/13/10/18/ZQJQBHP0QTSKpUuWOcZh-017-pulled-pork.jpg","Description":"I found this pulled pork recipe years ago, and it's a favorite at potlucks. Freezes well for easy quick meals.”","Ingredients":["4, lbs pork roast (shoulder or butt)","2, large onions","1, cup ginger ale","1, (18 ounce) bottle favorite barbecue sauce (I like Sweet Baby Ray's)","barbecue sauce, for serving (optional)"],"Directions":["Slice one onion and place in crock pot.","Put in the roast and cover with the other onion, sliced. Pour over the ginger ale. Cover and cook on LOW for about 12 hours. See Note2 below regarding amount of time needed!","Remove the meat, strain and save the onions, discard all liquid. With two forks, shred the meat, discarding any remaining fat, bones or skin. Most of the fat will have melted away.","Return the shredded meat and the onions to the crock pot, stir in the barbecue sauce. Continue to cook for another 4 to 6 hours on LOW.","Serve with hamburger buns or rolls and additional barbecue sauce. Any leftovers freeze very well.","TIP: freeze ready-made sandwiches - a scoop of meat on a bun, well-wrapped. These make a great quick meal or snack. To reheat, remove wrapping, wrap in a paper towel, and zap 1-2 minute in the microwave.","Note: Shoulder or butt are recommended because the meat shreds very well. Other cuts do not shred as readily. It is a fattier cut, but the fat melts away in the cooking and is poured away when you discard the liquid.","Note 2: I have an older, smaller crock pot. The above times work perfectly for me. But if you have a newer or bigger crock pot, you may need to revise times downward, esp. after the bbq sauce is added. I think you need at least a couple of hours for it all to meld, but that may be all you need. Update: I recently bought a bigger crockpot, I think 5 or 6 qts. I cooked a 6 lb pork shoulder in it for 8 hours and it was shreddable at that point. Shredded, added the sauce, and cooked for another hour or so to meld everything. So use your best judgment on timing!","Note3: You might want to turn your roast over after it's cooked a while, to ensure more even cooking. I think this may depend on the size and shape of your roast and the size of your slow cooker. Remember that each time you remove the lid you lose heat and be careful, as turning a large piece of meat is awkward.","Note4: my sister says this takes 2 hours in the Instapot. I don't have one, up to you to figure out the steps."],"Facts":["READY IN: 18hrs 30mins, SERVES: 10","UNITS: US"]},{"Title":"OVEN-FRIED CHICKEN CHIMICHANGAS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/28/14/8/Ew9disSrTws0LLBWlpbQ_0S9A2424.jpg","Description":"A fast and healthier way to serve Chimichangas than the traditional deep fried. These are very good, and you may dress them up to you own preference. I like to serv... More","Ingredients":["2/3, cup picante sauce or 2/3 cup your favorite salsa","1, teaspoon ground cumin","1/2, teaspoon dried oregano leaves, crushed","1 1/2, cups cooked chicken, chopped","1, cup shredded cheddar cheese","2, green onions, chopped with some tops (about 1/4 cup)","6, (8 inch) flour tortillas","2, tablespoons margarine, melted","shredded cheddar cheese, for serving","chopped green onion, for serving","picante sauce, for serving"],"Directions":["Mix chicken, picante sauce or salsa, cumin, oregano, cheese and onions.","Place about 1/4 cup of the chicken mixture in the center of each tortilla.","Fold opposite sides over filling.","Roll up from bottom and place seam-side down on a baking sheet.","Brush with melted margarine.","Bake at 400 degrees F for 25 minutes or until golden.","Garnish with additional cheese and green onion and serve salsa on the side."],"Facts":["READY IN: 45mins","YIELD: 6 Chimichangas, UNITS: US"]},{"Title":"KITTENCAL'S MOIST CHEDDAR-GARLIC OVEN FRIED CHICKEN BREAST","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/recipes/82/10/2/C3VxQIrFT1aDvMUykuA0_0S9A5607.jpg","Description":"This is for serious garlic lovers. The chicken bakes out so moist and tender! Grated cheese may be sprinkled on top of the breast the last 5 minutes of cooking if desired bu... More","Ingredients":["1/3, cup butter, melted","2, tablespoons minced garlic (can use more or less)","2, teaspoons garlic powder, divided (garlic lovers can use more)","1/2, teaspoon seasoning salt (or can use white salt)","3/4, cup seasoned dry bread crumb (seasoned or plain)","1/2, cup finely grated cheddar cheese","1/4, cup freshly grated parmesan cheese","1/2, teaspoon ground black pepper (or to taste)","4, boneless skinless chicken breasts","shredded cheddar cheese (optional and use any amount desired, or can use shredded mozzarella cheese)"],"Directions":["Preheat oven to 350 degrees F.","Butter an 11 x 7-inch pan (if using more than 4 breasts use a larger pan).","In a bowl, combine melted butter with fresh minced garlic, 1 teaspoon garlic powder and salt.","In another bowl, combine the dry breadcrumbs with 1/2 cup finely grated cheddar cheese, Parmesan cheese 1 teaspoon garlic powder and coarse ground black pepper.","Dip chicken in butter mixture; then in crumb mixture.","Place in prepared pan and bake uncovered for 35-45 minutes or until cooked through, larger breasts may take more time (placing the chicken on a rack in a pan will produce an extra crispy crust).","Top with shredded cheddar or mozzarella the last 5 minutes of cooking (this is only optional."],"Facts":["READY IN: 1hr, SERVES: 4","UNITS: US"]},{"Title":null,"Image":null,"Description":null,"Ingredients":null,"Directions":null,"Facts":null},{"Title":"CROCK POT TACO SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/40/02/2/8yMXvO0CRSGVp9I0BZMh-Taco-Soup-2.jpg","Description":"This taco soup is quick and easy to prepare and has great flavor. I got it from a family friend.”","Ingredients":["1, (16 ounce) can pinto beans","1, (16 ounce) can white beans or (16 ounce) can kidney beans","1, (11 ounce) can niblet corn","1, (11 ounce) can Rotel tomatoes & chilies","1, (28 ounce) can diced tomatoes","1, (4 ounce) can diced green chilies","1, (1 1/4 ounce) envelope taco seasoning mix","1, (1 ounce) envelope Hidden Valley&reg; Original Ranch&reg; Dressing and Seasoning Mix","1, lb shredded chicken, ground beef or 1 lb any meat"],"Directions":["Cook meat and drain.","Shred if needed.","Add all ingredients to crock pot.","DO NOT DRAIN CANS.","Stir.","Cook on high for 2 hours or low for 4 hours.","Keep on low until serving to keep hot.","Garnish with sour cream, shredded cheese, chopped green onions, or tortilla chips."],"Facts":["READY IN: 2hrs 10mins, SERVES: 8-10","UNITS: US"]},{"Title":"ABSOLUTE BEST EVER LASAGNA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_600,h_338/v1/img/recipes/28/76/8/SyAcnUdwTHGQfekagLBj_ABEL 3 - final_1.png","Description":"My family's favorite. This is a very meaty lasagna. We prefer it with cottage cheese, but you can easily substitute ricotta.”","Ingredients":["1 1/2, lbs lean ground beef","1/2, lb Italian sausage or 1/2 lb ground veal","1, large onion, chopped","2 -3, garlic cloves, minced","1, teaspoon salt","1, teaspoon fresh coarse ground black pepper","1, tablespoon dried parsley flakes","1, tablespoon dried oregano","1, tablespoon dried basil","2, (14 1/2 ounce) cans whole tomatoes, undrained and chopped (or canned chopped tomatoes)","12, ounces tomato paste","24, ounces ricotta cheese","2, eggs, beaten","1/2, teaspoon pepper","2, tablespoons parsley","1/2, cup grated parmesan cheese","1, lb mozzarella cheese, divided","12 -15, lasagna noodles"],"Directions":["Brown ground meat, onion and garlic.","Add salt, pepper, parsley, oregano, basil, chopped tomatoes with juice, tomato paste; stirring until well mixed.","Cover and simmer 1 hour (or longer,but watch for getting too dry).","Cook lasagna noodles according to package directions; drain and set aside.","Spray a 13 x 9\" baking pan with cooking spray.","Combine riccota cheese, eggs, pepper, 2 tablespoons parsley, Parmesan cheese and 1/2 1lb of mozzarella cheese; In a lasagna pan, layer noodles, meat sauce, and cheese mixture; repeat.","Top off with layer of noodles; sprinkle evenly with remaining mozzarella cheese; make sure to cover noodles completely.","Bake at 375F for 40-60 minutes, or until cheese mixture is thoroughly melted. (I cover w/ foil for about 40 minutes, then uncover for 15-20 minutes.","Let sit for 15-20 minutes before cutting and serving."],"Facts":["READY IN: 2hrs 30mins, SERVES: 12","UNITS: US"]},{"Title":"CHINESE FRIED RICE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_599,h_337/v1/img/mpx/5458756_16x9.jpg","Description":"No description","Ingredients":["3/4, cup finely chopped onion","2 1/2, tablespoons oil","1, egg, lightly beaten (or more eggs if you like)","3, drops soy sauce","","","","","","","",""],"Directions":["Heat 1 tbsp oil in wok; add chopped onions and stir-fry until onions turn a nice brown color, about 8-10 minutes; remove from wok.","Allow wok to cool slightly.","Mix egg with 3 drops of soy and 3 drops of sesame oil; set aside.","Add 1/2 tbsp oil to wok, swirling to coat surfaces; add egg mixture; working quickly, swirl egg until egg sets against wok; when egg puffs, flip egg and cook other side briefly; remove from wok, and chop into small pieces.","","","",""],"Facts":["READY IN: 28mins, SERVES: 4","UNITS: US"]},{"Title":"CHICKEN PARMESAN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/mpx/5458752_16x9.jpg","Description":"This is one of our \"I want something different tonight\" favorites. So VERY good!”","Ingredients":["4, boneless skinless chicken breast halves","salt and pepper","1/2, cup Italian breadcrumbs","1, egg, beaten","4, tablespoons butter","2, cups spaghetti sauce","4, slices mozzarella cheese","parmesan cheese, grated","spaghetti, for serving (optional)","2, tablespoons chopped parsley, for garnish (optional)"],"Directions":["Pound chicken to flatten.","Salt and pepper to taste.","Dip chicken in egg; then in bread crumbs.","Fry in butter in hot skillet, turning and browning for 10 minutes or until chicken is done.","Remove from skillet.","To skillet add spaghetti sauce.","Heat thoroughly.","Add chicken.","Place slices of mozzarella on top of chicken.","Sprinkle with parmesan.","Cover and cook until cheese is melted.","Serve with a side of spaghetti. Optional, garnish with chopped parsley and more parmesan cheese."],"Facts":["READY IN: 23mins, SERVES: 4","UNITS: US"]},{"Title":"BEV'S SPAGHETTI SAUCE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/26/21/7/ZF3VGfKMT8Wyf0Cve4bD_untitled-0860.jpg","Description":"This is a recipe I have developed over a number of years. This is the only spaghetti sauce my family will request! Very easy to make. I hope your family enjoys i... More","Ingredients":["1 1/2, lbs ground beef","2, tablespoons olive oil","1, medium onion, chopped","2, cloves garlic, minced (to taste)","2, bay leaves","1, teaspoon oregano","1, teaspoon dried basil","1, teaspoon italian seasoning","1, teaspoon salt (, or to taste)","ground pepper","1, (6 ounce) can tomato paste","2, (16 ounce) cans tomato sauce","1, (28 ounce) can diced tomatoes","8, ounces fresh mushrooms, sliced and sauteed in butter (optional)","parmesan cheese, freshly grated (optional)"],"Directions":["Brown the ground beef, onion and garlic in olive oil with bay leaves, oregano, basil, Italian Seasoning, salt and pepper.","Add tomato paste, tomato sauce and diced tomatoes.","Stir well and bring to a simmer over medium heat.","Cover and simmer for 1 1/2 hours.","Use sauce to top your cooked spaghetti.","Top with sauteed mushroom.","Pass the Parmesan."],"Facts":["READY IN: 1hr 45mins, SERVES: 4-6","UNITS: US"]},{"Title":"SHOULD BE ILLEGAL OVEN BBQ RIBS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_584,h_329/v1/img/recipes/87/01/HRWmllIgRqWaKn0kaGKo_IMG_3154 illegal bbq ribs.jpg","Description":"After not being able to find restaurant ribs that satified my hot sweet appetite, I carefully attempted various combinations of flavors until I found one that I and my... More","Ingredients":["3, lbs pork back ribs","1, (8 ounce) jar honey","1, teaspoon paprika","1, teaspoon chili powder","1/2, teaspoon garlic powder","2, tablespoons Old Bay Seasoning","1/2, teaspoon onion powder","1/4, teaspoon celery salt","1/2, cup dark brown sugar","1/4, teaspoon fresh ground pepper","1, medium onion, grated or finely chopped","12, ounces barbecue sauce","1/4, cup white sugar"],"Directions":["Place all ingredients together in large roasting pan (i use bottom of turkey roaster).","Cut ribs apart for easier serving.","Mix together making sure to coat all ribs with this semi-dry paste.","Spread ribs out evenly on bottom of pan.","cover lightly with foil.","Bake at 375 degrees for approximately 1 hour.","Turning or stirring occasionally.","You can use broiler for these ribs, just watch more closely, and adjust cooking time.","These ribs are also great finished on the grill for a few minutes on each side."],"Facts":["READY IN: 1hr 10mins, SERVES: 4-6","YIELD: 3 lbs Ribs, UNITS: US"]},{"Title":"DUTCH APPLE PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/43/99/0/HU5zyewQxK5MaSSkLyMt_0S9A5753.jpg","Description":"One of the best dutch apple pies you'll eat!”","Ingredients":["1, your favorite homemade pie crusts or 1 ready-made pie crust","5 1/2, cups peeled cored sliced cooking apples","1, tablespoon lemon juice","1/2, cup granulated sugar","1/4, cup brown sugar, packed","3, tablespoons flour","1/2, teaspoon ground cinnamon","1/4, teaspoon nutmeg","TOPPING","3/4, cup flour","1/4, cup granulated sugar","1/4, cup brown sugar, packed","1/3, cup butter or 1/3 cup margarine, room temperature"],"Directions":["Preheat oven to 375 degrees F.","Fit pie crust into pie plate.","In a large bowl, mix sliced apples, lemon juice, both sugars,flour, cinnamon and nutmeg.","Pile into crust.","Prepare topping:","In a medium bowl, with a pastry blender or a fork, mix flour, both sugars, and butter until coarsely crumbled.","Sprinkle evenly over apples.","Bake at 375 degrees F for 50 minutes."],"Facts":["READY IN: 1hr, SERVES: 8","YIELD: 1 Pie, UNITS: US"]},{"Title":null,"Image":null,"Description":null,"Ingredients":null,"Directions":null,"Facts":null},{"Title":"SPINACH ARTICHOKE DIP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/12/09/Q1us4KDT27bPD0yngmgv_0S9A2706.jpg","Description":"Here is a delicious spinach artichoke dip!”","Ingredients":["2, cups parmesan cheese","1, (10 ounce) box frozen chopped spinach, thawed and drained of excess liquid","1, (14 ounce) can artichoke hearts, drained and chopped","2/3, cup sour cream","1, cup cream cheese","1/3, cup mayonnaise","2, teaspoons garlic, minced"],"Directions":["Preheat oven to 375 degrees F.","Mix together Parmesan cheese, spinach, and artichoke hearts.","Combine remaining ingredients and mix with spinach mixture.","Bake for 20-30 minutes.","Serve with crackers or toasted bread."],"Facts":["READY IN: 30mins, SERVES: 15","YIELD: 4 1/2 cups, UNITS: US"]},{"Title":"AUTHENTIC ITALIAN MEATBALLS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_599,h_337/v1/img/recipes/92/09/5/WeEQibHTSfSIv0EFIi52_authentic italian meatballs_final 2.jpg","Description":"Meatball recipes are often challenged by chefs who claim, \"Mine are the best!\" Even though my meatballs ARE the best, I will make no such claim. Try them for yourself... More","Ingredients":["1, lb ground beef","2, eggs","1/4, cup milk","1/2, cup breadcrumbs","1/2, teaspoon salt","1, tablespoon fresh parsley","1, teaspoon garlic powder","1/2, teaspoon fresh ground pepper","1/2, cup grated locatelli cheese"],"Directions":["Mix all ingredients in a large bowl by hand.","Use your bare hands for best results.","Roll meatballs to about the size of a golf ball. (wet your hands to prevent the meat from sticking to them while rolling the meat balls).","Drop raw meatballs into large (I use a stock pot) pot of sauce.","(I have an incredible sauce recipe {#92096} I use for my meatballs).","Simmer for about 3 hours."],"Facts":["READY IN: 3hrs 20mins, SERVES: 10","UNITS: US"]},{"Title":null,"Image":null,"Description":null,"Ingredients":null,"Directions":null,"Facts":null},{"Title":"FUDGE CRINKLES (A GREAT 4 INGREDIENT CAKE MIX COOKIE)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/mpx/0279011_16x9.jpg","Description":"These are chewy, fudgy, SUPER EASY cookies that you can probably make right now! I have watched these disappear time and again and everyone is always askin... More","Ingredients":["1, (18 1/4 ounce) box devil's food cake mix (Betty Crocker Super Moist suggested)","1/2, cup vegetable oil","2, large eggs","confectioners' sugar or granulated sugar, for rolling"],"Directions":["Preheat oven to 350Â degrees .","Stir (by hand) dry cake mix, oil and eggs in a large bowl until dough forms.","Dust hands with confectioners' sugar and shape dough into 1\" balls.","Roll balls in confectioners' sugar and place 2 inches apart on ungreased cookie sheets.","Bake for 8-10 minutes or until center is JUST SET.","Remove from pans after a minute or so and cool on wire racks.","*My Notes*:","I have tried these with several different cake mix brands. They all come out good, but the Betty Crocker does come out the best.","I was having a problem with my cookies flattening while baking. This usually happens with the generic cake mix brands. You can play with your oven temp and try them on 375 to keep them from spreading. Adding more oil than called for will also cause the cookies to spread -- I wouldn't suggest it, they really don't need extra oil.","Another way to keep them nice and thick and to get the most \"crinkled\" or \"crackled\" look is to make them bigger. When I roll them at about 1.5 inches they look prettier.","And my best tip: My confectioners' sugar was consistently being absorbed by the dough. The last time I baked them, I rolled them into balls without rolling in the sugar and let them \"dry\" for a few minutes. Then I rolled them in sugar and baked. These came out with a nice coating of sugar that didn't disappear."],"Facts":["READY IN: 15mins","YIELD: 30-48 cookies, UNITS: US"]},{"Title":"WW 0 POINT WEIGHT WATCHERS CABBAGE SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/12/89/56/tunMZv24R9W8wsDTVD68_cabbage soup (1 of 4).jpg","Description":"You can eat as much of this 0-point Weight Watchers cabbage soup as you like. It's so good for you.”","Ingredients":["3, 3 cups nonfat vegetable broth (beef is the best) or 3 cups nonfat chicken broth (beef is the best)","2, garlic cloves, minced","1, tablespoon tomato paste","2, cups chopped cabbage","1/2, yellow onion","1/2, cup chopped carrot","1/2, cup green beans","1/2, cup chopped zucchini","1/2, teaspoon basil","1/2, teaspoon oregano","salt & pepper"],"Directions":["Spray pot with non stick cooking spray saute onions carrots and garlic for 5 minutes.","Add broth, Tomato paste, cabbage, green beans, basil, oregano and Salt & Pepper to taste.","Simmer for a about 5-10 minutes until all vegetables are tender then add the zucchini and simmer for another 5 or so minutes.","I have tried different variations. Leaving out green beans. Adding chopped green onions in addition to the yellow onion.","All very good. You can customize it a bit."],"Facts":["READY IN: 32mins, SERVES: 6-8","YIELD: 1 cup, UNITS: US"]},{"Title":"CHICKEN TORTILLA SOUP II","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_584,h_329/v1/img/recipes/46/27/UrThalDbThGzvrI0b590_CTS 4 - final_2.jpg","Description":"I'm getting tired of seeing the so-called tortilla soup recipes running around that are nothing but a glorified chicken soup with tortillas added. Here's the real McCoy. ... More","Ingredients":["8, ounces carrots, diced","8, ounces celery","8, ounces onions, diced","1/2, teaspoon garlic powder or 1 garlic clove, diced","1/8, teaspoon salt","1/4, teaspoon pepper","1, tablespoon corn oil","4, (15 ounce) cans chicken broth","1, (15 ounce) can tomatoes, diced (optional)","1, (10 ounce) can Rotel tomatoes & chilies, diced","1, (1 1/4-1 1/2 ounce) packet taco seasoning (I use McCormicks)","10, (8 inch) corn, tortillas (NOT FLOUR, cut into small pieces, about 1-in x1-in)","12, ounces chicken meat, poached, diced","1, cup milk or 1 cup sour cream","12, ounces monterey jack cheese or 12 ounces Mexican blend cheese, shredded","corn tortilla chips, broken into small pieces for garnish"],"Directions":["Saute carrots, onions, celery in corn oil, garlic, salt and pepper until tender.","Add chicken broth and bring to boil.","Add tomatoes, Rotel, taco seasoning, and chicken.","Cut Tortillas into small pieces and add to broth mixture.","Let boil for 45 minutes or until tortillas are thoroughly incorporated into soup stirring occasionally to keep from sticking.","Reduce heat and add 8 oz. cheese. Simmer for additional 10 minutes.","Add milk and simmer for additional 10 minutes.","If thicker soup is desired, add more diced tortillas and let incorporate into soup.","Garnish with shredded cheese and broken tortilla chips.","Substitutions: 1 cup Masa Harina (Masa Flour) for 1 10 ct. package of corn tortillas.","Mix masa with 1 cup cold water, then add masa flour mix into soup. If thicker soup is desired, add more masa/water mix.","If you don't want to use the seasoning packet, substitute 1/2 teaspoons cumin + 1 tsp, chili powder.","You can also use grilled chicken fajita meat for poached diced chicken.","NOTE: If you use FLOUR tortillas, as some people have, you WILL end up with a \"TORTILLA MESS\", this recipe is for CORN tortillas. Don't go blaming me and giving me a bad review because you used the wrong stuff."],"Facts":["READY IN: 1hr 10mins, SERVES: 8","UNITS: US"]},{"Title":"MY FAMILY'S FAVORITE SLOPPY JOES (PIZZA JOES)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_566,h_319/v1/img/recipes/63/68/9/omzyoNv4TbqKCfkCXhax_sloppy joe.jpg3.jpg","Description":"I've tried many recipes, this is the best. I once 'dec-tupled' (10x) this recipe to sell sandwiches at a craft fair at my church. People were waiting in li... More","Ingredients":["1, lb ground beef","2 -3, stalks celery, chopped","1, small onion, chopped","1, (8 ounce) can tomato sauce","1/4, cup ketchup","1/4, cup barbecue sauce (your favorite, we use Open Pit)","1, tablespoon firmly packed brown sugar","1, teaspoon dry mustard","salt and pepper","1, tablespoon Worcestershire sauce","1, tablespoon vinegar"],"Directions":["In a large skillet, brown ground beef, celery and onion.","Drain the fat, who needs it?.","Stir in remaining ingredients, simmer covered, 15-20 minutes, stirring occasionally.","If Joes appear too'loose', leave cover off and let moisture evaporate.","Cook until it's the consistency you like for serving on toasted buns, with french fries and cole slaw."],"Facts":["READY IN: 45mins, SERVES: 4","UNITS: US"]},{"Title":"THE BEST BELGIAN WAFFLES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/63/07/1/Oey61BTvKAEV0tVQz4gU_untitled-1868.jpg","Description":"These waffles are super crisp on the outside, light as a feather inside and so scrumptious! Avoid removing them from the waffle iron too soon; they should be a golden ... More","Ingredients":["2, cups flour","4, teaspoons baking powder","1/2, teaspoon salt","1/4, cup sugar","2, eggs","1/2, cup vegetable oil","2, cups milk","1, teaspoon vanilla"],"Directions":["Oil the waffle maker.","Sift the dry ingredients together in a large bowl.","In separate bowl, separate egg whites and beat until stiff peaks form.","In a separate bowl, mix together the egg yolks, milk, oil , and vanilla, stir slightly.","Add to dry ingredients and mix well.","Fold in egg whites.","Cook in waffle iron on medium-high heat for around 5-10 minutes."],"Facts":["READY IN: 40mins, SERVES: 4-6","YIELD: 6 waffles, UNITS: US"]},{"Title":"MELT-IN-YOUR-MOUTH CHICKEN BREASTS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/37/33/6/1KevDZYLSSuYcrmrXpeu_0S9A1389.jpg","Description":"The mayonnaise make these chicken breast very moist and tender--enjoy!”","Ingredients":["4, boneless chicken breast halves","1, cup mayonnaise or 1 cup Greek yogurt","1/2, cup parmesan cheese, freshly grated","1/2, teaspoon seasoning salt","1/2, teaspoon ground black pepper","1, teaspoon garlic powder"],"Directions":["Mix mayonnaise or yogurt, cheese and seasonings.","Spread mixture over chicken breast and place in baking dish.","Bake at 375 degrees F for 45 minutes."],"Facts":["READY IN: 55mins, SERVES: 4","UNITS: US"]},{"Title":"CRACKER BARREL'S HASHBROWNS CASSEROLE - COPYCAT","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/15/24/2/WHQJZyXcSvqGFnAl5QEf_cracker-barrell-hash-brown-casserole_1794.jpg","Description":"I don't know if this is Cracker Barrel's actual hash browns casserole recipe, but it is close. This recipe can feed a large crowd and is good for a brunch.”","Ingredients":["2, lbs frozen hash browns","1/2, cup margarine or 1/2 cup butter, melted","1, (10 1/4 ounce) can cream of chicken soup","1, pint sour cream","1/2, cup onion, peeled and chopped","2, cups cheddar cheese, grated","1, teaspoon salt","1/4, teaspoon pepper"],"Directions":["Preheat oven to 350 degrees F and spray an 11 x 14 baking dish with cooking spray.","Mix the above ingredients together, place in prepared pan and bake for 45 minutes or until brown on top."],"Facts":["READY IN: 1hr, SERVES: 10-12","UNITS: US"]},{"Title":"THE BEST BROWNIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/mpx/5458749_16x9.jpg","Description":"These brownies are not cake-like. They are more moist and gooey. I always undercook them a bit because we like them very moist.”","Ingredients":["1/2, cup vegetable oil","1, cup sugar","1, teaspoon vanilla","2, large eggs","1/4, teaspoon baking powder","1/3, cup cocoa powder","1/4, teaspoon salt","1/2, cup flour"],"Directions":["Preheat oven to 350 degrees Fahrenheit or 180 degrees Celsius.","Mix oil and sugar until well blended.","Add eggs and vanilla; stir just until blended.","Mix all dry ingredients in a separate bowl.","Stir dry ingredients into the oil/sugar mixture.","Pour into greased 9 x 9 square pan.","Bake for 20 minutes or until sides just starts to pull away from the pan.","Cool completely before cutting.","Note: I usually double the recipe and bake in a 9 x 13 pan. If you double the recipe, you will need to cook longer than 20 minutes."],"Facts":["READY IN: 40mins, SERVES: 10","UNITS: US"]},{"Title":"CHICKEN NOODLE SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/20/75/5/9FBxOfHgTtaMZ28CQSxS_chicken-noodle-soup-3802.jpg","Description":"This chicken noodle soup is great on a cool day.”","Ingredients":["2, teaspoons butter","1, cup sliced celery","1, cup chopped carrot","1/2, cup chopped onion","1/2, teaspoon thyme","1, teaspoon poultry seasoning","2, (32 ounce) containers and 1 can chicken broth (14 ounce)","2, teaspoons chicken bouillon","8, ounces egg noodles","2, cups cooked chicken (3 frozen breasts)","parsley"],"Directions":["Melt butter in large pot.","Sauté the celery, carrot and onion for 5 to 10 minutes.","Add thyme, poultry seasoning, chicken broth and bouilion.","Bring to a boil.","Add noodles and chicken and cook on low for 20 minutes.","Sprinkle with parsley."],"Facts":["READY IN: 40mins, SERVES: 6","UNITS: US"]},{"Title":"YUMMY CRUNCHY APPLE PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/31/12/8/t4sT7E0wT05Kd3ncgzOe_AP 10 - final_4.png","Description":"Great pie!”","Ingredients":["FOR PIE","pastry for single-crust pie","1/2, cup sugar","3, tablespoons flour","1/4, teaspoon cinnamon","1/4, teaspoon nutmeg","1/8, teaspoon allspice","1/8, teaspoon salt","6, cups thinly sliced peeled apples (1/2 Macintosh, 1/2 Granny Smith)","CRUMB TOPPING","2/3, cup packed brown sugar","1/2, cup flour","3/4, cup quick-cooking rolled oats","1/2, cup butter","1/4, cup toasted pecans, chopped"],"Directions":["Use foil on bottom of oven rather than a cookie sheet under pie pan.","Prepare pastry for single-crust pie.","Place in pie plate and trim and crimp the edge; refrigerate 30 minute loosely covered with plastic wrap.","In a large mixing bowl, stir together the sugar, flour, cinnamon, nutmeg, allspice, and salt.","Add apple slices and gently toss until they are coated well.","Transfer mixture to pie.","FOR CRUMB TOPPING: Stir together brown sugar, flour, and oats.","Using a pastry blender, cut in the butter until topping resembles coarse crumbs.","Sprinkle over apple mixture in pie.","To prevent over-browning while baking, cover edge of pie with foil.","Bake at 375 degrees Fahrenheit for 25 minutes.","Remove foil and bake 25 to 30 minutes more, or until top is golden.","Remove from oven.","Cool on wire rack about an hour and serve!"],"Facts":["READY IN: 1hr 10mins, SERVES: 8","UNITS: US"]},{"Title":"CINNAMON COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/48/24/1/Sk8rBnswRoyI21qx80VM_untitled-0075.jpg","Description":"These are one of the best cookies I have ever eaten. They make up easily, and they disappear fast. I make these every year when we put up our Christmas Tree. I s... More","Ingredients":["1, cup sugar","1/2, cup butter","1, large egg","1, teaspoon vanilla","1 1/2, cups flour","1 1/2, teaspoons cinnamon","1, teaspoon baking powder","1/4, teaspoon salt","cinnamon sugar"],"Directions":["In a mixer bowl, cream together sugar and butter; beat in egg and vanilla.","Combine flour, cinnamon, baking powder and salt.","Add to butter mixture.","Blend well.","Cover and refrigerate 2 hours or till firm enough to roll into balls.","Shape dough into small balls about 3/4-inch in diameter.","Roll in cinnamon sugar to coat.","Set cookies 1-inch apart on lightly greased cookie sheets.","Bake at 350 degrees  for 10 minutes or till the edges are lightly browned.","Cool slightly on pans, then remove to racks to cool completely."],"Facts":["READY IN: 30mins, SERVES: 48","UNITS: US"]},{"Title":"PIZZA DOUGH FOR THIN CRUST PIZZA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_595,h_334/v1/img/recipes/70/16/5/VpYCAyQQw2c3LFvutQsZ_Final 1 - Heart Shaped Pizza.jpg","Description":"Note:This is one of the recipes I adopted in the Great 'Zaar Ophan Adoption of 2005. I hope you enjoy it.”","Ingredients":["2 1/2, cups all-purpose flour (may substitute whole wheat flour for 1 cup of the all-purpose)","1, (1/4 ounce) package active dry yeast","1/4, teaspoon salt","1, cup warm water","1/2 - 1, tablespoon olive oil","cornmeal, for sprinkling"],"Directions":["Mix a little sugar into the warm water.","Sprinkle yeast on top.","Wait for 10 minutes or until it gets all foamy.","Pour into a large bowl.","Add flour, salt, olive oil.","Combine.","Knead for 6-8 minutes until you have a moderately stiff dough that is smooth and elastic (add a bit more flour if you need to).","Cover and let rest for 20-30 minutes.","Lightly grease two 12-inch pizza pans.","Sprinkle with a little bit of cornmeal.","Divide dough in half.","Place each half on a pizza pan and pat it with your fingers until it stretches over the whole pan.","Try to make it thicker around the edge.","If desired, pre-bake at 425 F for 10 minutes (I don't always do this).","Then spread with pizza sauce and use the toppings of your choice.","Bake at 425 F for 10-20 minutes longer or until bubbly and hot.","Makes 2 12-inch pizzas.","If you don't want to use all the dough, you can freeze it.","Take a portion of dough, form into a ball, rub olive oil over it and place it in a freezer bag (the oil makes it easier to take out of the bag).","When you want to make a pizza, take dough out of freezer and allow to thaw before using."],"Facts":["READY IN: 1hr 15mins","YIELD: 2 pizzas, UNITS: US"]},{"Title":"SOFT PEANUT BUTTER COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_617,h_347/v1/img/mpx/5458762_16x9.jpg","Description":"This is my mother-in-law's recipe.She was always baking and this is one of my favorite recipes she had.”","Ingredients":["1, cup creamy peanut butter","1, cup packed brown sugar","1, cup white sugar","1, cup butter or 1 cup margarine, softened","2, eggs","1, teaspoon baking soda","1, teaspoon baking powder","1, teaspoon vanilla extract","2 1/2, cups flour"],"Directions":["Cream butter, peanut butter and both sugars together.","Add eggs, one at a time, beating well.","Add baking soda, powder and vanilla.","Stir in flour.","Roll into balls, roll in sugar. Flatten cookies, using a fork, in a criss-cross pattern.","Bake on ungreased cookie sheet at 350 degrees for 6-7 minutes or adjust to suit your oven and size of cookies!"],"Facts":["READY IN: 17mins, SERVES: 30","YIELD: 4 dozen, UNITS: US"]},{"Title":"NO-BAKE CHOCOLATE OATMEAL COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/23/82/1/jNvSMCJfQiKLq85ELUDD_0S9A5463.jpg","Description":"These are wonderful, quick cookies. It is one of the first things I learned to \"cook.\" You can add more or less oats (3 cups work best for me). I have found that t... More","Ingredients":["1/2, cup butter","1 1/2, cups white sugar","1/2, cup packed brown sugar","1/2, cup milk","4, tablespoons cocoa","1, pinch kosher salt","1/2, cup creamy peanut butter (or chunky but is seems to make a more crumbly, dry cookie)","2, teaspoons vanilla","3, cups dry quick-cooking oats"],"Directions":["Add the first six ingredients into a 4-quart sauce pan.","Bring to a rolling boil and hold for 1 minute.","Remove from heat.","Add peanut butter into the hot mixture and stir until melted.","Add in vanilla. (almond extract is good also, but I only use 1/2 teaspoon almond extract with 1 1/2 teaspoon vanilla extract).","Mix in the dry oats until they are completely coated.","Drop cookies by tablespoonfuls onto wax paper.","Let cool until set.","*Please remember that even if you do follow the recipe exactly, it doesn't always turn out just right. I've had these not set up for me or be hard and dry. But most of the time, the recipe is just right. I adjusted the sugar in the recipe by substituting 1/2 cup of white sugar for 1/2 cup brown sugar, this makes them more moist. I have also found that it makes a difference if you use quick cooking oats or old fashioned. In my experience it takes more old fashioned oats than quick cooking and I like the texture of the quick cooking better. When you make it a few hundred times like I have you learn a couple of things:) Also, Chunky peanut butter tends to make them more dry and crumbly."],"Facts":["READY IN: 6mins","YIELD: 24 cookies, UNITS: US"]},{"Title":"PERFECT PORK TENDERLOIN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/63/82/8/SRqYsUHTuKZwBGosxbdC_manchego-stuffed-mushrooms-6018.jpg","Description":"My #1 way to cook a pork tenderloin or a boneless pork loin because it's ALWAYS moist and tender. It's easy and foolproof! If you like, marinate the roast a... More","Ingredients":["1, lb boneless pork tenderloin","salt and pepper","dry seasoning, of your choice (thyme, savory, rosemary, garlic powder, onion powder, Italian seasoning, or a mixture)"],"Directions":["NOTE:  The success of this cooking method will depend upon how accurate the temperature of your oven is and how well your oven retains heat.  Adjust cooking time +/- according to your individual oven.","NOTICE: If you have a very old oven that is not well insulated, this recipe may not work for you, as heat retention/residual heat is important to the success of this recipe.","Determine the EXACT weight of roast from the meat wrapper. Weight will determine how long to cook the roast.","Preheat oven to 500 degrees. Remove tenderloin from refrigerator.  Season meat as desired.  Place seasoned meat in an uncovered roasting pan on a shelf in the bottom 1/3 of your oven.","Bake EXACTLY 5 1/2 minutes PER POUND. Adjust +/- according to your oven's accuracy and heat retention. NOTE:","IF YOU HAVE AN OVEN PROBE OR THERMOMETER THAT HAS A WIRE THAT GOES THROUGH THE SIDE OF THE OVEN DOOR, BY ALL MEANS USE IT AND SET THE TEMPERATURE ALARM FOR 140 DEGREES. REMOVE MEAT FROM OVEN WHEN ALARM ALERT GOES OFF (probably before an hour has expired).","Turn oven OFF and DO NOT open oven door for 45 to 1 hour, OR sooner IF you are using a probe thermometer and it alerts that internal meat temp is at 140 degrees. Remove pork from oven, lightly cover with foil, and let rest 5-10 minutes to redistribute internal juices. Roast should be done, very slightly pink in the center, and very moist.","After resting 10 minutes, the roast should reach a safe 145-150 degrees.","NOTE:******* For anyone questioning this method of cooking, it really does reach the proper internal temperature on a thermometer. According to Sara Moulton on FoodTV, trichinosos is killed at 138 degrees, and 145 is a safe temperature for pork, although the USDA recommends 160 degrees (meat will be much drier). If the center of the meat is not a little pink, it is overcooked!","VARIATION:  To make Roasted Veggies along with the tenderloin, peel carrots and potatoes, and cut into about 1-inch cubes.   Season as desired and drizzle with a little oil.  Add vegetables to pan around (but NOT touching) pork tenderloin.  Cook tenderloin as instructed above.  The roasted potatoes and carrots should be done when the roast is done.  You may need to adjust the size of the potatoes and carrots depending upon the weight of your tenderloin and how long you cook it."],"Facts":["READY IN: 10mins, SERVES: 4-5","UNITS: US"]},{"Title":null,"Image":null,"Description":null,"Ingredients":null,"Directions":null,"Facts":null},{"Title":"UTTERLY DEADLY SOUTHERN PECAN PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/mpx/0278330_16x9.jpg","Description":"The secret to this rich pie is cooking the sugar and corn syrup first. It is definitely not diet food! I bake this pie for 45 minutes according to my oven but you may need ... More","Ingredients":["1, cup sugar","1 1/2, cups corn syrup (I use 1/2 dark and 1/2 light)","4, eggs","1/4, cup butter","1 1/2, teaspoons vanilla","1 1/2, cups pecans, coarsely broken","1, unbaked deep dish pie shell"],"Directions":["In saucepan boil sugar and corn syrup together for 2 to 3 minutes; set aside to cool slightly.","In large bowl beat eggs lightly and very slowly pour the syrup mixture into the eggs, stirring constantly.","At this point I like to strain the mixture to make sure it's smooth and lump free.","Stir in butter, vanilla, and pecans and pour into crust.","Bake in a 350 degrees F oven for about 45 to 60 minutes or until set."],"Facts":["READY IN: 1hr 5mins, SERVES: 8","UNITS: US"]},{"Title":"BAKED SALMON","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/28/19/9/GoX0mmhFTHeYfppn5QH7_herb-salmon-4749.jpg","Description":"This is a great baked salmon recipe for beginners!”","Ingredients":["2, garlic cloves, minced","6, tablespoons light olive oil","1, teaspoon dried basil","1, teaspoon salt","1, teaspoon ground black pepper","1, tablespoon lemon juice","1, tablespoon fresh parsley, chopped","2, (6 ounce) salmon fillets"],"Directions":["In a medium glass bowl, prepare marinade by mixing garlic, light olive oil, basil, salt, pepper, lemon juice and parsley.","Place salmon fillets in a medium glass baking dish, and cover with the marinade.","Marinate in the refrigerator about 1 hour, turning occasionally.","Preheat oven to 375 degrees F (190 degrees C).","Place fillets in aluminum foil, cover with marinade, and seal.","Place sealed salmon in the glass dish, and bake 35 to 45 minutes, until easily flaked with a fork."],"Facts":["READY IN: 1hr, SERVES: 2","UNITS: US"]},{"Title":"DARK CHOCOLATE CAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_630,h_354/v1/img/recipes/24/96/WnJFBuTMQEj2PNZ1hLwg_batch23-7154.jpg","Description":"No description","Ingredients":["2, cups sugar","1 3/4, cups flour","3/4, cup baking cocoa (dutch process or dark cocoa preferably)","1 1/2, teaspoons baking powder","","","","","","",""],"Directions":["Heat oven to 350 degrees F.","Grease and flour two 9 inch round baking pans or one 13x9 inch pan.","In large mixer bowl, stir together dry ingredients.","Add eggs, milk, oil, and vanilla; beat on medium speed for 2 minutes.","Stir in boiling water by hand (batter will be thin). NOTE: I have tried it with 1/2 cup, 2/3 cup and 3/4 cup boiling water and we prefer it with less than 1 cup water. I usually use between 2/3 & 3/4 cups. The cake is still very moist but it doesn't seem to \"fall\" as much as it cools. This might have to do with our high humidity or brand of flour or other factors so I don't know if it will work for everyone.","","","","",""],"Facts":["READY IN: 1hr, SERVES: 20-24","UNITS: US"]},{"Title":"THE ONLY CHOCOLATE CAKE RECIPE YOU'LL EVER NEED! (DEVIL'S FOOD)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/26/37/0/bzwUWgTTGZ83fb1AbjMQ_CC 8 - final_6.jpg","Description":"This chocolate cake is absolutely thee best we have ever had. It is so moist and rich, I never make anything else (unless I am short on time :) The frosting reci... More","Ingredients":["CAKE","2, cups all-purpose flour","1, teaspoon salt","1, teaspoon baking powder","2, teaspoons baking soda","3/4, cup unsweetened cocoa powder","2, cups sugar","1, cup vegetable oil","1, cup hot coffee","1, cup milk","2, large eggs","1, teaspoon vanilla","FROSTING","1, cup milk","5, tablespoons all-purpose flour","1/2, cup butter, softened","1/2, cup shortening","1, cup sugar","1, teaspoon vanilla"],"Directions":["Preheat oven to 325 degrees F.","In a large mixing bowl, sift together dry ingredients. Add oil, coffee and milk and mix at medium speed for 2 minutes. Add eggs and vanilla and beat 2 more minutes. Expect batter to be thin.","Pour into a 9\" x 13\" greased and floured pan or 2- 9\" round pans. Bake 9 x 13 pan for about 45 minutes or 9\" pans for about 30 minutes. Cool in pans for about 15 minutes and then cool completely on racks.","While cake is cooling make the icing: Combine the milk and flour in a saucepan and cook over low heat until thick, whisking constantly. Cover and refrigerate until chilled.","In a medium bowl, beat butter, shortening, sugar and vanilla until creamy. Add chilled milk and flour mixture and beat for 10 minutes. Frost cooled cake and enjoy! The frosting sounds intimidating, but it is worth it! By the way, for some reason, we prefer this cake chilled, right out of the refrigerator. The rich chocolate and cool frosting just seem to taste best this way."],"Facts":["READY IN: 1hr 15mins, SERVES: 16","UNITS: US"]},{"Title":"REALLY GOOD VEGETARIAN MEATLOAF (REALLY!)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/33/92/1/wS6bmjUQSqDGOEFFnDbB_untitled-7953.jpg","Description":"High in fiber and protein, low in fat, easy and really yummy! I've always thought meatloaf looks and smells so delicious and savory so, as a vegetarian, I decide... More","Ingredients":["2, cups water","1, teaspoon salt","1, cup lentils","1, small onion, diced","1, cup quick-cooking oats","3/4, 3/4 cup monterey jack cheese or 3/4 cup American cheese","1, egg, beaten","4 1/2, ounces spaghetti sauce or 4 1/2 ounces tomato sauce","1, teaspoon garlic powder","1, teaspoon dried basil","1, tablespoon dried parsley","1/2, teaspoon seasoning salt","1/4, teaspoon black pepper"],"Directions":["Add salt to water and boil in a saucepan.","Add lentils and simmer covered 25-30 minutes, until lentils are soft and most of water is evaporated.","Remove from fire.","Drain and partially mash lentils.","Scrape into mixing bowl and allow to cool slightly.","Stir in onion, oats and cheese until mixed.","Add egg, tomato sauce, garlic, basil, parsley, seasoning salt and pepper.","Mix well.","Spoon into loaf pan that has been generously sprayed with Pam (non-stick cooking spray) or well-greased.","Smooth top with back of spoon.","Bake at 350 degrees for 30- 45 minutes until top of loaf is dry, firm and golden brown.","Cool in pan on rack for about 10 minutes.","Run a sharp knife around edges of pan then turn out loaf onto serving platter."],"Facts":["READY IN: 1hr 25mins, SERVES: 4-6","UNITS: US"]},{"Title":"GROUND BEEF STUFFED GREEN BELL PEPPERS WITH CHEESE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/13/56/wK9gMwSDOh2IAcRcZ8Hw_DSC03106.jpg","Description":"We had these not too long ago and we both decided that they needed a little more seasoning. We put a little hot pepper sauce on them and they were much better. I... More","Ingredients":["6, large green peppers","1, lb beef, Ground","1/2, cup onion, Chopped","1, (16 ounce) can tomatoes, diced","1/2, cup long grain rice, any available rice is fine it may affect cooking time though","1, cup water","1, teaspoon salt","1, teaspoon Worcestershire sauce","1, cup cheddar cheese, Shredded (about 4 ounces)"],"Directions":["Cut off the tops of green peppers; discard seeds and membranes.","Chop enough of the tops to make 1/4 cup, set aside.","Cook the whole green peppers, uncovered in boiling water for about 5 minutes; invert to drain well.","Sprinkle insides of the peppers lightly with salt.","In a skillet cook ground beef, onion and 1/4 cup chopped pepper till meat is browned and vegetables are tender.","Drain off excess fat. Add drained tomatoes, salt, Worcestershire, and a dash of pepper.","in a separate pot put water bring to boil add rice cook until rice is soft. if needed add more water.","add rice to beef mixture.","Stir in cheese. Stuff peppers with meat mixture. Place in a 10x6x2 baking dish.","Bake, covered in a 350 degree oven for 30 minutes. in the last 5 minutes add any remaining cheese to the top of the peppers."],"Facts":["READY IN: 50mins, SERVES: 3","YIELD: 6 peppers, UNITS: US"]},{"Title":"ICE CUBES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_574,h_323/v1/img/recipes/42/03/98/picFV7OMs.jpg","Description":"I'm publishing this recipe because I'm sure that there are other families who have members, who don't know how or have forgotten how to make ice when the ice tray is e... More","Ingredients":["2, cups water (approximately)","2, tablespoons water (additional if needed)"],"Directions":["Empty the ice cubes that are left in the trays (if there are any left) into the bin.","Take the trays over to the sink and fill them with cold water. (Hot water will freeze faster and more clear).","Place the water filled ice trays back in the freezer.","Replace the ice bin if you had to remove it.","Shut the door to the freezer.","Be sure to leave for around 4-6 hours at least to make sure it is frozen.","If you want to experiment, you can freeze things like fruit infused waters or juices."],"Facts":["READY IN: 6hrs 2mins","YIELD: 2 trays, UNITS: US"]},{"Title":"DENNY'S-STYLE FRENCH TOAST","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_626,h_352/v1/img/recipes/90/67/4/C7A0YlggR8e48Fgg0iFZ_DSFT 6 - final_3.png","Description":"I do not remember where I got this recipe, but my husband says it tastes just as good as what he had at Denny's. I am just amazed at all of the great reviews on this recipe!! My family lov... More","Ingredients":["4, eggs","2/3, cup whole milk","1/3, cup flour","1/3, cup sugar","1/2, teaspoon vanilla","1/4, teaspoon salt","1/8, teaspoon cinnamon","6, slices Texas toast thick bread","3, tablespoons butter","powdered sugar","butter","syrup"],"Directions":["Mix together the eggs, milk, flour, sugar, vanilla, salt& cinnamon.","Heat a large skillet, or griddle.","When the skillet is hot, add 1 tablespoon butter.","If the butter smokes, your pan is too hot; turn down the heat.","Dip each slice of bread into the batter for 30 seconds on each side.","Let some of the batter drip off, then put in skillet.","Cook each slice 1 1/2-2 minutes per side until each side is golden brown.","Add more butter, if necessary, to cook all of the slices.","To serve, put on plate, dust with powdered sugar. Serve with butter & hot syrup."],"Facts":["READY IN: 22mins, SERVES: 6-8","UNITS: US"]},{"Title":"MASHED RED POTATOES WITH GARLIC AND PARMESAN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_566,h_318/v1/img/recipes/34/38/2/picEKNrvR.jpg","Description":"The potatoes are ready in our garden, and this is the first recipe I reach for! These are SO good!!”","Ingredients":["2 1/2, lbs red potatoes, unpeeled, quartered","3, garlic cloves, peeled (depending on size and taste preference)","2, tablespoons butter","1/2, cup milk","1, teaspoon salt","1/4, cup grated parmesan cheese"],"Directions":["Put potatoes and garlic in lg pan.","Cover with water.","Bring to a boil.","Reduce heat and simmer for 25 minutes, until potatoes are tender.","Drain well.","Mash with the butter, milk, and salt.","Stir in the parmesan cheese."],"Facts":["READY IN: 30mins, SERVES: 6","UNITS: US"]},{"Title":"WONDERFUL SALSA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/92/72/57kV2MbdSregy8TZfkHj_batch23-6580.jpg","Description":"This is the best salsa recipe I've found so far and I've tried about a dozen. I got it from one of the local hospital cookbooks that are sold in my area. I... More","Ingredients":["8, cups tomatoes, peeled, chopped and drained","2 1/2, cups onions, chopped","1 1/2, cups green peppers","1, cup jalapeno pepper, chopped","6, garlic cloves, minced","2, teaspoons cumin","2, teaspoons pepper","1/8, cup canning salt","1/3, cup sugar","1/3, cup vinegar","1, (15 ounce) can tomato sauce","1, (12 ounce) can tomato paste"],"Directions":["Mix all together and bring to a slow boil for 10 minute.","Seal in jars and cook in hot water bath for 10 minute.","This is a medium salsa. This is also a chunky salsa so if you want a smoother salsa cut your veggies into smaller pieces.","Yields 3-6 quarts or pints."],"Facts":["READY IN: 1hr 15mins, SERVES: 96","YIELD: 3 quarts, UNITS: US"]},{"Title":"SWEET CORNBREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/11/61/85/28ru11Tg2JyPsRhR6lg7_beans-cornbread-whole-wheat-02247.jpg","Description":"No description","Ingredients":["1/2, cup cornmeal","1 1/2, cups flour","2/3, cup sugar","1, tablespoon baking powder","","","","","",""],"Directions":["Preheat oven to 350º.","In a bowl, combine cornmeal, flour, sugar, baking powder, and salt.","Add the oil, melted butter, honey, eggs, and milk.","Pour into a greased 8-inch square pan.","Bake for 35 minutes."],"Facts":["READY IN: 45mins, SERVES: 12","UNITS: US"]},{"Title":"REESES SQUARES - 5 INGREDIENTS & NO BAKE (REESE'S)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_565,h_318/v1/img/recipes/29/67/9/J1stgzFRTqkYn2HpK1Kn_RS 7 - final_4.jpg","Description":"These bars are EXTREMELY RICH and not for people with a fear of CHOCOLATE and PEANUT BUTTER (if those people actually exist)!!! Very easy no bake 5 i... More","Ingredients":["1 1/2, cups graham cracker crumbs","1, lb confectioners' sugar (3 to 3 1/2 cups)","1 1/2, cups peanut butter","1, cup butter, melted","1, (12 ounce) bag milk chocolate chips"],"Directions":["Combine graham crumbs, sugar and peanut butter and mix well.","Blend in melted butter until well combined.","Press mixture evenly into a 9 x 13 inch pan.","Melt chocolate chips in microwave or in double boiler.","Spread over peanut butter mixture.","Chill until just set and cut into bars (these are very hard to cut if the chocolate gets \"rock hard\"."],"Facts":["READY IN: 15mins","YIELD: 36 bars, UNITS: US"]},{"Title":"ULTIMATE PIZZA SAUCE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/11/43/92/picz5JbOA.jpg","Description":"This pizza sauce recipe was given to me as a wedding present, written on the inside cover of a pizza cookbook. It is thick, saucy, spicy and delicious. I'll n... More","Ingredients":["2, tablespoons olive oil","1, tablespoon butter","1/2, cup onion, chopped","1/4, cup celery, chopped","1, garlic clove, minced","1, (8 ounce) can tomato sauce","1, (6 ounce) can tomato paste","2, tablespoons grated parmesan cheese","1, teaspoon dried basil","1, teaspoon dried oregano","1/2, teaspoon salt","1/2, teaspoon sugar","1/4, teaspoon black pepper","1, small bay leaf","1, teaspoon fennel seed"],"Directions":["In a large skillet, melt butter with the oil. Add the onion, celery and garlic and saute until soft and transparent.","Add tomato sauce and tomato paste and stir until smooth.","Add remaining ingredients and bring to slow simmer.","Simmer for 30-60 minutes (or not at all depending on your taste and time frame).","Remove the bay leaf and spread the sauce on your prepared pizza dough."],"Facts":["READY IN: 1hr 20mins, SERVES: 4","YIELD: 1-2 pizzas, UNITS: US"]},{"Title":"OVEN CRISP CHICKEN WINGS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/mpx/5458740_16x9.jpg","Description":"This is a very tasty way to make wings. You can dip them in your favorite sauce when baked or they are yummy as-is. Recipe from CD Kitchen on the Internet.”","Ingredients":["1/3, cup flour","1, tablespoon paprika","1, teaspoon garlic salt","1, teaspoon black pepper","1/4 - 1/2, teaspoon cayenne pepper","3, tablespoons butter","10, chicken wings, tips removed"],"Directions":["Cut wings at joints.","Preheat oven to 425 degrees.","Be sure wings are thawed and dry them well with paper towels.","Combine flour, paprika, garlic salt, black pepper and cayenne pepper in a plastic bag.","Shake to mix ingredients and add wings.","Line a large baking sheet with Release foil and melt the butter on it. ( Makes for easy clean up.).","Add wings to pan and turn to coat.","Bake for 30 minutes.","Turn wings over and bake for 15 more minutes or until crispy and done."],"Facts":["READY IN: 1hr 5mins, SERVES: 4","UNITS: US"]},{"Title":"BUTTERY BREAD MACHINE ROLLS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/65/34/0/LdS3flAmS1m3bqNnldxM_untitled-0835.jpg","Description":"These golden, fluffy, butterfy rolls are great hot from the oven. The dough is very easy to shape. This recipe is from a QUICK COOKING magazine”","Ingredients":["1, cup warm milk (70 to 80 degrees F.)","1/2, cup butter or 1/2 cup margarine, softened","1/4, cup sugar","2, eggs","1 1/2, teaspoons salt","4, cups bread flour","2 1/4, teaspoons active dry yeast"],"Directions":["In bread machine pan, put all ingredients in order suggested by manufacturer.","Select dough setting.","When cycle is completed, turn dough onto a lightly floured surface.","Divide dough into 24 portions.","Shape dough into balls.","Place in a greased 13 inch by 9 inch baking pan.","Cover and let rise in a warm place for 30-45 minutes.","Bake at 350 degrees for 13-16 minutes or until golden brown."],"Facts":["READY IN: 2hrs 10mins","YIELD: 24 rolls, UNITS: US"]},{"Title":"CHICKEN LAZONE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_591,h_332/v1/img/recipes/65/76/8/SftRJCP5ROe4xjaH6fRW_chicken-lazone-3813.jpg","Description":"This recipe comes from the restaurant \"Brennan's\" located in New Orleans. No one has to know how simple and quick it is. I posted this recipe exactly as it was in the book, h... More","Ingredients":["1, teaspoon salt","1 1/2, teaspoons chili powder","1 1/2, teaspoons onion powder","2, teaspoons garlic powder","4, whole boneless skinless chicken breasts","1/4, cup butter, divided","1/2, cup heavy cream"],"Directions":["Combine the seasonings and coat chicken breasts.","In large saute pan melt half of the butter and cook chicken over medium heat for about 7 to 8 minutes, turning once.","Pour the cream into the skillet and lower the heat.","Simmer for several minutes, stirring until the sauce thickens then add the remaining butter.","When butter is melted place chicken breasts on four plates and top with the sauce."],"Facts":["READY IN: 25mins, SERVES: 4","UNITS: US"]},{"Title":"BANANA-CHOCOLATE CHIP MUFFINS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/19/42/4/AFQ4r6UkQdW7SLpu9xHt_banana-chocolate-chip-muffins_9146.jpg","Description":"WOW! Get this...a very low-fat muffin recipe that actually tastes great!! After failing at many attempts to create a really tasty, low-fat muffin, I came across this r... More","Ingredients":["3, medium very ripe bananas","1, egg","1/3, cup low-fat buttermilk or 1/3 cup milk","1/2, cup granulated sugar","1/2, cup brown sugar","1 1/2, cups flour","1, teaspoon baking soda","1, teaspoon salt","2 -3, tablespoons chocolate chips","2, tablespoons chopped walnuts (optional)"],"Directions":["Preheat oven to 350 degrees.","Lightly coat 12 muffin tin liners with cooking spray and place in muffin tin.","In large bowl, mash bananas with fork.","Whisk in egg, milk, granulated sugar, and brown sugar.","In separate bowl, combine flour, baking soda, and salt.","Add flour mixture to banana mixture and combine well.","Fold in chocolate chips and walnuts.","Spoon equal amounts of batter into 12 muffin cups.","Bake 20 minutes or until toothpick inserted in center comes out clean.","Allow to cool slightly in pan, then remove to wire rack."],"Facts":["READY IN: 35mins, SERVES: 12","YIELD: 12 mufins, UNITS: US"]},{"Title":"STEAK (OR CHICKEN) FAJITAS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/mpx/5458757_16x9.jpg","Description":"These are so quick and tasty. You can use strips of boneless chicken breast instead of the beef. Feel free to double the marinade. The flavor is so great for such a... More","Ingredients":["3/4, lb top sirloin steak","2, tablespoons olive oil","1, tablespoon lime juice","1, garlic clove, finely minced","1/2, teaspoon chili powder","1/2, teaspoon cumin","1/2, teaspoon hot pepper flakes","1/2, teaspoon black pepper","1/2, teaspoon salt","8, flour tortillas (8 inch/20 cm)","1 -2, onion, we usually use approx. 1-2 depending on size (however much you like,enough to make a good mix with the peppers)","2, small sweet peppers, of your choice (green, red, or yellow)","TOPPINGS","salsa","sour cream","shredded cheese","chopped tomato"],"Directions":["Slice steak into thin strips.","In bowl, mix together 1 tablespoons olive oil, lime juice, garlic, chili powder, cumin, hot pepper flakes, black pepper & salt.","Add beef strips and stir to coat, set aside.","Wrap tortillas in foil and place in 350 degrees  oven for 5-10 minutes or until heated through.","Cut onions in half lengthwise and slice into strips, cut your peppers into strips.","In large non stick skillet over medium high heat, heat remaining tablespoons of olive oil.","Add onions & peppers stirring for 3-4 minutes, until softened; transfer to a bowl and set aside.","Add beef to skillet, cook, stirring for 3-4 minutes or until they lose their red color.","Return onions and peppers to skillet; stir for about one minute.","To serve, spoon a portion of the beef mixture down the centre of each tortilla, top with your desired toppings , fold bottom of tortilla up over filling, fold the sides in, overlapping."],"Facts":["READY IN: 20mins, SERVES: 8","YIELD: 8 fajitas, UNITS: US"]},{"Title":"TURKEY MEATLOAF","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/54/75/2/BhLwXvk2QW2ACQmvqeJi_TM 4 - final_2.jpg","Description":"This recipe came from a package of ground turkey. It is by far the best turkey meatloaf I have ever tasted.”","Ingredients":["2, tablespoons butter (or margarine)","1, cup onion, chopped","3, garlic cloves, minced","1 1/4, lbs ground turkey","1/2, cup breadcrumbs","1, egg (or 1/4 cup egg substitute)","3/4, cup catsup","2, teaspoons Worcestershire sauce","3/4, teaspoon salt","1/2, teaspoon black pepper"],"Directions":["Melt butter in a skillet.","Cook onion and garlic in melted butter for 5 minutes, stirring occasionally.","Place mixture in a large bowl to cool for 5 minutes.","Combine turkey, bread crumbs, egg, 1/4 cup of the katchup, Worcestershire sauce, salt, and pepper with onion mixture.","Press meatloaf into an 8x4-inch loaf pan.","Spread remaining catsup on top.","Bake in a 350 degree oven for 50-55 minutes.","(Internal temperature should reach 165 degrees.) Remove from oven and let stand 5 minutes before serving."],"Facts":["READY IN: 1hr 5mins, SERVES: 5","UNITS: US"]},{"Title":"THE BEST CHILI YOU WILL EVER TASTE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_588,h_331/v1/img/recipes/73/16/6/jQ7zEif7QAuWHpy0nwFs_best chili SITE-3.jpg","Description":"This is the best chili recipe I have ever tried. I'm not sure where the recipe originated, but it is amazing! Sometimes, I don't bother adding all four cans of the kidney beans and i... More","Ingredients":["2, teaspoons oil","2, onions, chopped","3, cloves garlic, minced","1, lb lean ground beef","3/4, lb beef sirloin, cubed","1, (14 1/2 ounce) can diced tomatoes","1, can dark beer","1, cup strong coffee","2, (6 ounce) cans tomato paste","1, can beef broth","1/2, cup brown sugar","3 1/2, tablespoons chili sauce","1, tablespoon cumin","1, tablespoon cocoa","1, teaspoon oregano","1, teaspoon cayenne","1, teaspoon coriander","1, teaspoon salt","4, (15 ounce) cans kidney beans","4, chili peppers, chopped"],"Directions":["Heat oil.","Cook onions, garlic and meat until brown.","Add tomatoes, beer, coffee, tomato paste and beef broth.","Add spices Stir in 2 cans of kidney beans and peppers.","Reduce heat and simmer for 1 1/2 hours.","Add 2 remaining cans of kidney beans and simmer for another 30 minutes."],"Facts":["READY IN: 2hrs 30mins, SERVES: 6-8","UNITS: US"]},{"Title":"AWESOME BAKED HAM","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/46/92/2/fJfuxLU5TnezliEet9fx_DSC_0147-2.jpg","Description":"I love this recipe because it is so easy and it calls for hardly any ingredients, and I always have these ingredients in my pantry. This recipe came from a go... More","Ingredients":["15, lbs whole bone-in ham (I prefer Cooks SuperTrim brand)","1, lb brown sugar","1/2, cup yellow mustard","aluminum foil"],"Directions":["In a medium size mixing bowl, mix yellow mustard and brown sugar until you have a thick\"paste\".","Take all wrappers off of ham and trim away excess fat.","Line baking pan (I spray with Pam in case some of the brown sugar mixture escapes, clean up is easier) with Aluminum foil.","Place ham on foil and spread brown sugar/mustard paste on top.","Fold and seal foil.","Do not open again until ham is done.","Bake at 350 degrees  for 4 hours.","Let set for about 1 hr then carve.","One of the best tasting hams you will ever have!"],"Facts":["READY IN: 4hrs 20mins, SERVES: 20-25","UNITS: US"]},{"Title":"THE SWEETEST BLUEBERRY MUFFINS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/50/71/9/XgiEMwG3QZyGYIkRwUzM_0S9A3646.jpg","Description":"Very tasty And Sweet.”","Ingredients":["1/2, cup butter or 1/2 cup margarine, at room temp","1, cup granulated sugar","2, large eggs","1, teaspoon vanilla","2, teaspoons baking powder","1/4, teaspoon salt","2, cups all-purpose flour","1, cup milk","2 1/2, cups fresh blueberries or 2 1/2 cups frozen blueberries","lemon zest","FOR TOPPING","1, tablespoon granulated sugar, mixed with","1/4, teaspoon ground nutmeg"],"Directions":["Heat oven to 375 degrees .","Grease 18 regular-size muffin cups (or 12 large size muffins).","In bowl, mix butter until creamy. Add sugar and beat until pale and fluffy.","Add eggs one at a time, beating after each.","Beat in vanilla, baking powder and salt.","With spoon, fold in half of flour then half of milk into batter; repeat.","Fold in blueberries.","Spoon into muffin cups and sprinkle topping onto each muffin.","Bake 15 to 20 minutes, until golden brown and springy to touch."],"Facts":["READY IN: 30mins, SERVES: 12-18","YIELD: 18 muffins, UNITS: US"]},{"Title":"PEACH COBBLER","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_602,h_339/v1/img/mpx/5458763_16x9.jpg","Description":"I found this peach cobbler recipe on the internet from the Salt Lick Restaurant in Austin, TX. Everyone loves this recipe so much I have to make a double batch! Feel free to... More","Ingredients":["BATTER","1/2, cup melted butter","1, cup flour","1, cup sugar","2, teaspoons baking powder","1/4, teaspoon salt","2/3, cup room temperature milk","1, room temperature egg","FILLING","1, (28 ounce) can sliced peaches, drained","1, cup sugar","1, teaspoon cinnamon","1/2, teaspoon nutmeg"],"Directions":["Melt butter in a 9 x 13 inch pan.","Mix together flour, sugar, baking powder & salt.","Stir in milk & egg.","Pour evenly over melted butter.","Combine peaches, sugar & spices and spread over batter-DO NOT STIR!","Bake 35-45 minutes at 350 degrees F until batter comes to the top and is golden brown.","Serve warm with ice cream."],"Facts":["READY IN: 55mins, SERVES: 12","UNITS: US"]},{"Title":"WHITE ALMOND SOUR CREAM WEDDING CAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/69/63/0/kVMtb6o4QgKBhmRLEiZY_almondcake-1894.jpg","Description":"I made my daughter's wedding cake using this recipe. It turned out fantastic. The texture is just perfect for a wedding cake -- not too fluffy so it breaks from the we... More","Ingredients":["2, (18 ounce) boxes white cake mix (Betty Crocker or Pillsbury)","2, cups all-purpose flour","2, cups granulated sugar","1 1/2, teaspoons salt","2 2/3, cups water","1/4, cup vegetable oil","2, teaspoons real vanilla","2, teaspoons almond extract","2, cups sour cream","8, large egg whites"],"Directions":["Place all dry ingredients in a large mixing bowl and stir together with a wire whisk.","Add the remaining ingredients and beat on medium speed for 2 minutes.","Pour into greased and floured cake pans, filling each pan a little over half full.","Lightly tap cake pans on counter to bring air bubbles to top.","Bake in preheated 325 degrees  F oven until cake tests done.","Baking time varies according to the size and depth of pans being used.","I used Wilton's Bake Even Strips on my cake pans to ensure a level-topped cake which required absolutely no trimming-- I highly recommend these, or good quality professional baking pans.","In 2\" deep pans, this recipe makes:","One 14\" round and one 6\" round.","or One 16\" round.","or One 12\" round and one 10\" round.","or One 12 X 18\" sheet cake.","or One 12\" round and one 8\" round and one 6\" round.","or Two 9\" squares.","or 5 dozen cupcakes.","Half the recipe makes:","Two 7\" rounds.","or Two 6\" rounds and 6 cupcakes.","For chocolate cake: use chocolate mixes and substitute 6 whole eggs for the egg whites.","For liqueur flavors: substitute alcohol (such as champagne or Kahlua) for about 1 cup of the water in the recipe.","For berry flavors: use frozen berries, thaw reserving the juice. Substitute the berry juice for part of the water in the recipe, and stir the berries in at the end.","For lemon cake: substitute lemon juice for about 1 cup of the water in the recipe, use 6 whole eggs instead of the whites, stir in 1 Tblsp lemon zest, and use 1 tsp of a good lemon extract in place of the almond.","For white chocolate: melt 8oz white baking chocolate & cool slightly. use 6 whole eggs in the recipe instead of the whites, temper the chocolate by stirring in a small amount of the batter, then add the white chocolate to the entire batter and stir well. Doesn't bake up quite as high as the original, so add a pinch more batter to the pans."],"Facts":["READY IN: 55mins, SERVES: 40-50","UNITS: US"]},{"Title":"PANDA EXPRESS ORANGE CHICKEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/mpx/5458745_16x9.jpg","Description":"A copycat recipe from Panda Express. This chicken is tangy and flavorful. Give it a try! I'm sure you and your family will enjoy it.”","Ingredients":["2, lbs boneless skinless chicken, chopped into bite-sized pieces","1, egg","1 1/2, teaspoons salt","white pepper","oil (for frying)","1/2, cup cornstarch","1/4, cup flour","ORANGE SAUCE","3, tablespoons soy sauce","3/4, cup orange juice","1/2, cup brown sugar","1, orange, zest of","1, tablespoon oil","2, tablespoons gingerroot, minced","2, teaspoons garlic, minced","1, teaspoon red chili pepper flakes","1/2, cup green onion, chopped","2, tablespoons rice wine","1/2, cup water","2, tablespoons cornstarch","1, teaspoon sesame oil"],"Directions":["Place chicken pieces in a large bowl, set aside.","In a medium bowl, stir egg, salt, pepper and 1 tablespoon oil and mix well, set aside.","In a medium bowl, stir together 1/2 cup of the cornstarch and the flour.","Heat oil for deep-frying in wok or deep-fryer to 375 degrees.","Dip chicken pieces into egg mixture, then into the flour mixture, shaking off any excess.","Add chicken to wok in small batches and fry for 3 to 4 minutes or until golden brown.","(Do not overcook chicken).","Remove chicken from oil with slotted spoon and drain on paper towels; set aside.","FOR THE SAUCE:","In a small bowl, combine the soy sauce, orange juice, brown sugar and orange zest. Set aside.","Clean wok and heat 15 seconds over high heat.","Add 1 tablespoon oil, the gingerroot, garlic, crushed red chili pepper flakes and green onions and stir-fry for just a few seconds until fragrant.","Now, add the rice wine and the soy sauce mixture you set aside above.","Add cooked chicken, stirring until well mixed.","In a small bowl, stir together the water and cornstarch, then add it to the wok and stir until sauce has thickened. Add sesame oil if desired.","Serve over jasmine rice."],"Facts":["READY IN: 45mins, SERVES: 6","UNITS: US"]},{"Title":"PERFECT TURKEY IN AN ELECTRIC ROASTER OVEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_611,h_344/v1/img/recipes/33/94/53/rcfkZBSm64Sg49Uxmfzg_roast-turkey-1.jpg","Description":"I never found good information on making a great whole roasted turkey in an electric roaster oven and thought I'd share my tried and true tips for making your holiday turkey mo... More","Ingredients":["1, whole turkey, thawed up to 20 lbs","1/4, cup olive oil or 1/4 cup butter","1, teaspoon seasoning salt","1, teaspoon poultry seasoning","1/2, teaspoon pepper"],"Directions":["Take the insert pan out of the roaster and pre-heat the roaster to its highest setting. On mine it's 450, but use 500 if your oven goes that high.","Do not wash the turkey! The USDA says that washing it could cause a spread of salmonella poisoning. Sprinkle salt in the cavities. Stuff if desired. Don’t pre-stuff your turkey; mix and stuff ingredients immediately before roasting. Tossing in a few pieces of cut fruit or herbs is not considered 'stuffing.' Stuffing usually means filling up the cavity with about ¾ cup stuffing per pound of turkey.","Rub the entire bird with olive oil or butter. Doctor up your bird with whatever special seasonings you wish. I always use poultry seasoning. Finish with a good sprinkle of seasoning salt and black pepper.","I highly recommend using a wired thermometer so you can watch the temperature without lifting the lid. Your turkey will be done much earlier than the estimated cook time, so keep a sharp eye on that thermometer. If using a pop-up turkey plug type thermometer, those little pop-ups stick sometimes so you should really use two of them.","Put the rack into the insert pan and make sure the handles are up, not tucked below. Put the bird in the insert pan on top of the rack. Don’t add water to the pan. Put the insert pan back into the roasting pan. If your roaster doesn't have an insert pan, it's ok - just be very careful putting the bird into that hot oven, you don't want to burn your hands on the sides of the oven! Cover.","Roast at highest setting for 30 minutes. The butter/oil, seasonings and the searing time will make the skin beautifully browned and perfect!","After 30 minutes, turn the oven temperature down to 325.","The turkey will self-baste if you do not lift the lid, so you don't have to baste it every 20 minutes like you do in your conventional oven. DO NOT LIFT LID during cooking time! Lifting the lid will increase cooking time because roaster ovens lose their heat unlike regular ovens. I've read that roaster ovens effectively 'steam' the turkey making the meat come out -- well, steamed. This is not true as you will find out. Similar to the roasted chickens you can get at your supermarket, the bird will come out moist and perfectly roasted. Why do you think they call it a Roaster Oven?.","Figure your total cooking time from the time you first put the bird in the roaster. The Butterball website has a great calculator:","http://www.butterball.com/calculators-and-conversions.","FINAL TEMPERATURE FOR SAFETY AND DONENESS IS: 180 DEGREES IN THIGH AND 165 DEGREES IN BREAST AND STUFFING. Juices should be clear, not pink.","Check your turkey EARLY. Really start watching the temp an hour before it's supposed to be done. Your turkey will almost certainly be done before the suggested cooking time. Watch your wired meat thermometer. If using a pop-up turkey plug type thermometer, check by lifting the lid quickly so the oven doesn’t lose its heat. If necessary, check after another 30 minutes, but I doubt you'll have to do that. I say check after 30 minutes because it's really OK to let the bird roast a little extra - you won't dry it out using my method if you let it go for 1/2 hour.","When done, remove the turkey from the roaster, tent with foil, and let rest for 20 minutes. This allows the juices to really seep into the meat, so they say.","If you try this method, please let us know your results!","Happy Thanksgiving everyone!"],"Facts":["READY IN: 4hrs 20mins, SERVES: 18","YIELD: 1 Turkey, UNITS: US"]},{"Title":"CHEWY CHOCOLATE COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/50/49/t4GwMRVRQGGw9sJsHFE6_untitled-0360.jpg","Description":"”","Ingredients":["1 1/4, cups butter or 1 1/4 cups margarine, softened","2, cups sugar","2, large eggs","2, teaspoons vanilla extract","2, cups all-purpose flour","3/4, cup cocoa","1, teaspoon baking soda","1/2, teaspoon salt","2, cups peanut butter chips (12 oz. pkg.) or 2 cups semi-sweet chocolate chips (12 oz. pkg.)"],"Directions":["Heat oven to 350 degrees .","In large mixer bowl; cream butter and sugar until light and fluffy.","Add eggs and vanilla; beat well.","Combine flour, cocoa, baking soda and salt; gradually blend into creamed mixture. Stir in peanut butter or chocolate chips.","Drop by teaspoonfuls onto ungreased cookie sheet. Bake 8-9 minutes. (Do not overbake; cookies will be soft. They will puff while baking and flatten while cooling.).","Cool slightly; remove from cookie sheet onto wire rack. Cool completely."],"Facts":["READY IN: 9mins","YIELD: 54 cookies, UNITS: US"]},{"Title":"KITTENCAL'S CHOCOLATE FROSTING/ICING","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/recipes/89/20/7/Gd10moETkiN5jxAII7jk_choc frosting-1231.jpg","Description":"A wonderful frosting I have used for years made in very little time with perfect results and 100% better than any canned, this frosting is so good you will find yourself eating... More","Ingredients":["1/2, cup butter, softened (you can use margarine but the flavor will not be the same)","2 2/3, cups confectioners' sugar, sifted","1/3, cup half-and-half cream (can use unwhipped whipping cream in place of half and half) or 1/3 cup milk (can use unwhipped whipping cream in place of half and half)","1 1/2, teaspoons vanilla","CHOOSE ONE OF THE FOLLOWING","1/3, cup unsweetened cocoa powder, sifted (for light)","1/2, cup unsweetened cocoa powder, sifted (for medium)","3/4, cup unsweetened cocoa powder, sifted (for dark rich)"],"Directions":["Cream the butter in a small bowl.","Blend in the cocoa powder (the amount desired for a light, medium or dark flavor), vanilla, confectioners sugar, alternately with the cream.","Beat with an electric mixer, until the desired texture is achieved.","**NOTE** because of the additional cocoa powder more cream may have to be added in to reach desired consistency."],"Facts":["READY IN: 5mins, SERVES: 24","YIELD: 2 cups, UNITS: US"]},{"Title":"CARAMELIZED BAKED CHICKEN LEGS/WINGS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_575,h_323/v1/img/recipes/14/50/38/narIiRSK1QtMnGNiGvg1_017 caramelized chicken legs.jpg","Description":"Delicious! Yummy caramelized legs, kids love these! So quick and easy and no marinating required. Just prepare the sauce, pour over the chicken and pop in the oven... More","Ingredients":["2 1/2, lbs chicken legs","1 2/3, tablespoons olive oil (to help it stop sticking to the pan)","1/2, cup soy sauce","1 2/3, tablespoons ketchup","3/4, cup honey","2 -3, garlic cloves, minced","salt and pepper"],"Directions":["Preheat oven to 350 degrees Fahrenheit or 180 degrees Celsius.","Place chicken in a 9x13 inch baking dish. Mix together the oil, soy sauce, ketchup, honey, garlic, salt and pepper.","Pour over the chicken.","Bake in preheated oven for one hour, or until sauce is caramelized.","Could also use wings or pork ribs."],"Facts":["READY IN: 1hr 35mins, SERVES: 6-8","UNITS: US"]},{"Title":"ROASTED GREEN BEANS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/13/38/21/8JbamEgZSzOQgR13anhB_roasted-green-beans-2435.jpg","Description":"A great alternative to fast-food French fries, my family and friends love these as a snack or hors d'oeuvre. No matter how many I make, it's never enough!”","Ingredients":["2, lbs green beans","1 -2, tablespoon olive oil (or just enough to lightly coat beans)","1, teaspoon kosher salt (or to taste, may substitute with Mrs. Dash if desired)","1/2, teaspoon fresh ground pepper (or to taste, omit if using Mrs. Dash)"],"Directions":["Preheat oven to 400 degrees F.","Wash, dry well, and trim green beans.","Put green beans on a jelly roll pan.","Drizzle with olive oil.","Sprinkle with salt and pepper to taste (I like them salty so I use about 1 1/2 teaspoons of salt and about 8-10 grinds of the pepper mill). *Mrs. Dash may be substituted for salt and pepper as desired.","Use your hands to be sure all the beans are evenly coated and spread them out into 1 layer.","Roast for 20-25 minutes, turning after 15 minutes, until beans are fairly brown in spots and somewhat shriveled.","Serve hot or at room temperature."],"Facts":["READY IN: 25mins, SERVES: 4-6","UNITS: US"]},{"Title":"CREPES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/18/41/0/mlUJhy1T3CFzP1eDMACA_DSC_0003.jpg","Description":"You can do SO much with a crepe. Make many different desserts.”","Ingredients":["1, cup flour","1 1/2, cups milk","2, eggs","1, teaspoon vegetable oil","1/4, teaspoon salt"],"Directions":["Combine flour, milk, eggs, and oil.","Add salt.","Heat a lightly greased 6 inch skillet; remove from heat.","Spoon in 2 Tbsp batter; lift and tilt skillet to spread evenly.","Return to heat; brown on one side only.","To remove, invert pan over paper toweling.","Repeat with remaining batter.","Fill with your favorite filling.","Here's a few we like: Any flavor fruit jam, sweetened fresh peaches, cream cheese and pineapple, ham and maple syrup.","Endless ideas."],"Facts":["READY IN: 15mins","YIELD: 7 crepes, UNITS: US"]},{"Title":"AWESOME BAKED PORK CHOPS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/34/49/9/ghJ53URWS2oYSG25Y1KA_awesome-baked-pork-chops-5351.jpg","Description":"These chops remain moist and tender, and the sauce is to die for! You probably have all the ingredients in your kitchen to make this! Serve these chops over rice!”","Ingredients":["6, pork chops","1, teaspoon garlic powder","1, teaspoon seasoning salt","2, eggs, beaten","1/4, cup all-purpose flour","2, cups Italian style breadcrumbs","4, tablespoons olive oil","1, (10 3/4 ounce) can condensed cream of mushroom soup","1/2, cup milk","1/3, cup white wine"],"Directions":["Preheat oven to 350.","Rinse pork chops, pat dry, and season with garlic powder and seasoning salt to taste.","Place the beaten eggs in a small bowl.","Dredge the pork chops lightly in flour, dip in the egg, and coat liberally with bread crumbs.","Heat the oil in a medium skillet over medium-high heat.","Fry the pork chops 5 minutes per side, or until the breading appears well browned.","Transfer the chops to a 9 x 13 baking dish, and cover with foil.","Bake in the preheated oven for 1 hour.","While baking, combine the cream of mushroom soup, milk and white wine in a medium bowl.","After the pork chops have baked for an hour, cover them with the soup mixture.","Replace foil, and bake for another 30 minutes."],"Facts":["READY IN: 2hrs 30mins, SERVES: 6","UNITS: US"]},{"Title":"OREO BALLS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/52/03/5/tVR1tbsS069Ay1YFTLIA_0S9A6681.jpg","Description":"My sister's co-worker brought these to a party and they were quite a hit. I don't know where the recipe came from originally. \"Bark\" is an artificia... More","Ingredients":["1, (16 ounce) package Oreo cookies, crushed","1, (8 ounce) package cream cheese, softened","1, (24 ounce) package white chocolate bark","1, (24 ounce) package chocolate bark"],"Directions":["Using a blender or hand held mixer, mix Oreos and cream cheese together.","Roll into walnut size balls.","Chill for an hour.","Melt approximately 3/4 package of white almond bark.","Stick a toothpick in an Oreo ball and dip it in the melted white almond bark.","Allow to harden on wax paper.","Takes about 15 minute.","While waiting, melt about 1/4 package of chocolate almond bark.","When Oreo balls are no longer sticky to the touch, decorate with drizzles of chocolate and white almond bark.","I just use a sandwich bag with a tiny hole cut in one corner to drizzle the almond bark."],"Facts":["READY IN: 2hrs","YIELD: 25-35 Walnut size candies, UNITS: US"]},{"Title":"CHOCOLATE CHIP MUFFINS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_644,h_362/v1/img/recipes/93/26/5rgFIUpaQoail3AhnPrU_DSC01846.jpg","Description":"muffins”","Ingredients":["2, cups all-purpose flour","1/3, cup light-brown sugar, packed","1/3, cup sugar","2, teaspoons baking powder","1/2, teaspoon salt","2/3, cup milk","1/2, cup butter, melted and cooled","2, eggs, lightly beaten","1, teaspoon vanilla","1, (11 1/2 ounce) package milk chocolate chips","1/2, cup walnuts or 1/2 cup pecans, chopped"],"Directions":["Preheat oven to 400 degrees F.","Grease twelve muffin cups.","In a large bowl, stir together flour, sugars, baking powder, and salt.","In another bowl, stir together milk, eggs, butter, and vanilla until blended.","Make a well in center of dry ingredients.","Add milk mixture and stir just to combine.","Stir in chocolate chips and nuts.","Spoon batter into prepared muffin cups.","Now bake for 15-20 minutes or until a cake tester inserted in center of one muffin comes out clean.","Remove muffin tin to wire rack.","Cool for 5 minutes.","Remove from tins to finish cooling.","Serve warm or completely cool.","These muffins freeze well."],"Facts":["READY IN: 25mins","YIELD: 12-18 muffins, UNITS: US"]},{"Title":"PASTA WITH SAUSAGE, TOMATOES, AND CREAM","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/mpx/0278766_16x9.jpg","Description":"Delicious and satisfying... I don't remember where this recipe comes from, but it's a pleaser! Easily doubled. Also, works well with gf pasta and sausage”","Ingredients":["1, tablespoon olive oil","1/2, lb sweet Italian sausage link, casings removed,crumbled","1/4, teaspoon crushed dried red pepper flakes","1/4, cup diced onion","1 1/2, cloves garlic, minced","1, (14 1/2 ounce) can Italian plum tomatoes, drained,coarsely chopped","3/4, cup whipping cream","1/4, teaspoon salt","6, ounces pasta","1 1/2, tablespoons minced parsley","grated parmesan cheese"],"Directions":["Heat oil in a heavy skillet over medium heat.","Add sausage and crushed red pepper.","Cook until sausage is no longer pink, stirring frequently, about 7 minutes.","Add onion and garlic to skillet and cook until onion is tender and sausage is light brown, stirring occasionally, about 7 minutes.","Add tomatoes, cream, and salt.","Simmer until mixture thickens slightly, about 4 minutes.","(Can be prepared one day ahead. Cover and chill.).","Cook pasta in large pot of boiling water.","Drain.","Bring sauce to a simmer.","Add pasta to sauce and cook until pasta is heated through and sauce thickens, stirring occasionally, about 2 minutes.","Divide pasta between plates.","Sprinkle with parsley.","Serve, passing Parmesan separately."],"Facts":["READY IN: 25mins, SERVES: 2","UNITS: US"]}]}