[{"Title":"ITALIAN WEDDING SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/14/06/1/picehYi5q.jpg","Description":"","Comments":["The only addition I made was adding onion to the soup. This is one of my families favorites- I have made it about four times and will continue!","I added 1/3 cup each of celery and onion to bump up the veggies and flavor. I also added 1 tablespoonful of corn starch stirred into 1/4 cup of cold water to make the broth a little thicker. I added garlic powder and Italian season blend to the broth. Instead of bread crumbs I used oa... More","I've added 1/3 cup each of celery and onion to bump up the veggies and flavor. I also added 1 tablespoonful of corn starch stirred into 1/4 cup of cold water to make the broth a little thicker. This soup is amazing, and I am so glad that I finally found a recipe that is both delicious and eas... More","I've made this three times, and I'm in love with this soup. I don't eat beef, so I've used turkey and sausage as a substitute and both were fantastic (I added more breadcrumbs to the sausage because it was more fatty and wouldn't hold together otherwise). I cook mine a little longer if I get ... More"],"Likes":291},{"Title":"BREAD MACHINE CINNAMON BUNS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/50/72/2/fv4sSn4TwmhsR3LUSrKA_Bread machine cinnamon buns 50722-2.jpg","Description":"Bread machine cinnamon buns.","Comments":["Easy and delicious! !!!!","I found your recipe last week and made a very successful batch. Last night I was hungry to do it again but found the wrong recipe. I knew it was different as I was going but the ingredients pretty much the same. Only the other recipe called for warm milk 110f and I think I war... More","This is my go to recipe! When done with care and consistency they turn out perfect every time. Everyone I have shared these with love these cinnamon rolls. Warning don't let the dough sit to long after it is ready and don't put down too much flour, otherwise your rolls will come o... More","The best recipe ever! I make them twice a year. My best friend growing up owned the cinnamon bun place in the mall, these are even better!! Amazing! Like other reviews I do increase the filling and glaze. They don't need it but, if I'm having them twice a year I want them extra goey!!","yum!"],"Likes":153},{"Title":"OLIVE GARDEN FETTUCCINE ALFREDO","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/85/96/7nqcwQZxSiOWr3jp4BgE_FettucineAlfredo3.jpg","Description":"Just like the famous restaraunt's dish.","Comments":["Olive Garden actually lists it's formal recipe on it's website. It does not list cream cheese. Why would I want to use it?","Delicious, entire family loved! Making for second time tonight! I take chicken breast salt and pepper and panko them fry I'm olive oil and cup up on top of Alfredo and noodles??","My go-to Alfredo recipe. If you would like to make it taste even better, use fresh parmesan, fresh garlic (not powder), fresh basil, freshly ground pepper, and fresh pasta. You can even add steamed broccoli, sautéed chicken breasts/tenderloins, or sautéed shrimp.","I add 8 oz cream cheese, use half n half instead of milk and add steamed broccoli and shredded chicken. It's so good!","Loved it and so did my family!!"],"Likes":208},{"Title":"QUICK SPANISH RICE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/17/12/6/picgz7Npe.jpg","Description":"Great side dish for your Mexican fiesta. Try with Recipe #17130! It is as good as you'll find in any Mexican restaurant. Update: 1 teaspoon cumin was added to... More","Comments":["This was excellent! And so easy to do--not one thing to chop! I used brown rice and cooked it for 35 minutes. Came out perfect. This is going into the permanent \"rotation\" list.","Made 2 double recipes the first time for a Taco Tuesday potluck. It turned out perfect with a lot of nice comments. Will be making 2 double recipes next week for another potluck. Having grown up with homemade Spanish rice, I knew I would be adding extras and changing some of the s... More","My changes were: regular diced tomatoes slightly pureed, 2-1/2 tsp. pure Ancho chile powder and only 1/4 tsp. oregano. The additions were sauteed onion w/yellow bell peppers for the color and sliced green onions and sliced black olives. I love olives in Spanish rice and enchiladas.","This is the 3rd time I've used this recipe. The first 2 times turned out great. This time I used short grain brown wild rice. I will have to note that 25 min was not a long enough cook time. I put the lid back on the pan and see what comes about. I'm fearful of turning the heat back on?!?!","Made it as a cheesy casserole for family Sunday Dinner. Followed the directions exactly then layered the finished Spanish rice with cheese for a total of 3 layers. Delicious!"],"Likes":236},{"Title":"THE VERY BEST SALISBURY STEAK","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/56/69/4/42Ci6hYOTp5pIswQ8Eoa_salisbury-steak-01143.jpg","Description":"This is our favorite salisbury steak recipe. I always make enough extra sauce to serve over potatoes. Tastes like it took all day to cook.","Comments":["This is my favorite recipe for salisbury steaks! The gravy is fine as written, but I didn't like the ketchup in it, it made it a bit too sweet for my tastes, so I just leave that out and it still turns out great.","I don't have worchesterchire sauce what can I use?","Can make it and freeze it for five weeks? I want to make 1/4 once patties since I am serving other things as well.","I add fresh sliced mushrooms to the sauce, then pour over the steaks.","I didn't enjoy it as much as I thought I would. The ketchup was too sweet for me."],"Likes":236},{"Title":"BEEF TIPS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/17/99/0/5xlpyAPOSxGdaqmTLZ0o_BT 5 - final_3.jpg","Description":"","Comments":["You can find my adjustments in a lengthy explanation within the \"tweak\" category. I was being modest when I said I've made this about 22 times. The first two times, I followed the recipe exactly. Long story short (minus some extra ingredients): 1 tsp. of brown gravy powder (not ... More","Great base recipe; significant, easy tweaks needed. I've made this as-is twice, and about 20 times with ever-evolving tweaks. I finally nailed it. For the default 2-lb-of beef recipe, I use just over a pound of meat instead (extra sauce). Double the sauce if you're going to do a full ... More","How can I send this recipe to someone? There is no envelope anywhere to email it.","How can I adapt this recipe to a slow cooker?","Could this be done in a slow cooker?"],"Likes":207},{"Title":"PEANUT BUTTER CHOCOLATE CHIP COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_588,h_331/v1/img/recipes/51/10/4/oticxStySLmdMPAZBhzM_PB choc chip SITE-3.jpg","Description":"I love these rich, very sweet, addictive cookies. I adapted this recipe from one I found and loved on allrecipes.com. I have altered it somewhat to suit my tastes and ... More","Comments":["Yummy. I added 1/4 tsp. Salt and 1 tsp. Vanilla. I used chunky peanut butter and added some white chocolate chips as I was a little short on semi sweet chocolate chips. Baked 12 at a time at 325F for 17 mins worked perfectly for me. ??","Turned out Wonderful. I added vanilla, cream cheese, milk chocolate and peanut butter morsels!!","These cookies are delicious!! Everyone loves them. I'm making them again this week. I substituted 1 cup of flour for almond flour. I also substituted 1 cup of sugar for Splenda. They are still amazing :)","Yikes! Sweet peanut butter, chocolate chips and two cups of sugar! Way too sweet!"],"Likes":183},{"Title":"CHILI'S SALSA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/59/63/5/S3ImJ4QS46kXJfNRnKF9-Chlili-s-Salsa---59635-1.JPG","Description":"You can make this sauce easily at home. From Copykat.com (http://www.copykat.com)","Comments":["We're addicted to Chili's salsa and always bring home an extra bag of chips and bowl of salsa. I've been making this recipe for years. Because I normally cook for 2, and this recipe makes a lot of salsa, I had to modify it slightly. I use 1 (14oz) can of whole peeled tomatoes, plus ¼ diced fre... More","I've been working on my salsa skills for the past year. Usually I use fresh ingredients, or I cook the ingredients. It never even occurred to me to use canned tomatoes until I looked up this recipe. I am obsessed with Chili's salsa, so I decided to give this recipe a try. I used the sugge... More","What brand of tomatoes and chili's (for instance) - not a common typle of tomato like stewed, crushed, whole, puréed.... is it to be found in the Mexican section?","DEFINITELY needs some lime juice, about 2-3 T, and some cilantro. I love cilantro and use quite a bit, but add to taste","As did others, we also added lime, cilantro, black pepper and a touch more sugar. It was more to our liking."],"Likes":212},{"Title":"OUR FAVOURITE LEMON LOAF","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_563,h_317/v1/img/recipes/38/95/3/picDIvpWq.jpg","Description":"This is soooo nummmmy!! for lemon lovers. Very good warm or cold. (have been making this for years and cannot remember where it came from, probably from... More","Comments":["Great recipe! I used the recommended 1/4 milk 1/4 lemon juice, reduced the sugar to 3/4c, and used salted butter. Made into muffins instead of a loaf - baked @ 375 instead of 350 for about 15 minutes... just until the edges start to brown!","Agree with other reviewers that the glaze is what makes this good. So don't skip it.","This recipe is awesome! Made this as a \"breakfast dessert\" and it was a hit. I did use butter (one stick), and the rind and juice of 2 lemons. I added the juice before adding the dry.","When you say the rind of one lemon, do you mean zesting one whole lemon?","The glaze was the crowning glory of this little loaf. Next time I'll be more careful not to let any run off the top. The bread didn't have as much lemon flavor as I had hoped, so I will add extra juice or extract next time. Also, I had to reduce the bake time by about 20 minutes for my hot oven."],"Likes":173},{"Title":"DEVILED EGGS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/48/15/3/TrKIAiXyStaqjpJUCaT0_food.com-28.jpg","Description":"This recipe was my Mother's and she taught me to make them. My sons and their families always request these eggs for all family get-together dinners.","Comments":["I make these all the time. I always use a mandolin to slice the jalapeño in paper thin slices to put on top. I do this because I make regular deviled eggs to. My new favorite way to prepare the filling is using Boursin cheese...therefore omitting mayo.","i use your recipe but I add sugar, garlic powder and CELERY SEED.","Many of the comments refer to Miracle Whip and pickle relish as though the recipe includes those ingredients. Yet, the recipe as shown does not include either. Has the recipe that is now shown, been altered since being posted originally? If so, that should be noted. If not, then why are so ma... More","I used sweet pickle relish instead of gherkins. Also added 1/4 cup finely chopped onion. 1 tsp sugar. 1 tsp onion powder. And substituted Miracle Whip for mayo.","Absolutely love this recipe!"],"Likes":236},{"Title":"NESTLE TOLL HOUSE CHOCOLATE CHIP PAN COOKIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_576,h_324/v1/img/recipes/10/82/48/7yPr8ik3Tv6CICVLQYyh_nestle-pan-chocolate-chip-cookie-bars-5545.jpg","Description":"This recipe was in my paper recently and I made them for my co-workers. DIVINE! I looked & looked and was surprised I couldn't find it already on Zaar.","Comments":["13x10 pan, 375 @28 minutes","The first time I made this, I followed the directions, using a 15x10 jelly roll pan at 375* for 20 minutes and the results were a hardened, crispy mess. Only a small portion was soft and edible. While those parts were good, I was upset that I had to toss most of it in the trash. But I decided to ... More"],"Likes":207},{"Title":"SIMPLE SWEET SCONES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/66/40/9/picN1TduR.jpg","Description":"This is a simple perfectly delicious recipe my mom used to make for our family. It origioually came from a biscuits and scones recipe book, this one was always m... More","Comments":["It says recipe makes 12-16 scones, but recipe only directs to make ONE round cut into 6-8 wedges. Should it say \"divide dough in half, then pat into round\"?","Very good. Almost like my Granny in Ireland made. Only difference is she used buttermilk rather than milk. But overall, A+","This is such a nice way to start the day! Thank you for posting."],"Likes":173},{"Title":"CARAMELIZED BUTTERNUT SQUASH","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/10/66/27/FTCiWV9HR6i7yQ0v4WsG_butternut1 (1 of 1).jpg","Description":"This is a delicious butternut squash recipe from Ina Garten / The Barefoot Contessa. We really enjoy this during the holidays. It is best when the squash i... More","Comments":["Amazing way to make butternut squash. It was very tender and delicious! Will definitely make again!!","This is a truly amazing recipe. The squash was perfect and not too sweet. I tossed it with some angel hair pasta, cotija cheese, and fresh parsley to make a quick lunch and it was so so so good!"],"Likes":278},{"Title":"KOREAN ROAST CHICKEN THIGHS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_565,h_318/v1/img/recipes/83/20/3/whCeWl0LRbCEBfa3J4YP_0S9A6313.jpg","Description":"Not sure where I found this recipe, but make it monthly for my family. I have used vegetable oil in place of the sesame oil and it still tastes great.","Comments":["Super easy & delicious! No fuss~just add rice & a veg & supper is ready!","This is SO tasty and easy to make! It reminds me of bourbon chicken. The skins help to create a wonderful broth to serve over rice. I pulled the skins to one side to allow the chicken to soak in the sauce and that was the tastiest part! I think next time I will skip the oil - it doesn't seem necessar... More","I'm obsessed with this chicken! I used skinless chicken thighs and it turned out delicious! Served with brown rice and steamed broccoli!"],"Likes":210},{"Title":"JUMBO SHRIMP PARMESAN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/42/16/9/7e9h0rmqQ2efo55x5JLo_JSP 4 - final_2.jpg","Description":"I made these for dinner tonight and they are scrumptious! Can be made ahead up to and including the breading stage and refrigerated. Then drizzle with butter and... More","Comments":["Can you use an air fryer ?","The only change I made was to use Old Bay seasoning instead of just salt and pepper. These were delicious! My \"drizzle with melted butter\" technique was abysmal more like a dump the butter all over half and then kind of \"dip\" the rest of the shrimp in the puddle! And they still turned... More","I had to use gluten free bread crumbs due to a family member's gluten intolerance, but otherwise followed the recipe. They turned out great and were enjoyed by all. Served with a side of garlic chive noodles.","I have made this recipe numerous times. It always turns out the same- absolutely delicious! Thank you for sharing it!"],"Likes":260},{"Title":"CINNAMON RAISIN BREAD FOR THE BREAD MACHINE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_609,h_343/v1/img/recipes/47/11/1/picA7FZbg.jpg","Description":"","Comments":["When the nutrition info appeared in the print out, it shows 2078.2 calories per 1 gm slice!!!!!!!!!!! Total fat: 27.7 gm. Total carbs: 416.6 gm. CAN THIS BE CORRECT????? OMG!!!!!","Easily one of the best things I've ever made. YOU MUST make a glaze for this bread! Trust me! It takes it from \"good\" to \"mind blowing\"! SOME NOTES/POINTERS: -I used 2c all purpose and 1c WW as the reviews mentioned. -I DEFINITELY had to add more water; ww flour absorbs more moisture and I dr... More","Tried substitution of brown sugar and granulated combination with an addition 1/3 quantity. Toss fresh raisins in the sugar and what ever doesn't stick to them goes into the recipe as normal. A touch of vanilla extract. Bread is darker and has much more flavour and aroma.","Why does my bread come out so heavy","350* and 40-50 minutes"],"Likes":175},{"Title":"BACARDI RUM CAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/14/49/9/4B9e825xT4eqx14VuXK3_rum cake 1.jpg","Description":"This Bacardi rum cake is lovely and moist. I usually make it around New Years, makes a nice looking dessert for a buffet and the taste is rich and wonderful. From a... More","Comments":["The recipe for Bacardi's Rum Cake calls for one 18 1/2 oz package yellow cake mix. The current cake mixes are smaller. They are 15.25 oz mixes. Do I need to adjust the recipe in any way to compensate for the smaller cake mixes? Do I need to purchase 2 cake mixes and add more to the mix?"],"Likes":193},{"Title":"NEW YORK CHEESECAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/57/02/5/10PIImsmQwqM1uXdc7FF_cheesecake-cherries-7411.jpg","Description":"What a delicious way to end a meal! There's nothing better than a great piece of New York Cheesecake!","Comments":["Leave out the lemon peel for a more authentic NYC taste.","I find the recpie nice, but it tastes more like the NY Cheesecake I grew up with, and even has the texture I enjoyed in NYC if I leave out the lemon peel. I noted the lemon peel part originated in more southern US, not NY. So there is a small modification folks might like to try.","Do you have to make your own crust for this to work or can you just buy a graham cracker crust from the grocery store?","First time making cheesecake, and it was delicious. I followed recipe with a few minor changes thanks to reviewers. I made sure ingredients were all room temp and 15 second softened my cream cheese in microwave. I Lined the pan with round parchment. I added 4 tbsp of sugar to crus... More","Make this in my food processor only differences are: more lemon zest and about a tablespoon of lemon juice, sour cream instead of heavy cream, I use a water bath, foil tent, and it cooks a little longer this way. Turns out delicious and creamy every time. I also use chocolate chip teddy g... More"],"Likes":189},{"Title":"CRISPY BAKED CHICKEN LEG QUARTERS (VERY EASY, ONE DISH)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/44/94/52/xVLAiJSaSHuLa1PYefFw_0S9A3089.jpg","Description":"This is one that I adapted from Recipe #199636 after I scored 4 huge chicken leg quarters on sale. ($0.39 a pound!). I added a few things and adjusted the ... More","Comments":["Definitely a go-to formula, especially the cooking times. The recipe is wonderfully flexible for many seasoning options. Go Lioness! We. Are.","I used the soy sauce with Herbs de Provence...my new favorite herb mix. :)","aggravated that i even need to log in to leave a review to say that i'm aggravated to have to print the nutritional value of the recipe. i print on both sides of the paper to save paper and the nutritional value(that i don't care about and can't delete) costs another piece of paper. progress?... More","Winner, winner, my new chicken dinner. I found a great buy on hind quarters and tried a recipe and it was pretty gross, this was my second and what a blessing. For me it is key to use a rack to keep it off the bottom of the pan, my rack would not fit in my glass casserole dish so I us... More"],"Likes":123},{"Title":"CHICKEN, SHRIMP AND ANDOUILLE JAMBALAYA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_599,h_337/v1/img/recipes/28/16/5/7FnoxNcQbWQWEBXuO7aq_CSJ 4 - jambalaya with crusty french bread.jpg","Description":"A Cajun classic, meal in one pot! Have the hot sauce ready to splash on. Serve with some crusty french bread, a nice crisp salad, and some of your favorite wine. :)","Comments":["Disappointing. I cooked it in an enameled-iron Dutch oven (instead of a casserole) in the oven. There was not enough chicken stock and the rice stuck/scorched onto the bottom and sides of the Dutch oven. Also the rice was breaking down like rice pudding so it was clearly overcooked using the time... More","I made this and my family wont stop asking for it now! Thank you...awesome recipe","Packed with flavor! Have made this numerous times and will continue to do so!","I have made this recipe at least a dozen times. Always delicious. Everyone loves it and asks for more. I add Miller Lite Beer instead of broth. (It's a guy thing)","CAN I make this without the bell peppers, as I can't digest them? Is there something I can add instead?"],"Likes":207},{"Title":"CHILI CON CARNE WITH BEANS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/11/14/9/jwHBjpOSQkqyD8wQmrjX_chili-con-carne-2.jpg","Description":"This is my father-in-laws recipe for chili. I love to make it on a cold winter night. Sometimes I serve it with Corn Chips in the bottom of the bowl, topped with the chil... More","Comments":["I agree that this is a great starter recipe. The first time I made it, I followed the directions and was pleased. Since then, I still use this as a base but add more beans and more seasoning. I also like a jalapeño or two for added spice.","Excellent receipe! Hearty chili that's got great flavor. Add pepper and jalapenos if you like and if you don't use the beer, add a cup of water. Quick and easy also!","Tried this last night even my picky husband lived it","Good starter recipe but some recommended tweaks: I'd omit both the tomato paste and canned tomatoes. The tomato sauce and canned diced tomatoes add plenty of tomato flavor and acidity. Double the beans. I personally use 1/2 black and 1/2 red kidney. Feel free to increase the amoun... More","Simmer covered? Rinse the beans [probably not and rinse away the chili flavor, but thot I'd better ask]? Don't you usually wait to put the garlic in AFTER the onions have cooked?"],"Likes":300},{"Title":"LOW & SLOW OVEN BAKED RIBS - SUPER SIMPLE!","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/30/32/45/tKqC3hipQA2MRyTEsneh_oven-bbq-ribs-02757.jpg","Description":"This is truly the ONLY rib recipe you will ever need. Ribs simply don't get any better than this! You'll need a fork and knife to eat these, as they will FALL OFF... More","Comments":["what temp should you cook the ribs to? i'm making st louis ribs.","I made a rack of baby backs yesterday for New Years Day for my husband and myself. I cooked them at 225 for 4 hours before draining and turning over to add bbq sauce. They were not fall off the bone tender but that may have been because the rack was so thick. They were still very tasty (a... More","Miss the smoke.liquid smoke works wonders..add it at the begiinning and a light layer with the sauce...great simple mouthwatering recipe..love it.","best ribs EVER, and so easy! i'll definitely be making these again.","SO TENDER YOU DON'T NEED NO TEETH. AFTER 3.5 HOURS I SAMPLED EM AND DIDN'T PUT IN MY DENTURES. DID 2 RACKS OF BABY BACKS AT 225, BROWNED EM UNDER THE BROILER. ADDED SAUCE AND BROILED UNTIL BUBBLY. I LOVE THIS RECIPE AND WILL DO IT AG... More"],"Likes":143},{"Title":"BEST EVER BANANA MUFFINS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/62/28/6/X6IbE4EzSmwJ6NutMhQl_0S9A2157.jpg","Description":"These are the only banana muffins I make now. I add chocolate chips to my batter and triple the recipe. These freeze great. I got this recipe from an old (1980's) Cana... More","Comments":["Easy and quick to make-look and smell delicious- haven't tasted them yet- added chopped pecans","As we self quarantined ourselves because of Covid19, I looked on the counter and noticed the extra bananas that we certainly wouldn't eat in the next two days. After searching the internet, I found this muffin recipe and they are totally DEElicious!! I had everything I needed, and they we... More","As a mom with 3 kids I constantly have to come up with new healthy treats, so when I came along to this recipe I immediately fell in love. The only thing I would suggest is if you put chocolate chips in the batter I recommend putting rock salt on the top of the muffin after th... More","1/4 C less sugar Use silicone baking cups instead of paper for ultimate moist and non-stick results"],"Likes":129},{"Title":"CREAMY POTATO SALAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_629,h_354/v1/img/recipes/20/15/5/DfRxI7TQQLSsOsTEguCB_bacon-potato-salad-carolina-bbq-pork-mustard-sauce-5759.jpg","Description":"Have you ever posted a recipe and just love reading the reviews for it? This is my signature potato salad. Whenever there is a pot luck function at work, I am TOLD that I have t... More","Comments":["This is such a great basic recipe. I suggest substituting 3/4 c sour cream for 3/4 c of the mayonnaise/salad dressing. I buy a big bag of real bacon bits at either Sam's Club or BJs and use them in just about everything. For this recipe I would use 1/2 - 3/4 c and crisp them up in the microwave before adding to the salad.","Cant I peel the potatoes before cooking them?","To make this even Better, is to use 2 different types of potato's.....New and Russett","This recipe is almost verbatim to the Better Homes and Gardens New Cook Book (1981) Creamy Potato Salad on page 334. The only change is the addition of the bacon. So yes, it's a good one, tried and true, and will definitely remind you of your Mom's potato salad. I had been looking for something a little different but I gues... More","My boyfriend and I loved this; we both said it was the best potato salad we've ever had. Perfect balance of mustard and mayo. Great touch of sweetness with the bacon. We used red potatoes and red onions instead."],"Likes":257},{"Title":"INCREDIBLY DELICIOUS CHEESE GARLIC BREAD SPREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/18/91/4/pic2sQxHo.jpg","Description":"Easy, cheesy, savory spread to transform regular bread into a taste sensation! Goes awesome with pasta dishes or beside a fresh salad.","Comments":["Have you ever tried making it and freezing it before baking it & putting the cheddar cheese on it? Thank you so much.","Awesome! I bought a $1 French baguette from grocery store and spread this on top. I added the mixture after 5 mins....then broiled for the last 2 mins to toast it. Used butter instead of margarine. Amazing!","Wow, was this ever good. We really loved this simple recipe, it was so quick and easy to make with terrific results. Best of all it uses ingredients that are always found in my pantry and fridge. Thank you so much for sharing a recipe that we will enjoy often. Made for What's on the Menu ... More","Incredibly delicious indeed!!! Thanks for posting"],"Likes":234},{"Title":"VERY MOIST BANANA NUT BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_593,h_333/v1/img/recipes/82/48/6/kl6MLnGuSQqNbowX4NEm_moist_banana_bread_82486.jpg","Description":"This is a very easy, \"no mixer\" bread to make. It is very moist and a little heavy type banana bread. The really important thing to remember is using all black ... More","Comments":["Really Good! Moist and tasty! Thanks for sharing","Recipe please","Moist and full of flavor, very nice bread","This is my absolute FAVORITE banana bread. I always make it as is and it's the best I've ever had. Thank you, peppermintkitty for THEE best recipe!! ??"],"Likes":260},{"Title":"5 MINUTE VEGAN PANCAKES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/13/22/63/D30C2lxTy6SAflQlb61Q_VP 4 - final_2.jpg","Description":"A cinch to make and tastes wonderful, if you like the taste of Baking Powder. My skeptical parents couldn't believe these were vegan. Try with white and whole... More","Comments":["This is my go-to recipe. I've been using it for over a year. It makes the best pancakes.","Are you sure it's meant to have 2tbsp of baking powder?","We love these pancakes! I replace the oil with applesauce. My 2 year old loves them with syrup, jelly, or even plain!!"],"Likes":499},{"Title":"BUTTERED EGG NOODLES (BEST EVER)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/11/10/7/pic1Vp9Xh.jpg","Description":"The creamiest buttered egg noodles you will ever taste. Always a hit and easy to prepare.","Comments":["Omg so good! I used 12oz of dumpling noodles, so increased water to 3.5cups and bouillon to 3 cubes. Soooo delish! Liked it better as written than with parmesan. Family asks for this frequently now and husband requests it when we have company!","For this recipe how does 2 1/4 cups of water cook a whole bag of egg noodles","Who knew that using bouillon would taste so so so much better! I actually did not. Thank you so much for this recipe! Such an underrated side dish. Needs a bit more water though! Add another half cup at least.","Added about another half cup of water","I didn't have boullion cubes, so i substituted the same amount of stock for the water. Still needed more liquid along the way as the noodles cooked. Interesting way to cook noodles though."],"Likes":204},{"Title":"QUICK SOFT BREADSTICKS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/71/36/0/zZhtMAzSQVWYZ0bhNz9L_0S9A6349.jpg","Description":"Our family likes these breadsticks because they are soft and chewy. I like to make them when I am in a hurry because they rise quickly.","Comments":["\"make dough by your favorite method\".... I haven't made dough for 30 years... LOL. Any tips other than mix all ingredients and knead by hand until it feels right? I have a vague memory of bread making in a galaxy a long time ago... far far away... ;-)","I made these while visiting my daughter's family, to go with lasagna. The kids loved them and even ate the leftovers for breakfast. My grandson calls them \"the twists of awesomeness!\" They like the flavor of garlic, so I am considering substituting the salt for garlic salt to give it extra nip.","Any one make these at a high Altitude? If so what adjustments did you use? Thanks."],"Likes":164},{"Title":"KUNG PAO CHICKEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/40/33/9/8LlvD01KRZma63m8pHzA_DSC05256-2.jpg","Description":"This is a recipe that I've used for years. It's so quick and easy for a week night meal and has such wonderful flavor.","Comments":["Loved this recipe! Just added some sweet red bell pepper and it came out so great! Will definitely make it again."],"Likes":327},{"Title":"CHICKEN POT PIE WITH 2 CRUSTS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/11/17/77/4M0LhAvZRZiwYwIkDGAN_DSC_6220.jpg","Description":"This is old-fashioned, from scratch, comfort food. This has been a family favorite for years. I like to take this to other families when they are in need of a meal. It... More","Comments":["What type of pie crust do you use? The regular or deep dish?","Does the bottom crust get cooked to not be soggy? I haven't tried this recipe, but it's on the calendar. Thanks!","I didn't modify this recipe at all. Super easy and my husband LOVED it! I used unsalted butter for the white sauce. There's a little salt in the recipe anyway, and in the crust as well, so you can always add more to taste. It was beautiful coming out of the oven and we ate half of it before I too... More","Can this be made ahead of time and reheated just before dinner?"],"Likes":215},{"Title":"MY NO ROLL PIE CRUST","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/51/53/7/5AM5mA39Qde8zKbbDd0w_NRPC 7 - final_4.jpg","Description":"The only pie crust I will use anymore. Its flaky and slightly sugary and oh so easy to do. Note: due to some major discrepencies please use a good quality oil, p... More","Comments":["can frozen strawberries instead of fresh for pies?","The recipe does not say what size of pie plate she used. And Metal or glass ? Any ideas?","What kind of oil do you use ??","Do you need to prebake this before you fill it for a baked pie like apple pie?","Way too salty....and very crumbly, ..."],"Likes":284},{"Title":"TURKEY MEATBALLS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_562,h_316/v1/img/recipes/33/94/4/d94yk4hZSxadPJdN1Ehh_turkey-meatballs-4.jpg","Description":"Quick, easy light flavor. I enjoy these with a green salad. Lite cooking so great for the waistline","Comments":["I have made this recipe about once a month for the past 2+ years. Here are some of my tweaks. - add a healthy pinch of crushed red or aleppo pepper - add 1/2 tsp Italian seasoning - add 1/4-1/2 tsp chipotle or ancho pepper - do half italian seasoned breadcrumbs and half panko - Finely... More","ok I got it from the reviews awesome...I'll bake them...having with spaghetti","Do you still have to brown meatballs first and then oven on 350 for 30 minutes?","How do I print this recipe?","Simple and tasty, especially for ground turkey.,"],"Likes":141},{"Title":"OATMEAL CHOCOLATE CHIP LACTATION COOKIES BY NOEL TRUJILLO","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_320/v1/img/recipes/19/23/46/pic3f2tcs.jpg","Description":"This recipe is great for mothers who are breastfeeding. It helps to keep your milk supply up or increase your milk supply. Use more brewers yeast and oatmeal if ... More","Comments":["What can i use instead of brewers yeast","Mine turned out like little fluff balls ... Im not really a baker so what could i have done wrong?","Is it salted or unsalted butter","Can anyone recommend how many to eat a day?"],"Likes":155},{"Title":"THICK AND CREAMY NEW ENGLAND CLAM CHOWDER","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/52/27/2/c6fmjvRQxGUOJdQMXdAl-Clam-Chowder---52272-3.JPG","Description":"This is the BEST chowder I've ever had. I've had chowder at Legal Seafoods in Boston, which I have to say is good, but mine is BETTER! If you like thick ch... More","Comments":["Really good soup,easy","So you cook the potatoes just in the skillet with the juice? No water added?","I'ce made this several times. Great tasting recipe! To save some time and effort, I use one can cream of celery and one can cream of potato, then add 2-3 diced potatoes I also add a third can of clams or sometimes a can of crab meat.","Do I cover the pot during the instruction: \"Cook for about 30-45 minutes or until thickened.\" ?"],"Likes":228},{"Title":"AWARD-WINNING BUTTER TARTS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/14/75/6/DSolhekRQmSkhscV4Btk_Award winning butter tarts 14756-6.jpg","Description":"Butter tarts are a Canadian tradition. Waaaay back in the 1970s, a national contest here in Canada concluded that these butter tarts, originating from Wilkie's Bake... More","Comments":["I omitted the raisins and added pecans instead. I also doubled my recipe and used half Coconut oil instead of the butter. They are DELICIOUS!! YUMMY Good and so easy to make. Thanks again for round two of my Christmas baking...???????????????","I love this recipe for Award - Winning Butter Tarts! I was in a rush today because I woke up late. My father in law invited us for Christmas dinner and I really wanted to bring a dessert. He is not really a fan of sugary dishes so I asked my husband if these would be a better option t... More","Great user friendly recipe, doubled up, on two different days and the recipe was consistently successful. I did use the frozen tart shells as I had zero time to be mucking with pastry. Very tasty, had to do the second batch as the first somehow disappeared.","Can I freeze these tarts?"],"Likes":156},{"Title":"MACARONI AND CHEESE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_566,h_319/v1/img/recipes/52/79/9/VgaiZqtbRByPpcH71R9E_Macaroni and cheese 52799-7.jpg","Description":"This is my MIL recipe she has made it for years. It is delicious. The elbow macaroni measurement is for 1--16 ounce box dry. I can't respond to zmail because of a pr... More","Comments":["Can I make this the night before the dinner and cook the next day?","Our whole family loved this mac n cheese! We used it as a main dish and it still served a lot. The leftovers were good too the next day!"],"Likes":274},{"Title":"KITTENCAL'S FAMOUS COLESLAW","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/recipes/10/26/17/cYrCmcd1RjOC5HIkAz9d_homemade-coleslaw-1.jpg","Description":"This is the most delicious coleslaw that you will ever have! I make this for weddings, large socials and in the summer for BBQ's and parties, and there is never anything lef... More","Comments":["This coleslaw was great! I used the dressing with a bag of coleslaw mix veggies. Couldn't have been easier. Sweet, but not too sweet. Tangy, too. Will use again and again.","I've been searching for the perfect coleslaw recipe for years. Well, the search is over! I chopped up the cabbage and carrots in the food processor and followed the recipe exactly. Honestly, this coleslaw is a star! It's better than KFC slaw by a mile.","I did omit the seeds after the first batch because I thought they took away from the other flavors. I also added about 1/4 cup of orange bell pepper and 1/4 cup cilantro. It went with this recipe so well. When adding the bell pepper do not use more than a third cup of sugar","This is by far the best recipe period. I have three boys and they love when we are down south for the sun and traditional coleslaw, I made the s recipe and they are totally obsessed with it. I make it for potlucks and BBQ and everyone raves about it and want the city, so in love with this recipe.","I just made this about half an hour ago - waiting for all the flavors to marry - unfortunately, I misread white vinegar - thought it said white wine vinegar which I didn't have (duh me), so I substituted rice vinegar - this may have contributed to the sweetness, because it seems pretty sweet and I didn't even use all the sugar ... More"],"Likes":225},{"Title":"VANISHING OATMEAL RAISIN COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_583,h_328/v1/img/recipes/31/80/picIAY2vA.jpg","Description":"Oatmeal raisin cookie recipe from the Quaker Oats box before they changed the recipe","Comments":["The recipe for oatmeal cookies that I am looking for was included with the Quaker Oats old fashion in the round boxesin the 1960-1970s. I called for a 1/4 c. water.","When did Quaker Oaks change original recipe as I use to use it but Dales recipe here looks more like it. Thx in advance!","I have used this recipe for over 40 years. During that time I have adjusted the recipe. I grind 1 cup of pecans or walnuts and half of the oats (1.5 cups) the rest of the oats are added as is. Add raisins or dried cranberries soaked in hot orange juice. Drain the orange juice from the raisins before using.","First I added a tablespoon of honey to the mix. Then instead of raisins I used craisins then before baking I rolled the dough in cinnamon sugar for a crispy outside and a soft inside. I also baked them at 325 for 18-20 minutes. Yummy thanks for the recipe. Tried to add a pic but it wouldn't work on m... More","I just made these cookies. Love 'em! I made only half the recipe and added pumpkin seeds and sunflower seeds instead of raisins. I noticed that, at the bottom of the recipe, it says this recipe was posted before Quaker made changes to their recipe. So, anyone who feels these measurements ... More"],"Likes":196},{"Title":"CRABS - GARLIC BUTTER BAKED CRAB LEGS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_575,h_323/v1/img/recipes/23/89/94/piclnFDfk.jpg","Description":"I have tried and tried again to re-create the garlic butter crab legs that taste like the crabs from my favorite crab joint-The Crab House on Pier 39 in San Francisco. I have f... More","Comments":["Bought King Crab legs for the first time today- was going to boil them as I always do Snow Crab - but stumbled across this recipe. Holy Cow... delicious. The garlic butter EVOO and salt n pepper were perfect and the crab in the oven is genius.","Why would you put the flavor on the shell??? How does it get to the meat inside?","I like to use oven bags!! Helps with clean up too! Place them in oven or turkey bags (two) zip each bag up and put it in a dish in the oven !! Best thing ever !!!!","Should i thaw the crab legs before baking them ?","Should I thaw the crab legs before baking them ?"],"Likes":119},{"Title":"LEE LEE'S FAMOUS CHOCOLATE SAUCE FOR ICE CREAM","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/19/67/8/ShTSWHiITlaXkCMyTmht_LLPCS 4 - final 1.jpg","Description":"Here it is folks! First time ever in print! My Mom's famous hot chocolate sauce for ice cream sundaes. These are ingredients you more than likely always ha... More","Comments":["Absolutely delis!! definitely a keeper of a recipe people","Love this recipe, however I give it a Mexican twist. by adding 1/4 tsp cinnamon. I always double the recipe as we love it and use it hot or cold. No more store bought chocolate sauce for us!","This sauce was a breeze to make and tastes amazing! I will never buy chocolate sauce again!","I made this, but only used one tablespoon of sugar with a dash of stevia for sweetness. We poured it over a banana split, and my kids loved it!","I will never buy chocolate sauce again... This is far too easy and tastes amazing with ingredients that I will always have in my house. I like to substitute the water for milk or heavy cream but even when I don't it is absolutely amazing."],"Likes":162},{"Title":"FLOURLESS PEANUT BUTTER COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/17/94/3/MufmlxfwRG6joErzi1cg_flourless_pb_cookies17943_1.jpg","Description":"This flourless peanut butter cookie recipe is excellent and so easy to make. Your kids will love it and you will too! Because this recipe contains no flour, the true ... More","Comments":["Great recipe, just too sweet in my opinion. Next time, I will cut the sugar by 1/2. Also, I added a 1/2 teaspoon of vanilla. Other than that, they were very delicious! Loved that they were crunchy/chewy. Will make again.","Fantastic. I took advice from the other posters here, and added a tsp of vanilla extract and didn't fill the cup of sugar to the top. It is crumbly, but just let it cool and it will all work out fine. (I also did a few in a muffin tin, and those turned out even better, appearance-wise! I sprayed ... More","Had no eggs, so I made it vegan! You could use applesauce (I used a scant quarter cup of apple butter with some water to make the full quarter cup. No issues in flavor or texture from the substitution!","I made these and took them to a graduation open house. They are so good. I got more compliments than I could count. Some people ate them not realizing they were GF and said they were amazing. My BIL who has been GF for 5 years said they were the best he'd ever had. Thank you f... More"],"Likes":219},{"Title":"YUMMY CREAMY RICE PUDDING","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_565,h_318/v1/img/recipes/46/07/2/picnQ0fxn.jpg","Description":"Best rice pudding that I have ever tasted. Good sprinkled with nutmeg or cinnamon.","Comments":["Hi Barb, was wondering do you wash the rice before the boiling process. Thank you, would love to try this recipe sounds delicious. Thank you Sharon","I LOVE rice pudding, especially creamy pudding. I was very disappointed that, while it tasted good, the creaminess was not there.","Always ate rice puddings growing up. Hadnt had one since until I came across this recipe. Wow it took me back to my childhood and my husband loved it too ... recommend","How much vanilla goes into this recipe?","I followed the directions - milk curdled even though I turned the heat down below medium. Had to throw it all away. Not a well-written recipe"],"Likes":149},{"Title":"CHICKEN LEGS GRILLED","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/97/34/0/picKaQeyp.jpg","Description":"Generously seasoned crisp legs. Be sure to Visit the grilling forum http://www.recipezaar.com/bb/viewforum.zsp?f=42 for any ... More","Comments":["These came out really well. I added a teaspoon of onion powder to it and a little more oil. Also, I baked them at 375 for 35 minutes, then threw them on the grill for 10 minutes on each side...Perfect!","When grilling chicken leg quarters which side should you grill first the meaty side or the not so meaty side?","Delicious! I didn't have hours to wait. Mixed all the dry ingredients in a bowl, then rubbed olive oil on the leg quarters and sprinkled the dry ingredients over both sides. Preheated the grill and initially cooked over direct heat for about 5 mins, then went to indirect heat, then back t... More","This is simply delicious!","Quick and easy recipe. I made it for my girls and they loved it."],"Likes":139},{"Title":"CHOCOLATE CREAM PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_614,h_346/v1/img/recipes/43/10/0/sM3lozkTZuYYXNoZnRFQ_chocolate-cream-pie-0105.jpg","Description":"This pie is so rich. It is so quick and easy. It is also enjoyed quick and easy. You must try this for your next Chocolate Pie. I HAVE to make it EVERY Thanksgiving, especially for son Kev... More","Comments":["4 T cornstarch 6 T cocoa","5 stars for a great taste!!!! But next time I will either add more cornstarch or boil it a little longer.......I added an oreo crust and topping since my husband it obsessed with them......this is a keeper for sure!!!!!","Turned out PERFECT.. so easy and delicious","Substitute chocolate milk for the water. Trust me. I make this for my D&D group and they love it.","Yikes. Directions are definitely lacking. Aren't you supposed to bring to a BOIL anything containing cornstarch? I stirred and waited for it to thicken. I turned the heat up and stirred as the whole mess eventually stuck and burned! Into the sink with the whole mess. There are other easier \"from scratch\" chocolate pie recipes... More"],"Likes":236},{"Title":"WEIGHT WATCHERS PARMESAN CHICKEN CUTLETS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_617,h_347/v1/img/recipes/18/53/42/qh75rY6tQmGTP0ytQcuD_Parmesan-Chicken-Cutlets-2.png","Description":"This chicken tastes so great that it is great to have for dinner even when you're not on a diet.","Comments":["This is so quick and easy to make, and turns out delicious. I had to cut the cooking time due to the thin cut of my chicken. A definite repeat recipe.","Sounds fabulous! Is there any way to forward food.com recipes by email?","How many WW points?","what are the calories per serving?","How many ww points?"],"Likes":238},{"Title":"FAILPROOF FRENCH BREAD (BREAD MACHINE)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_565,h_318/v1/img/recipes/81/21/1/F0IewngIThCEKlGI2P8n_French Bread SITE-3.jpg","Description":"This makes two loaves of long baguette type French bread that has wonderful flavor and is so easy to make!","Comments":["I've made this as directed and I've made it as one oblong loaf baked in the oven smothered in garlic powder, butter and herbs. I've also just set my bread machine to the French Bread setting and had a loaf of bread come out that was light, delicious and made amazing sandwiches. This is my go ... More","Has anyone used all-purpose flour? How did it come out?"],"Likes":145},{"Title":"PERFECT RUMP ROAST","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_566,h_318/v1/img/recipes/29/41/96/E2fTQSzgQKiYq3xuj1De_IMG_0228.JPG","Description":"For as long as I can remember, my mother has been fixing the perfect rump roast. It is by far my favorite meal. Served with rice and gravy, I am one happy ... More","Comments":["Perf rump roast: adding water means braising. . You don't mention covering the roast which is the usual for braising. Please tell me what to do here.","when at lower temp, do i cover the pan","I added some beef broth and wine in place of the water - plus I chopped up extra garlic, and put in about sliced mushrooms and it turned out fantastic! I made a gravy and served with sliced potatoes, beets and a green salad. Yeah, this dish rocks and it's super easy.","I made this tonight for supper followed recipe to a tee. It was absolutely wonderful, melted in your mouth will definitely make again."],"Likes":190},{"Title":"MICROWAVE POACHED EGGS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/11/87/61/d8pqdsMSm3oitqe0cE2Q_MPE 5 - final_3 - horizontal.png","Description":"I have been poaching eggs in the microwave for many years. For me this is the best way to prepare poached eggs for 2. It is quick, easy and almost foolproof. Please... More","Comments":["My 1st time poaching eggs period. I used a regular bowl because I don't have a \"custard cup\". The tricky part is length of time vs type of microwave. I put on for 1 min but yolk was still yellow; I added 10-15 more seconds, top changed to white BUT despite putting in cold water be after... More","45 seconds on my microwave","This is genius. My stovetop is on the outs so I found your microwave directions and it's perfection. One suggestion is to place a napkin or paper towel beneath bowl because all microwave strengths are different and my egg did snap, crackle, and pop a bit at about 50 seconds. P... More","Epic fail. Egg exploded the 1st time. The second time the yolk was overdone on bottom and whites were slightly runny on top. I'll stick to the traditional way."],"Likes":195},{"Title":"MELT IN YOUR MOUTH BANANA BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/20/28/9/pU7QAhEgTQmTNhvOohrQ_melt in mouth banana bread SITE-2.jpg","Description":"I searched and searched for a banana bread recipe with the texture that I wanted and couldn't find one. One day I decided to modify my Recipe #14187 to see if I coul... More","Comments":["A recipe is a guideline which sometimes changes with each person. I've been using the same banana-nut bread recipe for 20 years but after reading the many positive reviews on this one, I said, oh why not? The only change I made was to reduce the sugar, like so many others did. I u... More","I love this recipe. I add a cup of chopped walnuts and love it even more!","could this be the perfect banana bread recipe? Cannot stop eating it!!! We added a bit of cinnamon but great either way!!!"],"Likes":235},{"Title":"MAMA IULIUCCI'S FAMOUS MEAT-A-BALLS (ITALIAN MEATBALLS)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/32/61/8/LodcmULQASjJu6KFcYMg_0S9A7399.jpg","Description":"Here it is, my mom's FAMOUS Meatball recipe! This is THEE most requested of her for anything, anywhere! Whenever there is a shower, birthday, christening, etc., ... More","Comments":["I made a double batch of these meatballs and froze them for later! They are delicious with store-bought pasta sauce on spaghetti or even in subs!","Love this recipe! This has been my go to meatball recipe. This is good as is. I eventually changed it up to be 1/2 pork and 1/2 beef. Recently I've switched to gluten free bread. I pair this with Don't Skip a Step sauce, and my family is very happy."],"Likes":208},{"Title":"CRUSTY FRENCH BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/10/14/76/T9kb9tQwRqOsl5fVXPzW_newsize-2.jpg","Description":"This recipe produces two crusty and chewy loaves that are so very good and so much better than store bought.","Comments":["Pretty good bread. I have made it twice now and my husband and daughter and son enjoyed it. Thanks for sharing your recipe.","I used 1 tbsp of salt instead of 2 tsp. Tastes GREAT!"],"Likes":208},{"Title":"LEFTOVER MASHED POTATO PANCAKES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_584,h_328/v1/img/recipes/90/54/QgpKo1rxQpSiZmN5F5jj_untitled-4303.jpg","Description":"This recipe was recently submitted to a news group to which I belong. I think it is very good and hope you like it, too. Preparation time in the kitchen is just a few minute... More","Comments":["This might be a dumb question, but should you heat up your left over mashed potatoes before mixing in the egg, flour, etc??","It calls for 1 to 2 eggs, how do i know how many?","I can never get these to work! They always fall apart when I flip them! Just threw away another batch in complete frustration. I cook for a living but not for the life of me can I get these right! The only thing I can think is there is too much oil. A friend told me to shallow fry them.","This is a FANTASTIC recipe! We love it around my house. Thanks for submitting!!"],"Likes":121},{"Title":"THE BEST BROWNED BEEF STEW EVER","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_596,h_335/v1/img/recipes/36/98/4/izfPQmT8T9SX9btZvIxI_282 browned beef stew.jpg","Description":"I originally found this recipe at Recipe Goldmine but have added and subtracted after trial and error. The original recipe called for a 10 oz pkg of frozen peas to be added ... More","Comments":["This is definitely the best beef stew.","Good starter recipe with a few critical tweaks. 1. The original lacks flavor. Reduce the amount of liquid by at least 1/3, sub in wine for at least 1/4 of the remaining broth, add garlic, add a splash of soy or Worcestershire sauce. 2. Double, triple, or quadruple the recipe and freeze leftovers. Stew is not... More","Super yummy. It was hard for me to try another stew recipe after cooking my grandmother's recipe my entire life. This is so much better. My husband slurped up bowl after bowl. I doubled the recipe. I added a few cloves of fresh garlic. Finally, I heated batches up at a time adding frozen peas, corn, ... More","Truly is best beef stew ever! Husband's comment from now on you should only make stew from this recipe"],"Likes":187},{"Title":"BLUEBERRY PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/24/52/1/BTwby3XUTuaSEL4kDrbq_blueberry pie.JPG","Description":"I love the taste of mouth watering Fresh Blueberry Pie! Yum! This blueberry pie is probably the best I have ever tasted. I hope you will enjoy it, too! I do n... More","Comments":["Can someone who has used frozen blueberries in this recipe tell me if I should add them frozen or defrost them first? And do I need to add anything to prevent it from becoming soupy? Thanks for any help. I am a beginner when it comes to pies.","Delicious! Great recipe! ??","I made this for the first time using frozen blueberries. My husband said it was the best blueberry pie he had ever eaten. He particularly liked the hint of spice from the cinnamon - not overpowering, but just right. I was surprised at how firm the filling was, not runny at all. A definite kee... More","Made this for Thanksgiving and it came out great. Super easy too. I made my own crust using https://sallysbakingaddiction.com/baking-basics-homemade-buttery-flaky-pie-crust","I put the egg IN the pie"],"Likes":200},{"Title":"KITTENCAL'S 5-MINUTE CINNAMON FLOP BRUNCH CAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/recipes/77/39/7/kxel5d6sQouVmnsDO9BZ_brunch flop cake SITE-3.jpg","Description":"Except for the the milk and small amount in the egg, the cake itself has very little fat and using low-fat milk will keep the fat to a minimum, I have stated the egg as optional, ... More","Comments":["I used a Bundt pan and the topping cooked into the middle of the cake. 10 minutes left to cook added topping again and it turned out great. It was a big hit with my family.","I have no clue how this cake got 4 stars since so many of the reviewers had the same unsatisfactory results that I did. The name of this cake ended up being the result...a flop, unfortunately. It sounded so simple and tasty, but it lacked flavor and no one in my family liked it. The texture was rubbery/chewy and nothing lik... More"],"Likes":636},{"Title":"CRISPY GINGER BEEF","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/10/70/72/AlvyS5HBSIq7FZ88x8BZ_DSC_0138.JPG","Description":"If you like sweet, spicy, crispy Chinese food- this is for you. Adapted from a recipe I saw on \"Fixing Dinner\" with Sandi Richard.","Comments":["Amazing flavour. I used a Thai chilli pepper instead of chilli flakes and a whole red onion added to the recipe. The batter didn't stick to the beef very well and also the sauce was a bit runny. I'm going to try it again and thicken the sauce and flour the beef before doing in batter. I'l... More","Easy and delicious! One of my favs","Why couldn't I get the corn starch mixture to stick to the beef?","Easy directions and turned out great. I would have liked a little more sauce. What should I add so as to maintain the flavour balance?"],"Likes":193},{"Title":"GERMAN APPLE CAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/16/88/3/pic2OMYc0.jpg","Description":"This moist flavorful cake is an old standby for potlucks and picnics. My sister gave me the recipe after she got tired of making it for me so often.","Comments":["lessen sugar to about half","I added cup of crushed walnuts and 1 cup of sea salt caramel chips with a cinnamon coffee glaze. It was SCRUMPTIOUS!!!","I had this cake maybe 40 years ago and still have the recipe.. Then it was called Mrs. Stevenson's apple cake. If I am not mistaken you can serve this cake with a warm vanilla sauce on top when you serve it. I just usually usually use whipped or ice cream...……. Its on my agenda to make today!!!","I did not tweak it. I used the large yellow delicious apples. I'll add nuts next time. I put a little cinnamon in 2 cups of leftover buttercream frosting my daughter made for my retirement party. The batter was so thick I was worried it would be dry, but it was perfect!","I made this before reading all the comments and I added 2 more eggs. My eggs were from Target and they said large, but they were small. Anyway, I put some sliced almonds and dribbled a glaze for extra sweetness. Awesome,cooked 50 mins."],"Likes":225}]