[{"Title":"PERFECT TURKEY IN AN ELECTRIC ROASTER OVEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_611,h_344/v1/img/recipes/33/94/53/rcfkZBSm64Sg49Uxmfzg_roast-turkey-1.jpg","Description":"I never found good information on making a great whole roasted turkey in an electric roaster oven and thought I'd share my tried and true tips for making your holiday turkey mo... More","Comments":["I purchased a 20 lb fresh turkey, did not stuff it and did brine it the night before. I followed the recipe timing exactly with the 450 preheated and then cooked the bird for 30 minutes before turning down to 325 degrees. After 1 hr 15 min, the temp of the bird was up to 155 degrees with the probe just into the breast. ... More","I will start by saying I did not take the lessened cook time seriously enough, especially since I decided to drop my temp to 300 degrees rather than 325 after the initial heat blast (figured it would give the skin more time to crisp). By all accounts I was anticipating a 3.5 - 4 hour roast for my 24.6 pound bird... More","How many hours in a roaster for a 7-8 pound turkey??? Can i cook it at 250 degrees","my Nesco roaster has a fan. None of the recipes refer to or not to use a fan. This roaster was given to me, and this Christmas will be the first attempt for 16 people, I really would like this to go as uneventful as possible. Any info would be greatly appreciated.","Moistest turkey I have ever eaten!"],"Likes":237},{"Title":"CHEWY CHOCOLATE COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/50/49/t4GwMRVRQGGw9sJsHFE6_untitled-0360.jpg","Description":"","Comments":["How can I make this recipe printable","Great recipe. Used 1 stick of unsalted and half butter-crisco. Used cookie scoop to drop. Flattened great while cooking on pan.","The BEST cookies I ever made!!!","I made these with fresh ingredients and followed recipe exactly but when I baked them they came out flat. I don't know what I could have done wrong. Any thoughts anyone? Flavor was great. Will try to make filling and put two together for a cookie sandwich. Sorry to complain.","Salted or unsalted butter?"],"Likes":368},{"Title":"KITTENCAL'S CHOCOLATE FROSTING/ICING","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/recipes/89/20/7/Gd10moETkiN5jxAII7jk_choc frosting-1231.jpg","Description":"A wonderful frosting I have used for years made in very little time with perfect results and 100% better than any canned, this frosting is so good you will find yourself eating... More","Comments":["Great recipe and can make with ease. I baked two chocolate cakes over the weekend for birthday celebrations. I doubled the recipe and both cakes received raving reviews! Thanks for the recipe! It's a keeper!!","absolutely delicious frosting, I used half unsweetened and half special dark cocoa to richen and deepen the chocolate flavour, soooo good","Excellent icing I used a whisk instead of sifting and I used 2 % milk At the end just to the consistency you want!! I made it a lot easier and didn't screw it up! THANK YOU! Yummy...","As always, you can't go wrong with one of kittencals recipes. I have been using this recipe for a few years now. It's perfect as is for a 9X13 cake.","Perfect! Delicious and creamy and easy to spread on the cake! Yum!"],"Likes":529},{"Title":"CREPES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/18/41/0/mlUJhy1T3CFzP1eDMACA_DSC_0003.jpg","Description":"You can do SO much with a crepe. Make many different desserts.","Comments":["hi, I made these crepes yesterday and I did a little twist to them. I added 1 teaspoon of cinnamon and 1/2 teaspoon of vanilla. SOOOOOOOOO amazing!!!!!!!!!! I also added chocolate syrup on top.","I made these the other day and they were so delicious. I did double the recipe and tweak it a bit though. I added 1/3cup of sugar, 1 teaspoon of nutmeg, 1 teaspoon of cinnamon and a teaspoon of vanilla extract. Soooo good!!!","1 Tbsp castor sugar (quick dissolve, baking, superfine) 1/2 Tsp vanilla","Perfect, no-fail base recipe for crepes you plan to load up. If eating them alone, try tweaking it with T of sugar, some vanilla, and drizzle some syrup over it once it's done and gobble!","Has anyone ever tried freezing or refrigerating them to make in advance? Does it work? How long would it be good for? Thanks!"],"Likes":264},{"Title":"CARAMELIZED BAKED CHICKEN LEGS/WINGS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_575,h_323/v1/img/recipes/14/50/38/narIiRSK1QtMnGNiGvg1_017 caramelized chicken legs.jpg","Description":"Delicious! Yummy caramelized legs, kids love these! So quick and easy and no marinating required. Just prepare the sauce, pour over the chicken and pop in the oven... More","Comments":["We enjoyed this chicken -- we used wings-- which is delicious! Made as directed for a fun meal. Thanks for sharing!","Love this recipe. Have cooked it many times because it is so simple. Only change I have made it's too roll the drumsticks in brown sugar. It seems to assist the caramelisaton.","The taste is good but I didn't like how soft the chicken was. Next time, I will definitely drop the chicken in the fryer and crisp up the skin, then dry off the oil, brush on the honey soy mixture, and bake it at a higher temperature for a shorter time. Goes really well with steamed jasmine rice."],"Likes":331},{"Title":"ROASTED GREEN BEANS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/13/38/21/8JbamEgZSzOQgR13anhB_roasted-green-beans-2435.jpg","Description":"A great alternative to fast-food French fries, my family and friends love these as a snack or hors d'oeuvre. No matter how many I make, it's never enough!","Comments":["Quick, easy and delicious. Next time I will not leave them in so long... thanks for sharing. Made for Whats on the Menu? tag game.","So good and easy. Will be Making again soon. Thank you.","Both my family and I love this recipe. I added 1/2 Tsp of sesame oil, 1 Tsp minced onion, some finely chopped bacon. Cook as posted, and top with parmesan and french fried onions. Can never make enough!","Where do I find my collection, so I can print?"],"Likes":393},{"Title":"AWESOME BAKED PORK CHOPS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/34/49/9/ghJ53URWS2oYSG25Y1KA_awesome-baked-pork-chops-5351.jpg","Description":"These chops remain moist and tender, and the sauce is to die for! You probably have all the ingredients in your kitchen to make this! Serve these chops over rice!","Comments":["Great recipe. Followed the lead of others and did the following: 1. doubled the sauce as it's great over noodles, 2. skipped the breading altogether and just browned the pork for 3 minutes per side, 3. warmed the sauce in the pan I cooked the pork (one less pan to clean) and added jus... More","How to print","Nothing special. Easier to just fry in the pan at medium until done and make a nice gravy. It might help to specify the type of chop that works best for this particular recipe (boneless or bone-in? thickness? loin chop or center?); maybe that could make a difference especially with th... More","why go through all the trouble to bread and fry if your going to put in a soup mixture and bake for an hour and a half ??????????","AWESOME, yes that says it all. My daughter doesn't like pork chops but she loved this recipe. I used chicken broth instead of wine. Thanks for a GREAT recipe."],"Likes":313},{"Title":"OREO BALLS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/52/03/5/tVR1tbsS069Ay1YFTLIA_0S9A6681.jpg","Description":"My sister's co-worker brought these to a party and they were quite a hit. I don't know where the recipe came from originally. \"Bark\" is an artificia... More","Comments":["Can you use MegaStuf for this?? Thanks!","i love bts more than these"],"Likes":359},{"Title":"CHOCOLATE CHIP MUFFINS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_644,h_362/v1/img/recipes/93/26/5rgFIUpaQoail3AhnPrU_DSC01846.jpg","Description":"muffins","Comments":["Can I substitute blueberries for the chocolate chips?","Disappointed with the outcome. Not sure how to describe it but muffins just weren't good. Will not make again.","I just made these with my kids 3 and 1.5 years old! It was nice and easy and they turned out delicious and perfect! My kids approve 10 out of 10?? I'll be keeping this recipe for sure.","I'm not sure how people are having trouble with flavour. If you added the sugar you should be good. I just made these and eating one as I type this and they are great. I was worried about 400 degrees. But take them out at 15 mins and they were fine. I thought they were burnt but just a bit crispy on top. Soft inside with al... More","Being the queen of subbing - I used cashew milk, dark brown sugar, added a banana (reduced white sugar to about 1/8 cup), and for the second cup of flour, I used 1/2 cup whole wheat flour and 1/2 cup oats. Annnnd...I admit to hacking up one of the chocolate Easter bunnies instead of a bag of chocolate chips! Baked for 17 minute... More"],"Likes":418},{"Title":"PASTA WITH SAUSAGE, TOMATOES, AND CREAM","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/mpx/0278766_16x9.jpg","Description":"Delicious and satisfying... I don't remember where this recipe comes from, but it's a pleaser! Easily doubled. Also, works well with gf pasta and sausage","Comments":["Can I use a pasta sauce instead of crushed tomatoes? I do not like cooked chunks of tomatoes, though I will eat tomato sandwiches. I know that is weird.","I added sun dried tomato paste (two tablespoons) and it gave it an even better taste if you that were possible. Enjoy all.","Love love love this recipe. The first time I made it I doubled the sauce and I plan to triple the sauce next time. For me there just wasn't enough of the sauce for the pasta. With that being said I wouldn't change a thing about this recipe. Even my picky kids loved it!","Nothing to add here - perfect comforting pasta recipe you can never go wrong with."],"Likes":450},{"Title":"BUFFALO CHICKEN DIP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_607,h_342/v1/img/mpx/0278756_16x9.jpg","Description":"I got this Buffalo chicken dip recipe from a respiratory therapist at the hospital where I work. He brought it to a party and everyone asked for the recipe. I appreciate all... More","Comments":["You can substitute with Tabasco chipotle for a Smokey taste as well as add a few drops of liquid smoke. I also add real bacon pieces. (They come in a package)","Why does the picture look like there is pepperoni on it ? no mention of it anywhere.","Loved this dip! It was so good with the corn chips but also with carrots and celery!","Loved this dip! I used Greek yogurt cream cheese and Greek yogurt ranch to cut some of the calories, without losing flavor!"],"Likes":467},{"Title":"WHY-I-JOINED-ZAAR CARROT CAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/73/82/5/VIfjsbVmSubdAsbjKPXX_0S9A1692.jpg","Description":"On October 2, 2001, I discovered the Recipezaar Web site. I immediately joined so I could post a request for a recipe I had lost. In less than an hour, I had a repl... More","Comments":["i looked at several different recipes and they all call for baking in a 9 x 13 pan, yet a most of the pictures show a layered cake. Does using round cake pans affect the baking time at all. i am trying this recipe for the first time for a friends birthday party and would really like an answer... More","I have made this many times and love this recipe. I usually make this as a three tiered cake, and there is plenty of batter for that. I usually melt butter as a substitute for the oil, I also substitute pecans due to personal preference.","I was really disappointed in this. I love carrot cake and was excited to make this but it was just okay.","I made this for my mother on Mother's Day. Her favourite cake is carrot cake and she absolutely loved this! I didn't change a thing and the cream cheese icing was excellent as well. Thank you for the wonderful recipe.","I made this a few days ago and it is the best carrot cake I have ever eaten. As good as or better than the carrot cake from Rick's Desert Diner in Sacramento. Also, it is very easy to make."],"Likes":479},{"Title":"BEST GRAPE SALAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/35/45/0/hUQO62gcS7eJ9D6GCqmg_batch23-6576.jpg","Description":"I got this recipe from a coworker at the salon I work at. I didn't think it would be so wonderful and addictive! It's very creamy and sweet, and a great mix of flavors. It w... More","Comments":["This was delicious. Next time, I will cut the grapes in half. The toppings are unnecessary, in my opinion. If I were to add them again, I would chop the pecans very finely- like an ice cream topping. Thanks for the recipe!","How many calories in this recipe?","As Jennsniffer said on 9/13/2010, this is like crack in a bowl. I just ate 3 bowls full. And I had to make myself put it up....","Do yourself a favor and get an 8 oz. tub of whipped cream cheese. It's way easier to mix! I also toned down the brown sugar in the topping, but my grapes were pretty sweet all in their own. Great for a covered dish party!","Everyone is right. This is an excellent dish especially for a party because you can make it the night before!"],"Likes":475},{"Title":"SWEET CORNBREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_566,h_318/v1/img/recipes/83/62/5/qnro7mwZQrqZq5eNABv9_DSC_0959.jpg","Description":"My favorite corn bread. Sweet just the way I like it.","Comments":["My family loved this recipe... I reduced sugar to 1/2 cup, and they devoured this muffins... I've been asked to make them again very soon!","I used buttermilk and they were delicious.","It turned out very well loved it ?? With chicken Lazone the corn bread was sweet and soft just perfect","Lovely recipe. The cornbread is perfect, tender, light, flavorful and sweet. Thank you for sharing this quick and easy recipe it was wonderful. I used part of this for a chicken and cornbread casserole, it was the perfect choice. Made for What's on the Menu? tag game."],"Likes":373},{"Title":"UNCLE BILL'S WHIPPED SHORTBREAD COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_601,h_338/v1/img/mpx/0279010_16x9.jpg","Description":"These are very easy to make shortbread cookies. They are so good that they melt in your mouth, you hardly have to chew them. I have been making them for over 35 years.","Comments":["I see some of these in the picture look like they've through a cookie press..is that do able?","Absolutely delicious, melted in my mouth with a buttery flavor","Is there any way to make them a little 'sturdier', i.e. not so easily breakable? Also, when using jam or fillings (like M&M's or ...) is the dent and the filling added before baking or after?","It's okay. I feel there needs to be weight measures for this recipe since the cookies are so delicate. I've tried twice, and this time the cookies seem a bit greasy and both times they flattened out while baking instead of retaining their puffiness. Not quite the whipped, airy cookie I remember havin... More","I have made these as part of my Christmas cookie \"collection\" every year for the past three years. They are easy and delicately delicious! I follow the note of using jam in the thumbprint instead of using the cherries. Thank you so much for sharing this!! My whole family...and neighbors and guests and friends.... More"],"Likes":331},{"Title":"RESTAURANT TERIYAKI SAUCE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/13/37/51/IrDuUPieR1GP9vviVyiM_restaurant-teriyaki-sauce-133751_-5.jpg","Description":"You know the nice, sweet, thick Teriyaki sauce you get from your favorite takeout joint? Now you can have it at home.","Comments":["I've used this recipe for years and it's full proof. Just as a personal preference I use 1/2 c of water and 1/2 cup of orange or pineapple juice. Honestly, after many searches, this is the best recipe I've found. I usually double the recipe for leftovers.","Sorry - didn't mean for this to post repeatedly!","I love this recipe! Instead of 1 cup water, I add 3/4 c. water and 1/4 cup cherry juice (sometimes pineapple juice, but I'm on a cherry juice kick lately...) plus I add a small amount of molasses, black pepper and a pinch of cayenne!","I love this recipe! Instead of 1 cup water, I add 3/4 c. water and 1/4 cup cherry juice (sometimes pineapple juice, but I'm on a cherry juice kick lately...) plus I add a small amount of molasses, black pepper and a pinch of cayenne!"],"Likes":327},{"Title":"BASIC PANCAKE MIX","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/48/63/5/hQThWlKpROi0fltE5p1r_0S9A8686.jpg","Description":"Say goodbye to Aunt Jemima! Once you taste these homemade pancakes, I think you'll agree they're much better than the boxed kind! Add a bit of vanilla o... More","Comments":["Simple, fast and delicious every time. Highly recommended","I was ready to make this recipe until I looked at the nutritional value. My husband now has to be on a low sodium diet due to a heart attack. The sodium content in this recipe for ONE serving (approx 2-3 pancakes) is practically 1/2 of a healthy adult's daily limit (which is 1200-155 mg/d... More","Can I make this pancake recipe with splenda as I am a diabetic.","I substitute club soda for the milk. The pancakes come out so light and fluffy.","I've made pancakes before & I add some Sour Cream & Lemon Juice/Orange Juice/White vinegar the acid interacts with the Baking Soda & makes them fluffier.I've also placed the batter in a small baking dish made in the oven 325-350 depending on your oven & made them that ... More"],"Likes":324},{"Title":"THE BEST EVER WAFFLES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_615,h_346/v1/img/recipes/31/75/0/OAoTlkKTayFGct4goFYg_BEW 8 - final_6.png","Description":"Every Sunday morning, my mom and I used to get up early and make these wonderful waffles. This recipe has been in the family for years, and I will definitly be passing it down to my chi... More","Comments":["This recipe is fantastic! I added 1 teaspoon of vanilla extract. Beating the egg whites takes time but makes for super fluffy waffles. I will use this recipe from now on!","Loved this recipe. I have tried others but really like how light these are. I added a teaspoon of vanilla. My husband loved them also!!","This is the best waffle recipe ever!","This, in fact, is the best pancake recipe there is. You can even adapt this to make gluten free pancakes. Absolutely fabulous.","I don't own a waffle maker, think these would work in a silicon waffle \"pan\" and just bake them in the oven? (DYING to use these new waffle pans!)"],"Likes":529},{"Title":"MOIST AND DELICIOUS BANANA BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/25/24/49/x1Pip07QVqPFUEQdEXQ8_untitled-0344.jpg","Description":"This is the best banana bread I have ever had. I buy really ripe bananas just so I can make this :-) Got the recipe years ago from my friend Rachel. We used to b... More","Comments":["Perfectly moist cake. I reduced the sugar to 1 cup... Could reduce it further since ripe bananas add their own sweetness.","I usually use an egg substitute (whisk together 2 tablespoons of water, two teaspoons of baking powder and one teaspoon of oil-I use canola, that's only one egg though, double it for this recipe) and almond milk to make them vegan. And u always add extra bananas if I have one or h... More","Added 1/2 cup chocolate chips , 2tbsp cinnamon sugar and substituted 1/2 cup of brown sugar"],"Likes":242},{"Title":"CHICKEN TIKKA MASALA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/25/58/7/NxufAx8GTP2G3zUhgxyc_THE FOOD GAYS - CHICKEN TIKA.jpg","Description":"This recipe appeared in the Chicago Tribune on 4/17/02. The dish has turned out to be extremely popular but be advised that it's very spicy when the recipe proporti... More","Comments":["This is the best meal I have made in a long time. Flavors on point! Dairy hates me so I used coconut milk yogurt, olive oil for butter, and full fat coconut milk for the cream. Uses jalapeños with the seeds and the spice was very hot in the perfect way. Thanks!","This is very good! We like it hot. Double the sauce, use jalapeño with seeds. Chop jalapeño and garlic in chopper. Use lite coconut milk, half and half or nonfat evaporated milk to save calories. Grill in larger pieces to save effort of skewing.","Girrrrl this recipe is amazing. I've made this several times exactly as written and it is absolutely just as good as our favorite Indian restaurant. The last time I made it, I did not use the skewers since I broil the chicken in the oven. Saves me some time and didn't taste a difference. I crave this... More","Absolutely wonderful! Will make again and again!","Made a LOW FAT version of this for dinner last night and everyone loved it! Used 2% low fat Greek yogurt instead of regular and used 2% milk instead of cream, thickening things up to cream-like consistency with 1 Tbsp of cornstarch. If \"Ground red pepper\" is supposed to be \"Cayenne red... More"],"Likes":409},{"Title":"CROCK POT LASAGNA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/21/70/6/q9xSCChZQNSujJG2TNsF_lasagna 2 (1 of 1).jpg","Description":"Easy and good!!","Comments":["I'm guessing cottage cheese is used instead of ricotta because it has more moisture, which the noodles will soak up as they cook. I'm going to give this a try but also mix in some ricotta for the flavor. Wish me luck!","So why cottage cheese and not ricotta? Tell me more.","It does not say when to add the cottage cheese?","As a non-chef type person, the slow cooker is my friend. This is exactly the reason I Love, Love, Love, this site. I will check back in when I have completed the trip to Lasane Heaven.","Can you substitute out the cottage cheese with ricotta or ricotta/mozzarella mix?"],"Likes":438},{"Title":"TUNA CASSEROLE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/13/63/0/3pEsJWu8SFW2FFJeVFVX_TC 4 - final_2.png","Description":"Good and creamy, got it from my bosses wife who got it from her mother-in law.","Comments":["Love it! Everybody had seconds and gobbled it up (except my 6 yo, who hates cheese). It was positively delicious! I did double the tuna and cheese (and added a little salt after reading some of the comments). But that is just preference, as I love fish and cheese. For once, I will actually ha... More","Excellent. I omitted the mushrooms.Used Grated Parmasean in the mis and fresh grated on top","This was one of the best tuna casserole recipes ive used. Def a keeper.","I doubled the recipe and added Thyme and a little Rosemary. I also, toasted Panko Bread crumbs for the top as well as parmesan cheese sprinkled on top of that and it was DELICIOUS! I used a little extra cheese as well.","Can you use canned chicken instead of tuna?"],"Likes":385},{"Title":"EASY PEEZY PIZZA DOUGH (BREAD MACHINE PIZZA DOUGH)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/35/80/5/f8tRhe2XSlutilxCgkeM_easy peezy pizza dough SITE-3.jpg","Description":"This is a really easy way to make a good \"yeasty\" pizza dough! As well as using this recipe for when I'm making pizza, I also use it for when I'm making a... More","Comments":["Hmmm. \"Dried Granulated Yeast\"?? It'd be nice if this was a bit more specific. I'm admittedly somewhat new to bread machines, but I've made a wide variety of different bread products with mine, and I know this much . . . whether you use regular or rapid rise yeast, both of which are \"dried... More","Used to mention this can make two large crusts. Don't change a thing just perfect recipe. Make sure to par bake as recommended but I have often skipped the rising again in a bowl after out of bread machine and it's fine.","This recipe works perfectly. My family begs me to make it on a regular basis. I put just sauce and cheese on it and top it with Penzys Italian sausage spice- delicious! I double the recipe when our whole family is eating because there are 6 of us.","Great dough recipe.","I've been baking for over 50 years. Have made many pizza doughs. Never made one in my bread machine. Holy moley! This is the best pizza dough. Made 2 nice pizza's and one small calzone. Next time I need to cook a little longer to get crust crispier. Might try beer next time instead of wat... More"],"Likes":294},{"Title":"CREAMY GARLIC PENNE PASTA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/43/02/3/Z9lYSjJT86fzUAlIWJdH_0S9A6422.jpg","Description":"This is a delicious, super quick side or main dish. I got it from the back of a pasta box and it is yummy!","Comments":["for the Parmesan ...will it turn out ok with the grated kraft kind or should it be freshly grated?","Easy, and delicious. A family favorite!","After making sauce with full 16 oz bag of penne, there's not enough sauce. Double to sauce or half the pasta--We also added a couple dashes of cayenne pepper for a little kick!","YUMM! I hadn't even eaten a full plate because I made this for another family but the little I had was very good! Added some cooked grilled chicken bites in and some Cayenne pepper for a little song but very tasty as is. Definitely a repeat recipe!!"],"Likes":370},{"Title":"HOMEMADE CREAM OF MUSHROOM SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/26/41/91/MDKBzYNsS62V9CAFWXlt_cream of mushroom SITE-3.jpg","Description":"Forget the canned stuff, this is a LOT better and yet easy to make, too!","Comments":["Insane simple! Easy to double, (highly recommended).","Added fresh thyme! Perfection.","Haven't reviewed here for so long! Gosh, I'm glad I reviewed this one, although; no need to as there are so many positive reviews. I followed this one to a \"tee\" ~ except I added some fresh thyme. Beautiful recipe, full of deep flavors, and very smooth in taste. Thanks for adding th... More","The canned version may be mmm mmm good, but this is OMG good! Added bonus, it's quick and easy!","This soup was delicious! I did not add the flour as the soup thickened enough when blended up. I did add some Marsala to the last few minutes of simmering and I added heavy whipping cream to individual bowls so that I can freeze the leftover soup. I used Chanterelle, Portobello, Oyste... More"],"Likes":233},{"Title":"MOIST & DELICIOUS BANANA NUT BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/48/66/41/aB9Ar2MzTy2CIyxoINma_b.jpg","Description":"I got this recipe when I was 12 and have used it for the past 33 years and haven't found one better! My son used it when he was 12 at the California State Fair and won a... More","Comments":["Loved this recipe so good","I have no baking soda. Can I use something else or eliminate altogether.","My solid, \"go to\" banana nut bread recipe. I like it sweeter so I add 1 -2/3rd cups of sugar and for added crunch a cup of chopped walnuts. 50-60 minutes in glass loaf pans at 325° and you're in business. Thanks for sharing @sktaggart!","This is the second time I've made this bread in a month. My family absolutely loves it! The first time I made it, I added 1 cup of semi-sweet chocolate chips and reduced the sugar to 1 cup. The bread was delicious and very moist. The second time I made the recipe exactly as it calls u... More","I would like to make traditional German sweet bread. I made it once years and years ago but I can't remember the recipe. It looks similar to banana bread without nuts."],"Likes":200},{"Title":"BRUSSELS SPROUTS IN GARLIC BUTTER","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/21/76/1/rZ8Gw5E2RTqeRLHp8cWT_DSC_0314.JPG","Description":"This is a recipe from Joy of Cooking... totally changed my mind about Brussels Sprouts! It's imperative that you use fresh sprouts, the texture would be way off with the ... More","Comments":["Do you use frozen or fresh?","Delicious, and I don't remove the garlic.","Pretty perfect","Good recipe but we still do not like Brussels sprouts","Excellent"],"Likes":287},{"Title":"POVERTY MEAL","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/27/52/0/aP03XEPnTTadErA9YpVZ_povety meal.jpg1.jpg","Description":"When I was a child, my family used to eat this at least once a week due to the fact that it is inexpensive and a little goes a long way. We also added fresh herbs o... More","Comments":["I just add 1 tsp. of Italian Seasoning mix from my local bulk store. We love this. Simple and quick. I find ground beef for under $2/pound at my local asian grocery store - making this a true poverty meal.","What a insult!!!!!!!! POVERTY??????","We use to make this all the time when I was growing up (I am 70) and my kids were growing up. We called it American Goulash or Hamburger noodle casserole. You can add and subtract items, depending on likes and dislikes of family. Sometimes I added chopped, cooked celery, a... More","This is American Chop Suey!","Anyone that said this was bland doesn't know have much imagination because the addition of your favorite spices, some Worcerstershire sauce, maybe some crushed red peppers, a small can of tomato sauce and your favorite cheese(s) makes this a great homemade \"hamburger helper\" typ... More"],"Likes":532},{"Title":"MAMA'S SUPPER CLUB TILAPIA PARMESAN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/53/91/4/nPLRF7J7TgGEGJdTTv9C_paremsan-tilapia-15-minute-3524.jpg","Description":"You asked for it. Here it is. Thanks so much to MaMa's Supper Club. Wish we could all go there.","Comments":["This was good, very good! I think the topping may be better on chicken, will have to try that next time!","Tilapia and Orange Roughy are not worth eating. Wonderful recipe otherwise.","I have been putting extra panko all over the top so the mayo and butter mix doesn't slip off. it bakes up into a firm(ish) topping that way. We LOVE this recipe!"],"Likes":497},{"Title":"STEAK MARINADE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/66/64/8/FcAlimStTn6PghXzHPp7_steak-marinade-9713.jpg","Description":"This is a variation of a recipe I got from a book that came with my BBQ. I used strip loin steaks and it was fantastic. You don't need any steak sauce to go with it.... More","Comments":["I'm keeping this close at hand. It imparts the right amount of flavor without being overpowering. Thank you so much for posting this marinade!!","We got some steaks that weren't the best quality. While I didn't have any, DH said this marinade had good flavor and he wouldn't have been able to eat those steaks without it.","Made the marinade exactly as written. Marinated strip loin steak for 1 hour (All the time I had). Cooked the steak to rare-medium rare. Delicious! Will use this recipe again, soon.","I e used many mustards with this, but our family winner is wasabi horseradish mustard. Gives it that little kick! We make a simple grainy mustard cream sauce to compliment it:). (Grainy Dijon, heavy cream, and unsalted butter: salt and pepper to taste, and we enjoy a squeeze of fr... More","This has been a go-to in our house/cabin/tent....??. I've also used it on moose. Works great! One tweak we often enjoy is swapping out yellow mustard for wasabi horseradish mustard.....it's got kick! And who peppercorns sometimes:) I recommend this, absolutely!"],"Likes":331},{"Title":"ROMANO'S MACARONI GRILL ROSEMARY BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/64/44/6/lJvvzgfDRkuHBY4pgYux_RosemaryBread2.jpg","Description":"This is an attempt to immitate the excellent bread that is served in the Macaroni Grill Restaurant.","Comments":["Thanks for the easy and delicious recipe. My question is what I need to do to completely cook the bread - it.was nicely browned and the outer layer was lovely but the interior was doughy. I kept increasing the baking duration by 2 to 3 minutes twice but it didn't help. Should I decrea... More","What changes do you think I should make if I'm baking this at high altitude?","Do I add the yeast and sugar to warm water? :)","What changes do I need to make if I'm going to use bread flour. TIA!","My bread comes out with a cakey texture rather than a bread like texture. Is this because I did not develop enough gluten or is it part of this recipe?"],"Likes":278},{"Title":"KITTENCAL'S CHICKEN CRESCENT ROLL CASSEROLE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/recipes/78/81/4/PDqQz12ERbGnYcExq36x_kittencals chicken crescent roll casserole 78814-7.jpg","Description":"This will also work great with turkey; if you do not have chicken breasts, then use any leftover cooked chicken. If desired you can fill the crescents just with the filling mix... More","Comments":["I love a good Kittencal recipe! The only thing I did different was skip the sauce on the bottom part because other reviewers said it made the dough soggy. Overall a great recipe, everyone enjoyed it!","I made this for dinner yesterday and it went over very well with my family. I didn't make any changes and I did like it. However, I think the next time I make it, I will make it in a ring shape and try and incorporate some Dijon mustard in the chicken mixture, and maybe some relish as well. Some thing with tang to mix well ... More"],"Likes":494},{"Title":"CARAMELIZED BUTTERNUT SQUASH","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/10/66/27/FTCiWV9HR6i7yQ0v4WsG_butternut1 (1 of 1).jpg","Description":"This is a delicious butternut squash recipe from Ina Garten / The Barefoot Contessa. We really enjoy this during the holidays. It is best when the squash i... More","Comments":["Amazing way to make butternut squash. It was very tender and delicious! Will definitely make again!!","This is a truly amazing recipe. The squash was perfect and not too sweet. I tossed it with some angel hair pasta, cotija cheese, and fresh parsley to make a quick lunch and it was so so so good!"],"Likes":278},{"Title":"CROCK POT CHICKEN TACO MEAT","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_565,h_318/v1/img/recipes/49/57/EhLd4qFRjS9WEGLpDFFX_crockpot-chicken-taco-meat-ww-02224.jpg","Description":"I adopted this recipe from the Recipezaar account, and I'm so glad that I did. This has become a regular addition to my OAMC and I have created a public cookb... More","Comments":["This was SO good! I love how healthy it is, easy to make, and it let me make a variety of taco themed lunches all week.","Would this recipe work with pre-shredded chicken?"],"Likes":301},{"Title":"PERFECT BASIC WHITE RICE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_627,h_352/v1/img/recipes/13/73/64/4mN6Zjh5SNmTNKFsca1D_0S9A2673.jpg","Description":"You do not need to be afraid of cooking rice again! lol Real rice is so much better for you than instant. So here is a basic recipe that will have you cooking rice like a pro! Check out the options too! ... More","Comments":["I don't know where I first got the recipe for cooking rice by this method, but it is what I always use. I agree with the comment that it should cook for 20 minutes and then remain covered for an additional 10 minutes before fluffing with a fork. It guarantees that all moisture will be absorbed. Using vinegar is a new twist for ... More","This has been my traditional rice recipe for decades, however I've never tried vinegar before and found it to be superb! I leave out the butter for calories and sodium sake and always start with cold water and bring to a boil because of minerals in the tap water. A shortcut is to use an electric hot water pot to quickly... More","I will make this rice every week??It is delicious.. Thank you so much for this amazing ?? recipe...","I have made this several times now and it always comes out perfect! Thank you","I dreaded the thought of even thinking about cooking rice. You have given me the freedom with this recipe to not fear cooking rice any more... Thank you so much for sharing this??.. I used a touch of Italian dressing for taste and the family loves it"],"Likes":170},{"Title":"CHOCOLATE! CHOCOLATE! CHOCOLATE! BUNDT CAKE WITH CHOCOLATE GLAZE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/27/14/4/YSWmkLQtRpinfqX46cc0_1choccake3.jpg","Description":"Need I say more...CHOCOLATE! Decadently rich and moist. Add a scoop of vanilla ice cream and you're in Heaven.","Comments":["This cake was moist, sweet and just what I was looking for. I didn't make the glaze from this recipe, but used one from allrecipes. (Satiny chocolate glaze by: Ginger) That glaze ended up being exactly what I was hoping for: Soft, pliable, stays moist and won't absorb into the cake. It was gr... More","This is my second time trying to make a dundt cake and it came out beautifully! My lovely man told me it was so good! He kept eating some every time he walked passed it. It was so easy to make and if you love chocolate you have found THEE recipe! This is going in my cookbook f... More","Oh my gawd, this is so good! I bought a new bundt pan, so I've been trying out all kinds of cake recipes. This one was a huge hit and so easy compared to a lot of the other ones I tried. I've completely destroyed my calorie limit for this cake over the past few days... worth it.","why do you have 10X after the powdered sugar? Are we to use 10 cups? (not likely)"],"Likes":386},{"Title":"ROASTED CAULIFLOWER & 16 ROASTED CLOVES OF GARLIC","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_566,h_319/v1/img/recipes/10/62/51/D9l5R78tQDajxdSnMhEO_DSC_1005.jpg","Description":"I find it totally amazing, that children and men ALL LOVE THIS RECIPE! As for the Female of our species we just love this for the flavor and the health b... More","Comments":["WONDERFUL! I keep coming back to this recipe time and time again. I have made it many times. Everyone loves it. Thank you!","I followed your recipe except I roasted twp whole garlic bulbs first in a little oil in foil. I squeezed the roasted garlic out of the bulbs and mixed it with the oil and spices. That way you do not have to worry about burned garlic.","This is amazing! The tastiest cauliflower I have ever had. Can't cook it any other way now. The roasted garlic and rosemary flavour just goes so nicely with the cauliflower, and the roasting gives it the nicest crispy on the outside but juicy inside texture.","Followed recipe but was leery of 30 minute cooking time, so tried a sample after 15 minutes. Added two more minutes, then liberally sprinkled breadcrumbs and baked another 4 minutes. At 450 oven, bread crumbs were dark brown. Took them out just in time. BTW, added a couple of ... More","But why?"],"Likes":377},{"Title":"BEST EVER TUNA NOODLE CASSEROLE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_581,h_327/v1/img/recipes/19/95/79/uSbouJ4nROuPARyjT7i9_0S9A6306.jpg","Description":"This is a recipe my entire family loves! It's requested at least once a week and for Birthday suppers. The recipe came from the mother of one of my childhood friend... More","Comments":["This is a fantastic recipe! My family loved it and I was disappointed there were no leftovers for lunch the next day. So creamy and delicious! I didn't have celery on hand so substituted 1 tsp of celery seed.","I fried the celery/onion in a little butter, like to use a can of half cream of chicken/half cream of mushroom soup, also add curry to taste in cream mixture before adding tuna. Mix in 1/2 cup toasted almond pieces: top with crushed plain potato chips.","While this has good flavor I added some things. First I added 1&1/2 cup peas and 1 cup carrots chopped fine, I've never had a tuna casserole without them. Second I doubled the tuna along with doubling the Mayo, chicken noodle and milk. Third I put in a full 16oz egg noodles. Usually I... More","Pretty good! Had to improvise a little bit because we didn't have enough milk, so we added an extra can of soup and some Greek yogurt.","What sz casserole dish and a quarter what of cheese? And really only 6oz of noodles?"],"Likes":207},{"Title":"BUTTERMILK PANCAKES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/66/24/1/CiPfUQpLROOV2Bedo79z_buttermilk pancakes 66241-7.jpg","Description":"This is our favorite pancake recipe. I got it from Williams-Sonoma site. Try it.. It's great.","Comments":["Used this for waffles with fried chicken, added some brown sugar to it not sure if it made a difference but I wanted it a bit sweet everyone loved it","These were delicious. We will definitely make again.","Wife wanted some Buttermilk Pancakes and saw this recipe. These were great. Did a full tsp of vanilla instead of the 1/2. This will be my go to for pancakes","Perfect way to start a sunday, light and delicious!"],"Likes":271},{"Title":"CHEESY HAM AND POTATO SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_565,h_318/v1/img/recipes/26/21/40/3KXxfPS6Tn6SWBAG5PA1_DSC05057-2.jpg","Description":"Comfort soup at its finest! I usually make this to use up leftover ham. This is easy to adapt with other ingredients. I don't put celery in mine. I have added g... More","Comments":["Fantastic soup! I made as written and used ham stock and it was absolutely delicious! I also used 1 bag of Simply Potatoes diced potatoes from the refrigerated section in the grocery store to save some of the prep work and they worked perfectly! Thank you for a great recipe.","This was delicious! I made several tweaks. I used a mesquite ham steak, a mix of red and Yukon gold potatoes, a whole onion, two carrots, two celery stalks, a leek, added 6 cloves of garlic minced, fresh dill and thyme, and a generous pinch of red pepper flakes. I cooked it all up with so... More","this might be the best soup I've ever had. Made with leftover brown sugar and pineapple ham","Does anyone know what the serving size is in cups?","Can I make ahead and freeze this recipe"],"Likes":201},{"Title":"BAKED CHICKEN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_562,h_316/v1/img/recipes/11/15/14/3W2VXKjT3Org0jErL4KQ-Baked-Chicken---111514-2.JPG","Description":"This chicken recipe is so easy, I hesitated in posting it. But I couldn't find it posted here, and it's so good, I thought I'd share it. It's my favorite way to bake chic... More","Comments":["First off lets start with \"rinse the chicken\". A big no-no. Don't wash raw chicken or any other raw meat for that matter. Other than that a quick easy and tasty dish.","Simple, tasty. I would add more seasoning salt next time.","Amazing! Best chicken I've ever made. In addition to the butter, I used a series of spices including seasoning salt, black pepper, oregano, lemon pepper and garlic powder.","Wow! I was hesitant making this one... I made it tonight. Wow! Very good. My boyfriend said \"Wow! , I would buy this in a restaurant. \" \"Wow\" Lol! I thank you.... This will be a go to meal weekly and so easy. By the way my Autistic 4yr. old even ate it and she doesn't eat meat. Happy mom here."],"Likes":311},{"Title":"AMAZING CHICKEN TORTILLA SOUP!","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/10/82/31/rpAxVfyiSNOekT4EPhaW_chicken-tortilla-soup-7654.jpg","Description":"This recipe has been a huge hit with everyone who has ever tried it. We make it almost weekly, and the leftovers are eaten immediately. It is also very healthy! It is a l... More","Comments":["Made it - substituted a roasted Poblano for the green pepper and added a tablespoon of NM Red Chile powder. Next time intend to use roasted corn as well . . .","Made this last night. I used a rotisserie chicken(shredded) and extra jalapeno for more spice. Turned out fantastic! Will make again.","really good! i don't care for regular corn kernals in my soup, so i sub hominey (yellow or white is fine) for a more \"traditional\" flavor! also, i subbed the more flavorful... and less DRY... thighs for the chicken breast. those are the only two things i changed... because YUM!","Nutritional value (i.e., calorie content)?","I enjoyed this soup. Relatively quick, easy and made with ingredients that I always have on hand. Made exactly as written with the exception of substituting a can of Rotel for one of the cans of tomatoes. Skipped the tortilla chips. Reversed the cooking time. I cooked the whole breast... More"],"Likes":265},{"Title":"OLIVE GARDEN PASTA E FAGIOLI SOUP IN A CROCK POT (COPYCAT)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/31/71/7/SDnPxcQbRBSGK2q5dAkJ_COGPFS 4 - final_2.png","Description":"This tastes exactly like the pasta e fagioli soup at the Olive Garden. Wonderful! Husband loves it!","Comments":["My family loves this soup - I make the whole recipe on the stove because my crockpot is too small - and freeze half for another time. I sauté the aromatic vegetables, along with some about 3 cloves of minced garlic, then remove from the stockpot, then I cook the ground beef (sometimes ... More","WAY too much. Half is good amount. Use more spices and some garlic. Also, more liquid, this came out very \"stew\" like as opposed to soup. Still good base to tweak over time. Also, for this full recipe, it took longer than 7 hours to cook to get the vegetables tender and I used less cele... More","I've made this several times in a 8qt Instant Pot. (6qt is too small) Here's my tweaks: Substitute 24 baby carrots for 3 regular carrots. Substitute 1Tbs Italian seasoning for oregano and parsley. Reduce pepper to 1tsp. If you like using the frozen chopped onions, 1/2 bag is the right amount.... More","I have a 4qt. slow cooker, so i halved the recipe. Nope. Still too small. For only half the recipe, you need at least a 6qt. slow cooker to have no overflow. HALF RECIPE = AT LEAST 6QT. SLOW COOKER!!!!!!","I made this for Super Bowl Sunday. There are a couple things I would change the next time I make it and there will definitely be a next time! The recipe is perfect as is. The soup was a huge hit and delicious. Next time I would use smaller and fewer noodles. I cooked the noodles s... More"],"Likes":316},{"Title":"PUMPKIN SPICE BREAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/71/73/2/picZpf6jk.jpg","Description":"Hooray for fall! We love this pumpkin bread recipe--especially when the slices are slathered with a generous spread of cream cheese. Makes two loaves, so freeze the ot... More","Comments":["Everyone raved about this cake! Making more now for Christmas gifts.","can I use caned pumpkin instead of the puree","Curious. Anyone tried to make this pumpkin bread in a bread maker machine? If so what kind of modifications did you try? TIA Theresa","I am not a big fan of pumpkin pie of pumkin flavoured anything but, I had roasted left over some leftover jack-o-lanterns and they grossed an obscene amount of puree, which I had to use up. I have to say that I am a convert!! Goodness - this is loaf is delicious :) It's so moist and y... More","Didn't tweak ANYTHING!!! This wonderful bread dosen't Last at ALL!!!!! I Always want to give em away as gifts for fall but they almost never make it . We Eat them all!!!!"],"Likes":349},{"Title":"AMAZING CHICKEN MARINADE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/29/59/8/picSBbuz8.jpg","Description":"This recipe came from Allrecipes (Ruth Crickmer). My whole family loved it even though it cooked too fast. The original recipe said 'high heat' on the grill, ... More","Comments":["Excellent marinade! Chicken was so juicy and tender with absolute amazing flavor! My entire family loved it. Definitely our new favorite. Thank you for sharing!","This is my new go to marinade. My husband and son loved it!!! I marinated for just over 24hrs so tender and juicy! A-M-A-Z-I-N-G!!!! My husband just raved about it!","If you can not grill, than I would broil. Baking will tend to dry it out"],"Likes":307},{"Title":"MY NO ROLL PIE CRUST","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/51/53/7/5AM5mA39Qde8zKbbDd0w_NRPC 7 - final_4.jpg","Description":"The only pie crust I will use anymore. Its flaky and slightly sugary and oh so easy to do. Note: due to some major discrepencies please use a good quality oil, p... More","Comments":["The recipe does not say what size of pie plate she used. And Metal or glass ? Any ideas?","What kind of oil do you use ??","Do you need to prebake this before you fill it for a baked pie like apple pie?","Way too salty....and very crumbly, ...","I am so happy with this recipe. It really was so simple to put together. I made it for a banana cream pie. The slightly salty-sweet crust really complimented the sweet custard so well! Thank you so much for sharing."],"Likes":284},{"Title":"ROASTED BRUSSELS SPROUTS!","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/56/10/3/c6Zrly8oQ8OPBImWQBDz_BS 5 - final_3.png","Description":"I got this from the Barefoot Contessa Cookbook. SO good.","Comments":["My kids really like brussels sprouts – I'm not sure where they got that from because I have never been a fan. I tried these when they came to visit and they were actually very good! And so easy to make!","Can be eaten cold!!!! I have been telling everyone about these. This is my goal to easy vegetable even young children will eat and finicky adults. Just don't tell them until they take first bite.","Use fresh lemon juice"],"Likes":320},{"Title":"TRADITIONAL IRISH SHEPHERD'S PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_599,h_337/v1/img/mpx/5458755_16x9.jpg","Description":"Posting this per a request. I've said it once and I'll say it again there is nothing Irish about Corned Beef and Cabbage, but Shepherd's Pie has always been and still is a ... More","Comments":["I've been making this for a few years now and it is fantastic! The only change I ever seem to make is adding extra carrots and peas in an effort to get veggies in the kids.","Made this for dinner tonight and it was delicious. Had it with a glass of good red wine.","Someone needs to explain to me why this is called Shepard's Pie. Traditionally Shepard's Pie is made with lamb...which is how it is made in our household. Sheep were cared for by shepard's. Shepard's do not take care of cattle. Traditionally they would have moved the sheep around from meadow to m... More","Can I use sweet Potatoes instead","Great recipe...my husband does not like wine. What should I substitute for that?"],"Likes":271},{"Title":"EDNA'S APPLE CRUMBLE (AKA. APPLE CRISP)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/82/92/5/picnqIY8t.jpg","Description":"A simple and easy to make but oh so yummy recipe. Known as Apple crumble in the UK and Apple Crisp in the US","Comments":["This was delicious! I did put a bit more cinnamon, white sugar and lemon juice mixed with some flour on the apples first. It allowed the apple juice to thicken. So good!","Excellent!!!","I used harvest crunch raison/almond blend, most excellent, and chocolate whipped cream as topping, so deli :)","Best crumble recipe I've tried, and I have tried a lot of them over the years. Easy to make and works with any fruit, I have used any frozen or fresh fruit I have on hand. I double the ingredients as we like a lot of topping, my husband said he wants cookies made from the topping ... More"],"Likes":355},{"Title":"TACO BELL QUESADILLAS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/78/19/4/A1LIV5kGTCWalhYNPucT_TBQ 7 - final_5.jpg","Description":"I used to love these when I was younger, I could eat two in one sitting! I haven't had fast food in a year or two, but these taste like I remember Taco Bell's quesadillas ta... More","Comments":["What kind of jalapeños are used? Pickled? fresh?","Can I replace sugar with any other kind of sweetener? Or has anyone made it with no sugar at all","Fantastic! I used ancho chili powder to tweak it a little bit but it was awesome and gave the perfect sweet Heat! I used a little on the side to dip it in as well LOL","I make this fairly often. One of my favorite recipes. You will definitely want to double the recipe if you're cooking more than a couple quesadillas.","I love this recipe! I've been making it for years.. it is sooo good and easy to remember! I can just throw in some mayo and dash in the ingredients and it is perfect! Only changes I make is I add extra jalapenos and skip the sugar because I prefer it extra spicy!"],"Likes":234},{"Title":"SLOW-COOKER BEEF SHORT RIBS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/32/14/7/68lxMPE1QECpWW2Lb243_instant-pot-boneless-short-ribs-3280.jpg","Description":"You won't believe how good these ribs are!!! I think we could have these every other night with no complaints! They're YUMMY!!!!","Comments":["Can I print","This recipe looks good. Due to the richness of the meat I am thinking the butter could be eliminated? Also do you think this can be done with a chuck roast? I have taken oxtails and short ribs and browned in oven to render some of the fat. Any comments?","These short ribs made exactly as recipe listed were very tender and flavorful. Served with mashed potatoes, fresh green beans, and the sauce meat was cooked in was a total winner!!","Very easy recipe. My whole family loves this dish.","Awsome flavor! But I too found that the long cook time was a bit excessive and turned out an extremely dry final product. I can accept that my crock pot might have lost its calibration due to age. However, all of my other recipes seem to turn out just fine. Perhaps you might add a heads-u... More"],"Likes":250},{"Title":"SWEET POTATO CASSEROLE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/mpx/0278322_16x9.jpg","Description":"This is a great holiday side dish","Comments":["If you are making this ahead of thanksgiving day do wrap it up and put it in the fridge and cook on thanksgiving day?","Can you substitute evaporated milk for regular milk?","Instead of milk, would evaporated milk work?","This receipe says margarine - does land of lakes butter work as well?","I deglazed the candied nuts with a shot of Fireball whiskey and it was excellent."],"Likes":214},{"Title":"PORK TENDERLOIN","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/54/08/OrnQm2rTLydu1qMfs7L5_0S9A6025.jpg","Description":"","Comments":["I have done the same basic recipe with all of the same ingredients except I've used crushed rosemary instead of thyme. Pork loin is my favorite meat. Next time I will try thyme.","A small pork tenderloin is an easy but special meal for two and two larger tenderloins make an impressive company meal. This has become my go-to recipe in either instance. Prep is easy and the longer the wrapped tenderloin remains in the refrigerator the more the flavor of herbs and g... More","Delicious!","I cooked mine in a conventional/toaster oven. It was tender and well seasoned.","This was absolutely delicious - tender, juicy and oh, so flavorful! Also very easy to make. I marinated it for about 6 hours."],"Likes":256},{"Title":"AMAZING PUFF BALLS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/53/87/8/IlABV4fQ2Wt6smSS0Zar_DSC_0065-2.jpg","Description":"These are wonderful! My cousin brought them as an appetizer for Thanksgiving dinner one year, and I got the recipe. I make them for work parties, and even ... More","Comments":["Do you freeze these before or after baking? How does freezing affect baking temp and time?","pepperoni and cream cheese are not orange. what else is in there?","I followed all advice but I made a few changes. These are terrific! 1. Add 2 tablespoons hot salsa to the pizza mix. 2. Add basil about 2 teaspoons. For the crab mix: 1. Add two tablespoons of Horse Radish spread, (by the Miracle whip). 2. Add garlic For both, brush tops with egg whites -- ma... More","I didn't have very high expectations of these but decided to give it a try anyway. I am so glad that I did. I added some chopped sweet mini peppers in the cream cheese filling. It tastes like mini pizza! So good and so easy! Thanks for the recipe."],"Likes":316},{"Title":"BROCCOLI SALAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_589,h_331/v1/img/recipes/10/73/3/VWDxcr47TWGpQf1lztdM-Broccoli-Salad---10733-2.JPG","Description":"This is always a HIT with guests. I make this everytime we have a get together and the bowl is always left empty!!","Comments":["As written, this is 4 stars - it's a great salad but the cheese should really be cheddar. Also, I agree that some people would like nuts or a seed to add some crunch. The vinegar softens the broccoli, so i would recommend giving it a few hours to sit in the fridge before serving. Also: the sauce gets thin as... More","I made this salad about a month ago, I was looking for something new as far as salads go, and my DH loves broccoli. I make it adding crasins and sunflower seeds it was fabulous! I'm Making it again today for the 4th of July tomorrow don't have bacon so I will leave that out this time. but eve... More","I added, Red grapes, cut in half.. ( instead of the usual raisins) and sunflower seeds, too","I add 1 cup raisins and 1 cup sunflower seeds to my salad. I will try it with the cheese.","Yep, it is 5 star good."],"Likes":259},{"Title":"EASY MOIST BANANA BLUEBERRY MUFFINS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_562,h_316/v1/img/recipes/15/36/42/LKbiGfbmT1eg8QHt0WSH_banana-blueberry-muffins-4700.jpg","Description":"These muffins are super easy and super moist.","Comments":["Does anyone know approximately how many *cups* of mashed banana to use for this recipe (as opposed to the number of bananas)? Thanks!","I tried it. Was running low on bananas.. so added some milk to it and added 1/4th cup sugar. It was great. Didn't had a muffin pan so baked it on a cake pan for 50mins in 350 F. Gave it a 3 min standing time. The cake was super moist. Couldn't post a picture because it was dev... More","Super easy to make and taste fantastic. Will make again for sure.","Probably the best banana muffins I ever did. They were super easy and although I found the batter a little thick, I stick to the recipe and they came out perfect. I used organic unrefined coconut sugar and coconut oil instead of butter. Next time I want to try gluten-free all-purpose flour."],"Likes":171},{"Title":"SCALLOPED POTATOES AND HAM","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/51/94/4RlDSRGvQ56WmarFDXgv_SPAH 4 - final_2.png","Description":"","Comments":["Dice the ham. 1/8 to 1/4 in cubes. Any pepper will do - try red bell or jalapeno. Layer the potatoes on the bottom and then add the sauce, repeat at least once more. Top it off after the first 30 min with cheddar and sprinkle liberally with paprika.","How do I print a recipe? Thank you","Everyone who tries this recipe goes crazy for it! I used a red bell pepper because that's what I had on hand and it was delicious!","Great recipe! The only thing I changed was a reduction in salt to 1/2 tsp. This is my new ham and scalloped potato recipe. We loved it.","This was a hit. I made as recipe was written except omitted green peppers - just personal preference. I also only added about 3/4 tsp salt and flavour was great. I cooked covered for one hour and then uncovered for 1/2 hour. They came out perfectly! Will definitely make this again."],"Likes":288},{"Title":"CLASSIC POTATO SALAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/22/74/7/j31txphRKpaYLFhrGyYg_CPS 4 - final_2.jpg","Description":"I make this classic potato salad a lot for pot lucks and picnics. Everyone likes this recipe.","Comments":["It's been many years since I've made potato salad but, growing up in Amish country it's something I grew up with. For some reason I started to crave potato salad while thinking of what to make to accompany a steak on the grill on a beautiful summer day. So happy I found this recipe us... More","I would like to submit the mayo with yogurt. What are your thoughts on this? Any particular type that you recommend? Will I have to adjust the spicing if I do this?","This is my go to potato salad and everyone loves it! The only thing I do differently is add some chopped up bacon. Thanks for the awesome recipe!!","I'm wondering how many pounds would 8 medium potatoes weigh? I need to make 10 lbs for a community cookout . . .","The best potato salad I have ever tasted."],"Likes":320},{"Title":"PEANUT BUTTER COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/10/26/9/vjcU2ElJQ1OownokVBCt_c6.jpg","Description":"I've been baking these since I was a little girl. Nothing better than a glass of milk and a couple of warm peanut butter cookies!","Comments":["I loved everything about these cookies, particularly the lightness! I used all-natural, no-sugar crunchy peanut butter, followed the recipe exactly, and I think the sweetness level is fine.. even in the cookies where I hadn't sprinkled sugar on top. My friend wishes these were raised more, more l... More","these cookies are bangin. I bake them 6 to 8 at a time. I wrap the rest into a roll with plastic wrap and refrigerate. I cook them crispy with a little cane sugar on top before baking. mike.","This is my third time making them. The first time, I followed the directions completely. The second time, I added one chocolate chip to each cookie. This time/the third time I'm putting about half a cup of chocolate chips in the batter! I hope they turn well!"],"Likes":397},{"Title":"LOADED BAKED POTATO SALAD","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_610,h_343/v1/img/recipes/29/76/7/SONXjDvdTMSIv8OKsvSP_LBPS 6 - final_4.png","Description":"This is a dish my family and friends ask me to bring to potluck/cook-outs! NEVER any left to bring home! (my sister brings a bowl to take what MIGHT be left) Taste great hot out of the ... More","Comments":["This potato salad is a huge winner! Everyone loves it!","When I save a recipe, where do I find it?","l love potato salad","This recipe was delicious. I did not have the green onions. But Had everything else and was still good. Baked in oven for 15 to 20 minutes per recipes direction. Will definitely make again with the green onions."],"Likes":373},{"Title":"BEST GRILLED PORK CHOPS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_585,h_329/v1/img/recipes/27/21/0/DT14wSVKTrdBZOu7p2MR_GPC 4 - final_2.jpg","Description":"This is a simple recipe I have adapted from Company's Coming.It is simple to throw together the marinade in the morning before going off to work and coming home to an ... More","Comments":["My family devoured these! They were very juicy and flavorful - don't over cook!! I too was afraid of the amount of lemon pepper, but it is perfect. This one is a keeper.","The recipe is for grilled pork chops, but the picture shows pork chops swimming in grease (imo) frying in a skillet. Go figure.","someone asked a question which was never answered and I agree with the concern. You ask for 3 tablespoons of lemon pepper seasoning which seems way too much, did you mean 3 teaspoons? Not going to waste chops if this is not answered and the ingredient is wrong.","I followed the recipe as written. Sous Vide at 135° for an hour, pat them dry, then grill them if you really want perfection. 5 star easy recipe for sure. Thank you"],"Likes":384},{"Title":"ITALIAN WEDDING SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/14/06/1/picehYi5q.jpg","Description":"","Comments":["The only addition I made was adding onion to the soup. This is one of my families favorites- I have made it about four times and will continue!","I added 1/3 cup each of celery and onion to bump up the veggies and flavor. I also added 1 tablespoonful of corn starch stirred into 1/4 cup of cold water to make the broth a little thicker. I added garlic powder and Italian season blend to the broth. Instead of bread crumbs I used oa... More","I've added 1/3 cup each of celery and onion to bump up the veggies and flavor. I also added 1 tablespoonful of corn starch stirred into 1/4 cup of cold water to make the broth a little thicker. This soup is amazing, and I am so glad that I finally found a recipe that is both delicious and eas... More","I've made this three times, and I'm in love with this soup. I don't eat beef, so I've used turkey and sausage as a substitute and both were fantastic (I added more breadcrumbs to the sausage because it was more fatty and wouldn't hold together otherwise). I cook mine a little longer if I get ... More"],"Likes":291},{"Title":"MICROWAVE CHOCOLATE MUG BROWNIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_604,h_340/v1/img/recipes/34/92/46/22RvgokhR8OinCZplB99_untitled-2854.jpg","Description":"This makes a delicious brownie for one in about a minute. 60 seconds makes a molten center brownie. 75 seconds make a uniformly done brownie. Be careful not to overcook.","Comments":["Really rather sceptical that it's actually 442 calories. Even if you put the entire 2 tablespoons of butter that in itself would only be 180. 2 tablespoons sugar 90. Just saying....","So, I am a pretty good cook, so I decided to make this for my boyfriend thinking it would be fun, so I did and then I gave it to him and we ate and now he hasn't talked to me since December.","Its good quick and easy definetly reccommend","Im making this rn and the melted butter milk and salt always seem to get chunky so i usally just microwave it","I have made this several times with different tweaks. It's almost always a hit. I usually use less flour. Maybe 2 T. I use water rather than milk. And I always use dark, Dutch processed cocoa. Some tweaks that have worked: Use 1 T of whole wheat flour, 1 T regular - add a little bit more liquid. Use Better for Bread flo... More"],"Likes":352},{"Title":"BEST ALBONDIGAS SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/10/72/81/LObCmVJSKqwWRd80MCDf_albondigas-meatball-soup-1479.jpg","Description":"This albondigas soup recipe was given to me from my mother-in-law. It's definitely one my favorite soups. Honestly, it's better than most restaurants that I've t... More","Comments":["This recipe is so Delicious!!!! My husband has been begging me to make it again and even asked for the recipe to make it at the Fire station for all the guys.","The soup is really great. My family absolutely loves it. Thanks !","By far best recipe I have found for Albondigas Soup. Only tweaked the recipe slightly. I used mild Italian sausage instead of chorizo and I added sliced carrots and 1/2 tsp dried basil to the soup. My husband doesn't like this soup and he had 3 bowls!! Definitely keeping this in my arsena... More","I followed the recipe exact except had to switch carrots for zucchini, it was a winter storm weekend and local store didn't have zucchini. It came out amazing! I used 80/20 ground beef and had no problems at all with extra fat floating around the top. I've tried other recipes and this... More"],"Likes":185},{"Title":"THE BEST CHICKEN TORTILLA SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/10/40/86/Tqqs8OHMQNyu6ms59cUU-The-Best-Chicken-Tortilla-Soup---104086-1.JPG","Description":"I'm in love with this soup!! A very good friend of mine made this for me recently and I fell in love. I'm very picky about my Tortilla Soup and this by far th... More","Comments":["This soup is delicious I've made it so many times. I always add 1 can of corn and 1 can of black beans.","On the chicken tortilla soup I didn't use store brought chicken just roasted my own instead. I didn't use the tomato sauce instead I used a can of the red enchilada sauce as recommended and added two fresh tomato diced. Then I added a generous amount of sugar (1 tsp) to cut the acidity. Since... More","This is truly the best recipe for Chicken Tortilla Soup I have ever found. It is spicy but not overwhelming. The avocado on top with the cheese.... totally awesome!","This recipe is great as is or can be played with a little bit. My mother said it was one of the best tortilla soups she's ever had!","Added 2 cans organic black beans & 1 can chopped tomatoes"],"Likes":247},{"Title":"4 MINUTE SPICY GARLIC SHRIMP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/10/79/97/picSxulFo.jpg","Description":"Recipe is originally from the Food Network courtesy of Rachael Ray, but I tweaked it to fit our tastes. Very quick & easy shrimp recipe that's done on the stovetop. If your ta... More","Comments":["Simple, full of flavor. Love","HEAVENLY!! Touch of spice, delicious flavor! Enough said; thank you SO much!","I used clubhouse Greek seasoning instead of steak sauce and marinated the shrimp with everything except parsley before cooking it."],"Likes":342},{"Title":"UNCLE BILL'S GREEN SPLIT PEA WITH HAMBONE SOUP","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_601,h_338/v1/img/recipes/79/56/3/b1jcgv77R2OJ3MrvKD5Y_pea-and-ham-soup-4.jpg","Description":"This is my old fashioned style soup and is always enjoyed especially during the cold weather.","Comments":["...for years I'd been using the Fontier Soup kit for split peas. Last year, something about the spices changed (maybe it was my palette) but I couldn't stand the taste. Fast forward to this year and the left over ham bone from Christmas Eve. I knew I wanted my split pea soup but I was hesitant becaus... More","Not too long ago someone gave me the hambone, and I had no clue what to do with it. I came across this recipe and fell in love at first tasty spoon full! I think I'm on my 4th go around now, as I always ask for the hambone after a holiday! It's so easy and ridiculously good!","Perfect pea soup! I topped with lemon juice. My wife topped with sour cream.","I've made this recipe several times. It is the absolute BEST! Each time I make it I tweak it a little bit. This time I'm only using one onion and no salt. However I added 2 teaspoons of Better than Bouillon instead of 2 bouillon cubes, 1/2 teaspoon of Liquid Smoke and a tablespoon of Worcestershire sauce. Th... More","Ive always made pea soup with yellow split peas. That's what my mother used. Are the green split peas better? Or just a matter of choice. I always use a smoked pork hock, so delicious."],"Likes":252},{"Title":"WHITE CHICKEN CHILI","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/54/23/0/7b25GBnTQCiJjhsLX2Pn_IMG_5279 white chicken chili.jpg","Description":"Easy, delicious chili with a bit of a spicy bite. A friend served this to me one day and I fell in love with it.","Comments":["I purée an additional can of beans and add them to the chili to make it creamier. I lighten it up by adding nonfat, plain Greek yogurt, and fat free half & half.","I substituted for fresh jalapenos. I also added bell peppers as i wanted a few more veggies. This is the best chili i have ever had. Thank you for this recipe","Other than substituting 5 roasted, peeled and chopped Hatch Big Jim Green Chilis I made this recipe as written. It was delicious. Thanks for sharing.","Im a true foodie at heart. I love a spicy/heat factor but i was a little concerned. I didnt modify the ingredients at all and it was absolutely amazing, just enough bite but not overwhelming....I love this so much i am probably going to eat it until im sick of it haha. Thank you for sharing!!","I just made this and we Absolutely Loved it. ??"],"Likes":217},{"Title":"BACARDI RUM CAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/14/49/9/4B9e825xT4eqx14VuXK3_rum cake 1.jpg","Description":"This Bacardi rum cake is lovely and moist. I usually make it around New Years, makes a nice looking dessert for a buffet and the taste is rich and wonderful. From a... More","Comments":[],"Likes":193},{"Title":"SOFT MOLASSES COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/mpx/0278332_16x9.jpg","Description":"OK, Your cookie jar will be SO empty when you make these. Even better the day after. Very ADDICTIVE !!!!","Comments":["what did you use for shortening? I would not want to use Crisco (transfat in a can). Any one try it with coconut oil? or butter?","For Convection Bake is the recommendation for these cookies to reduce the temperature from 350 F to 325 F and keep the bake time at 9 - 10 minutes?","The easiest and best molasses ginger cookies I have ever made or eaten! Everyone I make them for rave about them. Thank you for this amazing recipe! Am baking a batch right now for Christmas and my kitchen smells heavenly!","Just made a batch! They are delicious! Just enough crunch, yet soft also. I am so glad I found this recipe!!"],"Likes":322},{"Title":"KITTENCAL'S EASY NO-FAIL MAKE ANYTIME TURKEY GRAVY","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_616,h_347/v1/img/mpx/0278327_16x9.jpg","Description":"I have been using this recipe for many years, my family loves this gravy and I have served it to dinner guests over the holidays and always receive rave reviews! --- you don't ... More","Comments":["Making gravy intimidates me, but I decided to try it. I found this recipe and I cannot believe how wonderful it turned out! THANK YOU!","Fabulous and so simple to make. I would suggest cooking the roux a bit longer in order to darken the gravy, but it tasted just fine as spelled out in the recipe. I noticed a few very negative reviews and I can only guess that they came from people who didn't follow the whisking instructions.","I haven't reviewed this yet, although I've made it dozens of times. It's an excellent recipe and easy to follow. Now I make the fabled gravy of my husband's grandmother!! Thanks, Kitten!!","Made this for Thanksgiving dinner! This was a wonderful gravy and it even got the thumbs up from the family. Thanks!"],"Likes":224},{"Title":"PAN-ROASTED BROCCOLI","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_622,h_350/v1/img/recipes/15/50/18/OFEkqju8TS6cOLve3aNC_pan roasted broccoli SITE-1.jpg","Description":"Pan-roasting broccoli results in a carmelized flavor, a completely different taste using broccoli, salt, and pepper. Adapted from Cook's Illustrated.","Comments":["I've been roasting broccoli and was bored with it. This recipe definitely revived my interest! I made it as written, except for adding extra water, and it was very tasty. I usually peel the stems but didn't this time and it's really not necessary.","I had fresh broccoli from the farmer's market that needed to be used. This was quick and easy, perfect for a weeknight meal. Served as a side with salmon and rice.","I have always roasted broccoli in the oven but this recipe is going to be my go-to! really quick and equally tasty!! I served it with a rice bowl but would be good with ANY dish"],"Likes":193},{"Title":"EASY BREAKFAST CASSEROLE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/38/06/5/Bn3ZE3NeQrGQFXJsW3r5_DSC_0229.jpg","Description":"This is a tasty and easy breakfast casserole. Serve with a bowl of fresh fruit. Wonderful!","Comments":["Cold and rainy out so why not start of with nice warm breakfast. First time making it and an using brown and served sausage links cooked in micro and chopped up plus little onion,green pepper and possibly small can green chili's. I'll take pic and let you know how turn out. Ok took pi... More","Made this to travel to a cabin for Christmas vacy with family. Baked it until it was just set, then popped it in the freezer. Traveled great to the cabin. Set it in the fridge overnight, then into the oven the next morning to finish baking. Was great! Served with a pan of biscuits, and clean up was a... More","Do you cook the jimmy dean sausage first","I need it for 8 people help"],"Likes":363},{"Title":"BEEF TIPS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_319/v1/img/recipes/17/99/0/5xlpyAPOSxGdaqmTLZ0o_BT 5 - final_3.jpg","Description":"","Comments":["You can find my adjustments in a lengthy explanation within the \"tweak\" category. I was being modest when I said I've made this about 22 times. The first two times, I followed the recipe exactly. Long story short (minus some extra ingredients): 1 tsp. of brown gravy powder (not ... More","Great base recipe; significant, easy tweaks needed. I've made this as-is twice, and about 20 times with ever-evolving tweaks. I finally nailed it. For the default 2-lb-of beef recipe, I use just over a pound of meat instead (extra sauce). Double the sauce if you're going to do a full ... More","How can I send this recipe to someone? There is no envelope anywhere to email it.","How can I adapt this recipe to a slow cooker?","Could this be done in a slow cooker?"],"Likes":207},{"Title":"WORLD'S BEST BUTTER COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/50/68/4/eBk9BRfIQPGrz9X8Txfk_butter cookies-2.jpg","Description":"I tested 8 different butter cookie recipes, looking for the \"perfect\" butter cookie. It had to be buttery, a little crumbly (like shortbread), and not too sweet. This... More","Comments":["How do I print this recipe?","can you use a cookie gun with this butter cookie receipe","My kids, husband, n-laws loved them! I used vegetable lard the first time, taste was delicious!, Second time I used butter and vegetable lard, same result very Delicious recipe!","I am giving these cookies 4 stars because they still spread a bit and didn't keep the cookie cutter shape at the temperature recommended. Once I dropped the temp to 300F and cooked them for 15 min they came out perfect! Nice and brown on the edges to give it the golden butter flavor! If y... More"],"Likes":205},{"Title":"LONG JOHN SILVER'S FISH BATTER","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/42/78/0/8GNQf2mRIikg5rrBcoyz_fishsticks-1423.jpg","Description":"Mom got this recipe from somewhere a long time ago and passed it on to me. Just multiply the amounts according to how much fish that you have to fry.","Comments":["This is nothing even close to LJS batter. Ive been cooking since i was a kid,and for a living for 25years. It's a quality base product,but you need to tweak it to the point that it shouldn't be a serious recipe. Please don't slam me,just understand it's my opinion. I know every person's taste is a li... More","Must use beer or sparkling water instead of water. Add more salt too. I sprinkled a little sugar in the batter too.","We love crispy Long John Silver's fish since 4-ever! But, the fries and other food tasted fishy at the restaraunt. This one worked fine for us. The only changes I made were adding 1/2-1 tsp. garlic powder, same w/ onion powder, paprika, & dashes of salt, black pepper, & red pepper. Possibly b... More","Omg...ive been looking for a recipe like this for years. Added Mrs Dash..garlic powder as seasoning. Made cod...shrimp and onion rings with the first batch. It was beyond my expectations. Thankyou!!!!","I added old bay and garlic powder amazing !!! I cut up an onion a jalepeno fried in a little bit of oil added a can of stewed tomatoes and topped the fish w this it was truly unbelievable !!!"],"Likes":255},{"Title":"BEST OATMEAL RAISIN COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/54/35/1/xiTTEfRQS1arLeYu5PDZ_BestOatmealCookies-54351-4.JPG","Description":"This is a family favorite that I have been making for years. It's the most requested oatmeal cookie recipe I've ever made. I found it somewhere years ago, but have ... More","Comments":["do you use light or dark brown sugar?","Yes, THE BEST oatmeal cookie recipe! Chewy and delicious, the smell baking is wonderful. I've made it several times for rave reviews from family and friends. Save this recipe !!!","Really enjoyed these oatmeal cookies. They have just the right amount of sweetness. I baked mine at 340f as I found my first batch was darker than I would have liked at 10 min.","I can't open whole recipe on my iPad. I click on see full recipe and nothing happens","I've made a lot of oatmeal cookies in my life, but none compare to this one. They are quite simply the best I've ever had. What a great recipe! Thank you so much!"],"Likes":300},{"Title":"LIBBY'S FAMOUS PUMPKIN PIE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/mpx/0278329_16x9.jpg","Description":"Well, after looking for this recipe on here and not having any luck, I decided to find it and post it. In my opinion, this is the best pumpkin pie. Make your own gr... More","Comments":["I have made Libbey's pumpkin pie for 40 years. I get a lot of praises! My original recipe doesn't use ginger but 1/2 tsp of nutmeg. I double the cinnamon for flavor and I also doubled the eggs! This gives it a custard like texture. Enjoy!!","I'm really disappointed with this recipe. I followed it exactly, but it ended up soggy & doesn't have enough flavor. I used unbaked pie crust as the recipe calls for, but I baked the pie in a ceramic pie dish and I'm thinking I probably should have done a blind bake first. I sifted through the re... More","This has definitely been my staple pumpkin pie recipe; I love it! The spices aren't overpowering, it's got a really nice balance of flavours: a bit creamy yet light and still full of flavour. I've made it with a no-roll pie crust (51537) and it works wonderfully. Everyone loves this pie.. it never lasts ... More","I've made the Libby's pumpkin pie many times with frozen pie shells and baking my own shells with similar soggy pie crusts. I'm 49 yrs. old and have never heard of \"Blind Baking\" a pie she'll. My sister and sister-in-laws had never heard of it either! So I tried it this year and it turned o... More","I use 12 oz of heavy whipping cream instead of the evaporated milk."],"Likes":244},{"Title":"CROCK POT CHICKEN, GRAVY AND STUFFING","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/34/70/ogZ68kwdRCGCEQXfkc7O_chicken-gravy-stuffing-3.jpg","Description":"","Comments":["Absolutely mouth-watering! I was worried about cooking it for 6 hours because our chicken was about the same size, or slightly bigger, than a chicken strip and not super thick. But we did everything as directed, and the chicken was still very tender and moist. Had enough gravy for a side ... More","Followed the directions as written, 6 hours on slow, and I must say it was the most tender chicken I have ever had. We ate almost all of it and I must disagree with the one that said there was no flavor: between the stuffing and the 2 soups, there was PERFECT flavor. I did not put any sal... More","I am giving this 5 stars because it really tastes good! I do have some suggestions though. First, if possible, get low sodium soup. We try to watch our sodium and this tasted a bit salty to me. I used the whole box of stuffing which was about 3 cups and I should have compensated with ... More","I made this yesterday following the recipe exactly. My family did not like it. The main problem was with the texture of the chicken after cooking in the crockpot. It was a weird combination of tender, but dry and tasteless. I think this may be better suited for oven cooking.","This is exactly the same taste that I was looking for. The recipe had a great taste and delicious and yummy.Before this recipe network, i will follow the ( https://www.sooperchef.pk/pakistani-recipes/ ). Video Tutorial also available for cooking."],"Likes":338},{"Title":"WHITE CHOCOLATE CHIP CRANBERRY OATMEAL COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/11/26/83/L39txDTNixmHgyqAdjWQ_untitled-9762.jpg","Description":"I originally made these at the request of my old chorus director John Kelleher, who also worked at Seattle area Starbucks (I think he'd had the combo in a coo... More","Comments":["So Delicious! Definitely making these on a regular basis!!","I grounded the Oatmeal and added it to the flour mixture and I also used salted butter instead of adding salt and I baked at 350 for 12 minutes."],"Likes":243},{"Title":"BEST PUMPKIN COOKIES","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/18/54/45/667N5wAThGyEOZu4Y0Ww_pumpkincookie3 (1 of 1).jpg","Description":"What can I say about these amazing pumpkin cookies... they are absolutely delicious! Let me put it this way. I baked these every year at Thanksgiving time ... More","Comments":["Made 45 cookies. Bland w/o the glaze","This cookie recipe is DELICIOUSLY PERFECT! I made it EXACTLY as the recipe instructed and it turned out fantastic! The cookie itself was exactly as I hoped—tender, cakelike consistency and perfectly flavored. The icing was over the top scrumptious! Yes, it's sweet-but it goes perfectly wi... More","Great recipe...easy to follow and fabulous tasting cookie cakes...I upped the measures of cinnamon and nutmeg cos that's how I roll... will make again !!!!","Is butter salted or unsalted?","I made mine with a gluten free flour blend. I used half flour and half oats and then added a cup of sliced almonds and limited the glaze. They're perfect for an easy source o f carbs and protein after I run! Thanks for the base I worked from!"],"Likes":229},{"Title":"HOMEMADE HAMBURGER BUNS (BREAD MACHINE)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/80/41/3/EYmOwn1OSnOladT38XFS_bread-machine-hamburger-buns-4684.jpg","Description":"You will never want to buy hamburger buns again after trying this recipe. Easy to do using a bread machine and so awesome! You can also top rolls with sesame seeds ... More","Comments":["I used 1.5c of skim milk and they were so light an fluffy! Delicious hot dog buns!","ANYONE MAKE THESE AT HIGH ALTITUDE..AND IF SO WHAT CHANGES DID YOU MAKE? THANKS.","I do not have a bread machine. Do you have this recipe for the traditional way to make bread?","OMG, these turned out sooooo good and so much better than store bought, I'll never buy them again. Using the bread machine made it easy and the results - Wow!! I did brush mine before baking with an egg white and top with toasted sesame seeds, the inside of these came out pill... More"],"Likes":242},{"Title":"THE BEST APPLE PIE MUFFINS EVER","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_566,h_319/v1/img/recipes/11/05/06/picxAX1MP.jpg","Description":"I got this recipe from a friend. I make these often and take them to many potlucks, office parties, the cottage, picnics, children's lunch and the list goes on. Recipe from t... More","Comments":["Delicious and used ingredients I had on hand and what a wonderful way to use up some buttermilk. Thanks for sharing!","These turned out great, the topping is delicious and they are just perfect for Fall events. I followed the recipie exactly as it is and it was awesome flavor. Will make again for sure.","I don't bake all that much. Exactly what kind of difference will adding baking powder (as some people have done) make to this muffin recipe (The Best Apple Pie Muffins Ever)? Will they be less dense? chewier? Does it have any impact on the flavour, or just the texture?","I had too many apples in my fridge so made these using some Pink Ladies and a couple other non-baking apples - and they turned out delicious anyway! I also subbed out Truvia Brown Sugar mix to reduce the sugar (and because I ran out of brown sugar). I'm not a huge fan of stevia, but it ba... More","These muffins are very tasty. I made several batches and can offer a tip. DO NOT \"melt\" the butter for the topping, use cold butter instead. If you do melt it you will not have crumbly topping but rather an impossible paste. Also I do recommend adding a teaspoon of cinnamon and a pi... More"],"Likes":272},{"Title":"CROCK POT WHITE CHICKEN CHILI","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_562,h_316/v1/img/recipes/11/47/89/ISH9RfKLSNamLhE1Wf6e_314-crock-pot-white-chicken-chili.jpg","Description":"This white chicken chili recipe is adapted from a Betty Crocker slow cooker recipes cookbook. I often use frozen chicken breasts, and it can also be prepared con... More","Comments":["Do I drain corn and beans for this recipe?","Delicious. We didn't use any of the toppings. Not enough chicken. We'll increase the amount off chicken next time.","I made the recipe exactly as directed and it was great. So easy to make. Just put ingredients in the crock pot & a few hours later you have a delicious chili! Thanks for sharing!","I made this for the first time for my fall festival at church last week and got great reviews. I doubled the recipe and used one fully cooked rotisserie chicken from Wal-Mart. I pulled the chicken off of the bones. It was better than I expected. I shortened the cooking by half. I used... More","Are you supposed to use raw or cooked chicken?"],"Likes":161},{"Title":"THICK AND CREAMY NEW ENGLAND CLAM CHOWDER","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/52/27/2/c6fmjvRQxGUOJdQMXdAl-Clam-Chowder---52272-3.JPG","Description":"This is the BEST chowder I've ever had. I've had chowder at Legal Seafoods in Boston, which I have to say is good, but mine is BETTER! If you like thick ch... More","Comments":["So you cook the potatoes just in the skillet with the juice? No water added?","I'ce made this several times. Great tasting recipe! To save some time and effort, I use one can cream of celery and one can cream of potato, then add 2-3 diced potatoes I also add a third can of clams or sometimes a can of crab meat.","Do I cover the pot during the instruction: \"Cook for about 30-45 minutes or until thickened.\" ?","I've used this recipe for years we love it. I half the recipe for just the two of us I use one can of Cream of Celery. When I don't half it I use a can of Cream of Celery and a can of Cream of Potato. I also use fewer potatoes and my hubby doesn't like the bacon in it but I use bacon grease for t... More"],"Likes":227},{"Title":"THE VERY BEST SALISBURY STEAK","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/56/69/4/42Ci6hYOTp5pIswQ8Eoa_salisbury-steak-01143.jpg","Description":"This is our favorite salisbury steak recipe. I always make enough extra sauce to serve over potatoes. Tastes like it took all day to cook.","Comments":["This is my favorite recipe for salisbury steaks! The gravy is fine as written, but I didn't like the ketchup in it, it made it a bit too sweet for my tastes, so I just leave that out and it still turns out great.","I don't have worchesterchire sauce what can I use?","Can make it and freeze it for five weeks? I want to make 1/4 once patties since I am serving other things as well.","I add fresh sliced mushrooms to the sauce, then pour over the steaks.","I didn't enjoy it as much as I thought I would. The ketchup was too sweet for me."],"Likes":236},{"Title":"OLIVE GARDEN FETTUCCINE ALFREDO","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_569,h_320/v1/img/recipes/85/96/7nqcwQZxSiOWr3jp4BgE_FettucineAlfredo3.jpg","Description":"Just like the famous restaraunt's dish.","Comments":["Olive Garden actually lists it's formal recipe on it's website. It does not list cream cheese. Why would I want to use it?","Delicious, entire family loved! Making for second time tonight! I take chicken breast salt and pepper and panko them fry I'm olive oil and cup up on top of Alfredo and noodles??","My go-to Alfredo recipe. If you would like to make it taste even better, use fresh parmesan, fresh garlic (not powder), fresh basil, freshly ground pepper, and fresh pasta. You can even add steamed broccoli, sautéed chicken breasts/tenderloins, or sautéed shrimp.","I add 8 oz cream cheese, use half n half instead of milk and add steamed broccoli and shredded chicken. It's so good!","Loved it and so did my family!!"],"Likes":208},{"Title":"CHICKEN POT PIE WITH 2 CRUSTS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/11/17/77/4M0LhAvZRZiwYwIkDGAN_DSC_6220.jpg","Description":"This is old-fashioned, from scratch, comfort food. This has been a family favorite for years. I like to take this to other families when they are in need of a meal. It... More","Comments":["What type of pie crust do you use? The regular or deep dish?","Does the bottom crust get cooked to not be soggy? I haven't tried this recipe, but it's on the calendar. Thanks!","I didn't modify this recipe at all. Super easy and my husband LOVED it! I used unsalted butter for the white sauce. There's a little salt in the recipe anyway, and in the crust as well, so you can always add more to taste. It was beautiful coming out of the oven and we ate half of it before I too... More","Can this be made ahead of time and reheated just before dinner?"],"Likes":215},{"Title":"CHILI'S SALSA","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/59/63/5/S3ImJ4QS46kXJfNRnKF9-Chlili-s-Salsa---59635-1.JPG","Description":"You can make this sauce easily at home. From Copykat.com (http://www.copykat.com)","Comments":["We're addicted to Chili's salsa and always bring home an extra bag of chips and bowl of salsa. I've been making this recipe for years. Because I normally cook for 2, and this recipe makes a lot of salsa, I had to modify it slightly. I use 1 (14oz) can of whole peeled tomatoes, plus ¼ diced fre... More","I've been working on my salsa skills for the past year. Usually I use fresh ingredients, or I cook the ingredients. It never even occurred to me to use canned tomatoes until I looked up this recipe. I am obsessed with Chili's salsa, so I decided to give this recipe a try. I used the sugge... More","What brand of tomatoes and chili's (for instance) - not a common typle of tomato like stewed, crushed, whole, puréed.... is it to be found in the Mexican section?","DEFINITELY needs some lime juice, about 2-3 T, and some cilantro. I love cilantro and use quite a bit, but add to taste","As did others, we also added lime, cilantro, black pepper and a touch more sugar. It was more to our liking."],"Likes":212},{"Title":"FANTASTIC TACO CASSEROLE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/15/51/86/iYi3OirmTM2ZelGLCJPf_0S9A5670.jpg","Description":"I originally found this taco casserole recipe in a Taste of Home magazine. Since then, I have made this recipe at least 50 times. I love it because the ingredi... More","Comments":["Delicious! Very good recipe, I'll keep this one!","I just be a taco snob because I thought this was just meh. It seemed like a LOT of beans compared to meat and chips, and there just wasn't really much unique about it. We ate it and it was fine but we'll keep regular tacos in the rotation instead of this.","Made it for my husband and myself tonight and we have one word for this casserole.... DELICIOUS!","Would really like the formula for \"taco seasoning\" so I don't have to buy an envelope of it with preservatives and chemicals in it. It seems like it would be so easy, anyone know the ingredients/proportions? Thanks in advance!","I've gone over the recipe a few times but can't figure out the salsa/cheese mixture. Does that go on top of refried beans?"],"Likes":292},{"Title":"CHICKEN AND DUMPLINGS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_568,h_320/v1/img/recipes/72/96/3/7yGCzjNRrWVr4d8h5f5A_chicken-and-dumplings-7188.jpg","Description":"My mom made a similar recipe for this comforting dish, and I still remember the wonderful aroma of chicken and dumplings cooking throughout the house. She did... More","Comments":["Not a bad recipe but it has some issues. 1st the vegetables are way over cooked if you put them in when directed. 2 There was too much chicken grease sitting on top. 3 The dumplings were not done in the middle. The flavor is really good so the next time I will Wait an put in the Vegetable... More","Super easy and quite tasty! I pre roasted my chicken to save time and it still was delicious; well done on the recipe! Thanks for sharing it!","Loved the broth and chicken. Made 2 batches, one with the regular dumplings, onevwith the southern dumplings. The family LOVES the broth and chicken!! No one liked EITHER dumpling...all dumplings from both batches were \"ick\". Too heavy, too gooey, no flavor.. all dumplings ended up ... More","This is the one I have been looking for. Have made at least four times now. I follow the recipe except that I double the dumplings every time now ."],"Likes":182},{"Title":"OATMEAL CHOCOLATE CHIP LACTATION COOKIES BY NOEL TRUJILLO","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_320/v1/img/recipes/19/23/46/pic3f2tcs.jpg","Description":"This recipe is great for mothers who are breastfeeding. It helps to keep your milk supply up or increase your milk supply. Use more brewers yeast and oatmeal if ... More","Comments":["These are delicious! I swapped out the chocolate chips for mini M&Ms ??","This is a great recipe - very flexible. I used half butter/half coconut oil, replaced 1 cup of flour with oat flour (oatmeal ground fine in the blender), peanut butter chips instead of chocolate chips, and nutritional yeast instead of brewer's because I had it on hand. I also cut the sugars b... More","These are the best lactation cookies I have found! Last time I made these I changed the chocolate chips to raisins. This time instead of the chocolate chips I used 1c white chocolate chips and 1c dried cranberries....and it was AMAZING!!!! HIGHLY RECOMMEND. I also noticed a boost in my milk w... More"],"Likes":154},{"Title":"PATTI LABELLE'S MACARONI AND CHEESE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/17/18/6/picSntKIZ.jpg","Description":"Got this off of the \"Good Morning America\" website after I saw her cook this on the show. This is the best macaroni and cheese I have ever tasted!!","Comments":["Can I make this ahead of time and keep in fridge for 6 hours before baking?","I am from Philly like miss Belle, peeps hail from NC where there was no!!! Velveeta in 1784!!!! Patti what cha doin????? ;-)","If I use 7 different cheeses do I have to use Velveeta (cubed) ?? Or is that the main cheese... Thank you. I dont cook much so that's why I'm asking..","I saw Patti on Tamron Hall the other day with her famous Mac n Cheese.. I'm making it as I post this for Thanksgiving dinner at my daughters...I cant wait to taste it as everyone else does..","This is the recipe I have used for years. The only difference is I don't use muenster or monteray jack cheeses and I use white pepper instead of black pepper."],"Likes":158},{"Title":"NEW YORK CHEESECAKE","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/57/02/5/10PIImsmQwqM1uXdc7FF_cheesecake-cherries-7411.jpg","Description":"What a delicious way to end a meal! There's nothing better than a great piece of New York Cheesecake!","Comments":["Do you have to make your own crust for this to work or can you just buy a graham cracker crust from the grocery store?","First time making cheesecake, and it was delicious. I followed recipe with a few minor changes thanks to reviewers. I made sure ingredients were all room temp and 15 second softened my cream cheese in microwave. I Lined the pan with round parchment. I added 4 tbsp of sugar to crus... More","Make this in my food processor only differences are: more lemon zest and about a tablespoon of lemon juice, sour cream instead of heavy cream, I use a water bath, foil tent, and it cooks a little longer this way. Turns out delicious and creamy every time. I also use chocolate chip teddy g... More","This is NOT a New York Cheesecake - I never saw a yellow cheesecake - will not make it again. Not sure if these 5 star reviews ever tasted a real New York Cheesecake"],"Likes":188},{"Title":"CHILI CON CARNE WITH BEANS","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_570,h_321/v1/img/recipes/11/14/9/jwHBjpOSQkqyD8wQmrjX_chili-con-carne-2.jpg","Description":"This is my father-in-laws recipe for chili. I love to make it on a cold winter night. Sometimes I serve it with Corn Chips in the bottom of the bowl, topped with the chil... More","Comments":["I agree that this is a great starter recipe. The first time I made it, I followed the directions and was pleased. Since then, I still use this as a base but add more beans and more seasoning. I also like a jalapeño or two for added spice.","Excellent receipe! Hearty chili that's got great flavor. Add pepper and jalapenos if you like and if you don't use the beer, add a cup of water. Quick and easy also!","Tried this last night even my picky husband lived it","Good starter recipe but some recommended tweaks: I'd omit both the tomato paste and canned tomatoes. The tomato sauce and canned diced tomatoes add plenty of tomato flavor and acidity. Double the beans. I personally use 1/2 black and 1/2 red kidney. Feel free to increase the amoun... More","Simmer covered? Rinse the beans [probably not and rinse away the chili flavor, but thot I'd better ask]? Don't you usually wait to put the garlic in AFTER the onions have cooked?"],"Likes":300},{"Title":"ALL-PURPOSE STIR-FRY SAUCE (BROWN GARLIC SAUCE)","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_564,h_317/v1/img/recipes/87/74/8/XgE320ArTs6wGV66nauD_0S9A9974.jpg","Description":"Adapted from Martin Yan's Chinese Cooking for Dummies. This is my favorite stir-fry sauce. It makes enough for two meals. Having extra on hand makes for... More","Comments":["Easy BEAUTIFUL and DELISH ! We are \"restaurant snobs\" and even though I appreciate all the effort it takes to be a restaurant, the food never measures up to our creations, even our \"won't make agains ;) \" ...anyhooo. I was pleased to make this for the first time and it will be... More","Wow, just what I was looking for! I did read some reviews and used low sodium soy sauce (which is the only one I keep in stock). Already had all ingredients in my pantry. Only change I made is ommiting the cooking oil. That is due to me only having crushed garlic and crushed ginger. I... More","How long can left over sauce be kept in the refrigerator ??","Sounds good but personally, wouldn't it just be easier to buy a good product?","Awesome recipe! I substituted the rice wine for a 1/6 cup of Marsala and added a bit of red pepper for kick. Great for edamame!"],"Likes":213},{"Title":"BEST BEEF STROGANOFF","Image":"https://img.sndimg.com:443/food/image/upload/c_thumb,q_80,w_567,h_319/v1/img/recipes/73/92/2/ZooItSRqnwY4lj8oh5wa_ground-beef-stroganoff-1972.jpg","Description":"My mom made this beef stroganoff weekly when I was younger. I don't have the same metabolism I did then, but it's still the best $%#&* beef stroganoff I h... More","Comments":["I don't write too many reviews but this recipe was worth and honorable mention. It was great!!","NO CANNED SOUP!!!! EVER! Fresh mushrooms, flour for roux, then cream to make real cream sauce. Add sour cream at end. No harder, way less like dorm food. And way less sodium and glucose than canned soup. I use turkey but brown in Worchestershire for a meaty taste.","I use 93% lean ground beef and do not drain it. I use 1 8 oz package of fresh mushrooms diced up and I saute then with the onions and garlic. I use 3 cloves of garlic instead of 1. 1 tsp of fresh ground pepper instead of 1/4. I add 2 TBSP of Worcestershire sauce to the ground beef when I put ... More","I used ground turkey. I also used fresh white mushrooms, instead of canned ones, and sauteed them with the onions and garlic. I also added .5lb of meat and an extra 1/2 can of soup.","My family and I enjoyed this recipe. My kids don't usually like mushrooms, but they ate this with no complaints. Awesome!"],"Likes":355}]